tinko26/ao/sys/ao_sys_xc32_pic32.c
// ----------------------------------------------------------------------------

// MIT License

// Copyright (c) 2022 Stefan Wagner

// Permission is hereby granted, free of charge, to any person obtaining a
// copy of this software and associated documentation files (the "Software"),
// to deal in the Software without restriction, including without limitation
// the rights to use, copy, modify, merge, publish, distribute, sublicense,
// and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
// FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
// DEALINGS IN THE SOFTWARE.

// ----------------------------------------------------------------------------

#include <ao.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <sys/kmem.h>
#include <xc.h>

// ----------------------------------------------------------------------------

#if defined AO_STACK

// ----------------------------------------------------------------------------

static  void *  ao_stack_get_beginning( void const * ptr);

static  void *  ao_stack_get_end(       void const * ptr, size_t size);

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

#if defined AO_SYS_XC32_PIC32

#if defined AO_IR

// ----------------------------------------------------------------------------

        ao_ir_stack_t   ao_ir_stack                                 __attribute__ ((used));

static  uint8_t         ao_ir_stack_store[AO_IR_STACK_SIZE_ALIGNED] __attribute__ ((used, aligned(AO_STACK_ALIGN)));

// ----------------------------------------------------------------------------

void ao_boot_ir_stack()
{
    uint8_t * sp;

    sp = ao_ir_stack_store;

    sp = sp + AO_IR_STACK_SIZE_ALIGNED;

    sp = sp - AO_IR_STACK_SIZE_AS;

    ao_ir_stack.sp = (uint32_t) sp;

#if AO_IR_STACK_FILL

    ao_stack_fill
    (
        (void *) ao_ir_stack_store,
        (size_t) AO_IR_STACK_SIZE_ALIGNED
    );

#endif

}

// ----------------------------------------------------------------------------

__attribute__ ((naked))
void * ao_ir_stack_func0(ao_func0_t func)
{
    // Variables.

    (void) func;


    // Ready.

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = &ao_ir_stack

    asm volatile ("la $k0, ao_ir_stack");

    // k1 = ao_ir_stack.depth

    asm volatile ("lw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // if (k1 != 0) then goto 1

    asm volatile ("bne $k1, $zero, 1f");

    // k1++

    asm volatile ("addiu $k1, $k1, 1");

    // ao_ir_stack.sp_backup = sp

    asm volatile ("sw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp_backup)));

    // ao_ir_stack.fp_backup = s8

    asm volatile ("sw $s8, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, fp_backup)));

    // sp = ao_ir_stack.sp

    asm volatile ("lw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp)));

    // s8 = sp

    asm volatile ("addu $s8, $sp, $zero");

    asm volatile ("1:");

    // ao_ir_stack.depth = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

#if AO_IR_STACK_DEPTH_MAX

    // sp -= 8

    asm volatile ("addiu $sp, $sp, -8");

    // Save s0.

    asm volatile ("sw $s0, 0($sp)");

    // s0 = ao_ir_stack.depth_max

    asm volatile ("lw $s0, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    // s0 = s0 - k1

    asm volatile ("subu $s0, $s0, $k1");

    // if (s0 >= 0) then goto 1

    asm volatile ("bgez $s0, 1f");
    asm volatile ("nop");

    // ao_ir_stack.depth_max = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    asm volatile ("1:");

    // Restore s0.

    asm volatile ("lw $s0, 0($sp)");

    // sp += 8

    asm volatile ("addiu $sp, $sp, 8");

#endif

    // Enable interrupts.

    asm volatile ("ei");
    asm volatile ("nop");

    // Save ra.

    asm volatile ("sw $ra, 20($sp)");

    // Execute.

    asm volatile (".set reorder");
    asm volatile (".set at");

    asm volatile ("jalr $a0");
    asm volatile ("nop");

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // Restore ra.

    asm volatile ("lw $ra, 20($sp)");

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = &ao_ir_stack

    asm volatile ("la $k0, ao_ir_stack");

    // k1 = ao_ir_stack.depth

    asm volatile ("lw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // k1--

    asm volatile ("addiu $k1, $k1, -1");

    // if (k1 != 0) then goto 1

    asm volatile ("bne $k1, $zero, 1f");

    // ao_ir_stack.depth = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // sp = ao_ir_stack.sp_backup

    asm volatile ("lw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp_backup)));

    // s8 = ao_ir_stack.fp_backup

    asm volatile ("lw $s8, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, fp_backup)));

    asm volatile ("1:");

    // Enable interrupts.

    asm volatile ("ei");
    asm volatile ("nop");

    // Return.

    asm volatile ("jr $ra");
    asm volatile ("nop");

    asm volatile (".set reorder");
    asm volatile (".set at");
}

__attribute__ ((naked))
void * ao_ir_stack_func1(void * param1, ao_func1_t func)
{
    // Variables.

