tinko26/ao/sys/ao_sys_xc32_pic32.c
    (void) param1;

    (void) func;


    // Ready.

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = &ao_ir_stack

    asm volatile ("la $k0, ao_ir_stack");

    // k1 = ao_ir_stack.depth

    asm volatile ("lw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // if (k1 != 0) then goto 1

    asm volatile ("bne $k1, $zero, 1f");

    // k1++

    asm volatile ("addiu $k1, $k1, 1");

    // ao_ir_stack.sp_backup = sp

    asm volatile ("sw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp_backup)));

    // ao_ir_stack.fp_backup = s8

    asm volatile ("sw $s8, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, fp_backup)));

    // sp = ao_ir_stack.sp

    asm volatile ("lw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp)));

    // s8 = sp

    asm volatile ("addu $s8, $sp, $zero");

    asm volatile ("1:");

    // ao_ir_stack.depth = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

#if AO_IR_STACK_DEPTH_MAX

    // sp -= 8

    asm volatile ("addiu $sp, $sp, -8");

    // Save s0.

    asm volatile ("sw $s0, 0($sp)");

    // s0 = ao_ir_stack.depth_max

    asm volatile ("lw $s0, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    // s0 = s0 - k1

    asm volatile ("subu $s0, $s0, $k1");

    // if (s0 >= 0) then goto 1

    asm volatile ("bgez $s0, 1f");
    asm volatile ("nop");

    // ao_ir_stack.depth_max = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    asm volatile ("1:");

    // Restore s0.

    asm volatile ("lw $s0, 0($sp)");

    // sp += 8

    asm volatile ("addiu $sp, $sp, 8");

#endif

    // Enable interrupts.

    asm volatile ("ei");
    asm volatile ("nop");

    // Save ra.

    asm volatile ("sw $ra, 20($sp)");

    // Execute.

    asm volatile (".set reorder");
    asm volatile (".set at");

    asm volatile ("jalr $a1");
    asm volatile ("nop");

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // Restore ra.

    asm volatile ("lw $ra, 20($sp)");

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = &ao_ir_stack

    asm volatile ("la $k0, ao_ir_stack");

    // k1 = ao_ir_stack.depth

    asm volatile ("lw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // k1--

    asm volatile ("addiu $k1, $k1, -1");

    // if (k1 != 0) then goto 1

    asm volatile ("bne $k1, $zero, 1f");

    // ao_ir_stack.depth = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // sp = ao_ir_stack.sp_backup

    asm volatile ("lw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp_backup)));

    // s8 = ao_ir_stack.fp_backup

    asm volatile ("lw $s8, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, fp_backup)));

    asm volatile ("1:");

    // Enable interrupts.

    asm volatile ("ei");
    asm volatile ("nop");

    // Return.

    asm volatile ("jr $ra");
    asm volatile ("nop");

    asm volatile (".set reorder");
    asm volatile (".set at");
}

__attribute__ ((naked))
void * ao_ir_stack_func2(void * param1, void * param2, ao_func2_t func)
{
    // Variables.

    (void) param1;

    (void) param2;

    (void) func;


    // Ready.

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = &ao_ir_stack

    asm volatile ("la $k0, ao_ir_stack");

    // k1 = ao_ir_stack.depth

    asm volatile ("lw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // if (k1 != 0) then goto 1

    asm volatile ("bne $k1, $zero, 1f");

    // k1++

    asm volatile ("addiu $k1, $k1, 1");

    // ao_ir_stack.sp_backup = sp

    asm volatile ("sw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp_backup)));

    // ao_ir_stack.fp_backup = s8

    asm volatile ("sw $s8, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, fp_backup)));

    // sp = ao_ir_stack.sp

    asm volatile ("lw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp)));

    // s8 = sp

    asm volatile ("addu $s8, $sp, $zero");

    asm volatile ("1:");

    // ao_ir_stack.depth = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

#if AO_IR_STACK_DEPTH_MAX

    // sp -= 8

    asm volatile ("addiu $sp, $sp, -8");

    // Save s0.

    asm volatile ("sw $s0, 0($sp)");

    // s0 = ao_ir_stack.depth_max

    asm volatile ("lw $s0, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    // s0 = s0 - k1

    asm volatile ("subu $s0, $s0, $k1");

    // if (s0 >= 0) then goto 1

    asm volatile ("bgez $s0, 1f");
    asm volatile ("nop");

    // ao_ir_stack.depth_max = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    asm volatile ("1:");

    // Restore s0.

    asm volatile ("lw $s0, 0($sp)");

    // sp += 8

    asm volatile ("addiu $sp, $sp, 8");

#endif

    // Enable interrupts.

    asm volatile ("ei");
    asm volatile ("nop");

    // Save ra.

    asm volatile ("sw $ra, 20($sp)");

    // Execute.

    asm volatile (".set reorder");
    asm volatile (".set at");

    asm volatile ("jalr $a2");
    asm volatile ("nop");

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // Restore ra.

    asm volatile ("lw $ra, 20($sp)");

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = &ao_ir_stack

    asm volatile ("la $k0, ao_ir_stack");

    // k1 = ao_ir_stack.depth

    asm volatile ("lw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // k1--

    asm volatile ("addiu $k1, $k1, -1");

    // if (k1 != 0) then goto 1

    asm volatile ("bne $k1, $zero, 1f");

    // ao_ir_stack.depth = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

