tinko26/ao/sys/ao_sys_xc32_pic32.c
    // sp = ao_ir_stack.sp_backup

    asm volatile ("lw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp_backup)));

    // s8 = ao_ir_stack.fp_backup

    asm volatile ("lw $s8, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, fp_backup)));

    asm volatile ("1:");

    // Enable interrupts.

    asm volatile ("ei");
    asm volatile ("nop");

    // Return.

    asm volatile ("jr $ra");
    asm volatile ("nop");

    asm volatile (".set reorder");
    asm volatile (".set at");
}

__attribute__ ((naked))
void * ao_ir_stack_func3(void * param1, void * param2, void * param3, ao_func3_t func)
{
    // Variables.

    (void) param1;

    (void) param2;

    (void) param3;

    (void) func;


    // Ready.

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = &ao_ir_stack

    asm volatile ("la $k0, ao_ir_stack");

    // k1 = ao_ir_stack.depth

    asm volatile ("lw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // if (k1 != 0) then goto 1

    asm volatile ("bne $k1, $zero, 1f");

    // k1++

    asm volatile ("addiu $k1, $k1, 1");

    // ao_ir_stack.sp_backup = sp

    asm volatile ("sw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp_backup)));

    // ao_ir_stack.fp_backup = s8

    asm volatile ("sw $s8, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, fp_backup)));

    // sp = ao_ir_stack.sp

    asm volatile ("lw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp)));

    // s8 = sp

    asm volatile ("addu $s8, $sp, $zero");

    asm volatile ("1:");

    // ao_ir_stack.depth = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

#if AO_IR_STACK_DEPTH_MAX

    // sp -= 8

    asm volatile ("addiu $sp, $sp, -8");

    // Save s0.

    asm volatile ("sw $s0, 0($sp)");

    // s0 = ao_ir_stack.depth_max

    asm volatile ("lw $s0, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    // s0 = s0 - k1

    asm volatile ("subu $s0, $s0, $k1");

    // if (s0 >= 0) then goto 1

    asm volatile ("bgez $s0, 1f");
    asm volatile ("nop");

    // ao_ir_stack.depth_max = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    asm volatile ("1:");

    // Restore s0.

    asm volatile ("lw $s0, 0($sp)");

    // sp += 8

    asm volatile ("addiu $sp, $sp, 8");

#endif

    // Enable interrupts,

    asm volatile ("ei");
    asm volatile ("nop");

    // Save ra.

    asm volatile ("sw $ra, 20($sp)");

    // Execute.

    asm volatile (".set reorder");
    asm volatile (".set at");

    asm volatile ("jalr $a3");
    asm volatile ("nop");

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // Restore ra.

    asm volatile ("lw $ra, 20($sp)");

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = &ao_ir_stack

    asm volatile ("la $k0, ao_ir_stack");

    // k1 = ao_ir_stack.depth

    asm volatile ("lw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // k1--

    asm volatile ("addiu $k1, $k1, -1");

    // if (k1 != 0) then goto 1

    asm volatile ("bne $k1, $zero, 1f");

    // ao_ir_stack.depth = k1

    asm volatile ("sw $k1, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // sp = ao_ir_stack.sp_backup

    asm volatile ("lw $sp, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, sp_backup)));

    // s8 = ao_ir_stack.fp_backup

    asm volatile ("lw $s8, %0($k0)" :: "K" (offsetof(ao_ir_stack_t, fp_backup)));

    asm volatile ("1:");

    // Enable interrupts.

    asm volatile ("ei");
    asm volatile ("nop");

    // Return.

    asm volatile ("jr $ra");
    asm volatile ("nop");

    asm volatile (".set reorder");
    asm volatile (".set at");
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_IR && AO_IR_STACK_FILL

// ----------------------------------------------------------------------------

void ao_ir_stack_high_water_mark()
{
    ao_ir_stack.high_water_mark = ao_stack_get_high_water_mark
    (
        (void *) ao_ir_stack_store,
        (size_t) AO_IR_STACK_SIZE_ALIGNED
    );
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_STACK

// ----------------------------------------------------------------------------

void ao_stack_fill(void * p, size_t s)
{
    // Variables.

    uint32_t * b;

    uint32_t * e;


    // Ready.

    if (p)
    {
        b = ao_stack_get_beginning(p);

        e = ao_stack_get_end(p, s);

        for (; b < e; b++)
        {
            *b = AO_STACK_FILL;
        }
    }
}

void * ao_stack_get_beginning(void const * p)
{
    uintptr_t t1 = (uintptr_t) p;

    uintptr_t t2 = ao_align_up(t1, AO_STACK_ALIGN);

    return (void *) t2;
}

void * ao_stack_get_end(void const * p, size_t s)
{
    uintptr_t t1 = (uintptr_t) p;

    uintptr_t t2 = (uintptr_t) s;

    uintptr_t t3 = t1 + t2;

    uintptr_t t4 = ao_align_down(t3, AO_STACK_ALIGN);

    return (void *) t4;
}

size_t ao_stack_get_high_water_mark(void const * p, size_t s)
{
    // Variables.

    uint32_t * b;

    uint32_t * e;


    // Ready.

    if (p)
    {
        b = ao_stack_get_beginning(p);

        e = ao_stack_get_end(p, s);

        if (b < e)
        {
            while (1)
            {
                if (*b == AO_STACK_FILL)
                {
                    b++;

                    if (b == e)
                    {
                        return 0;
                    }
                }

                else
                {
                    return sizeof(uint32_t) * (size_t) (e - b);
                }
            }
        }

        else
        {
            return 0;
        }
    }

    else
    {
        return 0;
    }
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_sys_idle()
{
    ao_sys_wait_idle();
    ao_sys_wait();
}

// ----------------------------------------------------------------------------

void ao_sys_lock_device(ao_sys_lock_device_t * x)
{
    ao_assert(x);

    SYSKEY = 0x0;

    ao_sys_unlock_dma(x->dma);

