tinko26/ao/sys/ao_sys_xc32_pic32.c
    ao_sys_unlock_ie(x->ie);
}

uint32_t ao_sys_lock_dma()
{
    // DMA controller is suspended.

    uint32_t x = DMACON & _DMACON_SUSPEND_MASK;

    if (x) { }

    // DMA controller is not suspended.

    else
    {
        DMACONSET = _DMACON_SUSPEND_MASK;

#ifdef _DMACON_DMABUSY_MASK

        // Family Reference Manual.

        // Section 31.4.5.

        // The DMACON.DMABUSY bit is not available on all devices.

        while (DMACONbits.DMABUSY) { }

#endif

    }

    return x;
}

// ----------------------------------------------------------------------------

__attribute__ ((noreturn))
void ao_sys_reset()
{
    // Variables.

    uint32_t volatile d;

    ao_sys_lock_device_t l;


    // Ready.

    ao_sys_unlock_device(&l);
    {
        RSWRSTbits.SWRST = 1;

        d = RSWRST;

        while (1) { }
    }
    ao_sys_lock_device(&l);
}

// ----------------------------------------------------------------------------

void ao_sys_sleep()
{
    ao_sys_wait_sleep();
    ao_sys_wait();
}

// ----------------------------------------------------------------------------

void ao_sys_unlock_device(ao_sys_lock_device_t * x)
{
    ao_assert(x);

    x->ie = ao_sys_lock_ie();

    x->dma = ao_sys_lock_dma();

    // First, make sure that the device is actually locked.

    SYSKEY = 0x0;

    // Then, perform the unlock sequence.

    SYSKEY = 0xAA996655;
    SYSKEY = 0x556699AA;
}

void ao_sys_unlock_dma(uint32_t x)
{
    if (x) { }

    else
    {
        DMACONCLR = _DMACON_SUSPEND_MASK;
    }
}

// ----------------------------------------------------------------------------

void ao_sys_wait()
{
    // Notes.

    // In the following, we save the return address before the wait and restore
    // it afterwards. Here's why.

    // If we use the watchdog timer (WDT) to wake up the device, then following
    // a WDT timeout event, a non-maskable interrupt (NMI) is generated, that
    // vectors execution to the CPU start-up address.

    // The NMI saves the PC to ErrorEPC
    // and sets both Status.ERL and Status.NMI.

    // At the CPU start-up address, there's the _reset() function.
    // The following roughly demonstrates what's going on from there,
    // after a WDT timeout event in idle or sleep mode.


    // _reset:

    // jal _startup
    // nop


    // _startup:

    // if (Status.NMI)
    // {
    //   jr _nmi_handler
    //   nop
    // }


    // _nmi_handler:

    // eret


    // The eret instructions restores the PC from ErrorEPC, because Status.ERL
    // is set.

    // As a result, the CPU continues execution with the instruction following
    // the wait instruction.

    // Obviously, after the wait the value of the return address register (ra)
    // has changed, because the _reset() function executed a jal instruction,
    // which writes the ra register.


    // Ready.

    // directives
    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // sp -= 8
    asm volatile ("addiu $sp, $sp, -8");

    // save ra
    asm volatile ("sw $ra, 0($sp)");

    // wait
    asm volatile ("wait");

    // restore ra
    asm volatile ("lw $ra, 0($sp)");

    // sp += 8
    asm volatile ("addiu $sp, $sp, 8");

    // directives
    asm volatile (".set reorder");
    asm volatile (".set at");
}

void ao_sys_wait_idle()
{
    ao_sys_lock_device_t l;

    ao_sys_unlock_device(&l);
    {
        OSCCONCLR = _OSCCON_SLPEN_MASK;
    }
    ao_sys_lock_device(&l);
}

void ao_sys_wait_sleep()
{
    ao_sys_lock_device_t l;

    ao_sys_unlock_device(&l);
    {
        OSCCONSET = _OSCCON_SLPEN_MASK;
    }
    ao_sys_lock_device(&l);
}

// ----------------------------------------------------------------------------

#endif

#endif

// ----------------------------------------------------------------------------

#if defined AO_SYS_XC32_PIC32MK

#if defined AO_ALARM

// ----------------------------------------------------------------------------

AO_IR_CT_ATTRIBUTE
void ao_ir_ct()
{
    ao_ir_stack_func0((ao_func0_t) ao_alarm);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_sys_lock_pps(ao_sys_lock_pps_t * x)
{
    ao_assert(x);

    uint32_t t1 = x->io & _CFGCON_IOLOCK_MASK;

    uint32_t t2 = CFGCON & ~_CFGCON_IOLOCK_MASK;

    CFGCON = t1 | t2;

    ao_sys_lock_device(&x->device);
}

void ao_sys_unlock_pps(ao_sys_lock_pps_t * x)
{
    ao_assert(x);

    ao_sys_unlock_device(&x->device);

    uint32_t i = CFGCON;

    CFGCON = i & ~_CFGCON_IOLOCK_MASK;

    x->io = i;
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_TASK

// ----------------------------------------------------------------------------

static  void    ao_task_stack_check();

// ----------------------------------------------------------------------------

AO_IR_CS1_ATTRIBUTE
void ao_ir_cs1()
{
    // Prolog.

    // Interrupts are disabled, because Status.EXL == 1.

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // Make room for the context.

    asm volatile ("addiu $sp, $sp, -%0" :: "K" (sizeof(ao_task_context_data_t)));

    // Save s0.
    // Save s1.
    // Save s2.
    // Save s3.
    // Save s8.

    asm volatile ("sw $s0, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s0)));
    asm volatile ("sw $s1, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s1)));
    asm volatile ("sw $s2, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s2)));
    asm volatile ("sw $s3, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s3)));
    asm volatile ("sw $s8, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s8)));

    // s1 = sp

    asm volatile ("addu $s1, $sp, $zero");

    // Switch to the interrupt stack.

    // We can safely use k0 and k1, because interrupts are disabled.

    // s0 = &ao_ir_stack

    asm volatile ("la $s0, ao_ir_stack");

