tinko26/ao/sys/ao_sys_xc32_pic32.c
    // k1 = 1

    asm volatile ("addiu $k1, $zero, 1");

    // sp = ao_ir_stack.sp

    asm volatile ("lw $sp, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, sp)));

    // ao_ir_stack.depth = k1

    asm volatile ("sw $k1, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // s8 = sp

    asm volatile ("addu $s8, $sp, $zero");

#if AO_IR_STACK_DEPTH_MAX

    // k0 = ao_ir_stack.depth_max

    asm volatile ("lw $k0, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    // k0 = k0 - 1

    asm volatile ("addiu $k0, $k0, -1");

    // if (k0 >= 0) then goto 1

    asm volatile ("bgez $k0, 1f");
    asm volatile ("nop");

    // ao_ir_stack.depth_max = k1

    asm volatile ("sw $k1, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    asm volatile ("1:");

#endif

    // k1 = EPC

    asm volatile ("mfc0 $k1, $%0, %1" :: "K" (_CP0_EPC), "K" (_CP0_EPC_SELECT));

    // k0 = Status

    asm volatile ("mfc0 $k0, $%0, %1" :: "K" (_CP0_STATUS), "K" (_CP0_STATUS_SELECT));

    // Save EPC.

    asm volatile ("sw $k1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, epc)));

    // Save Status.

    asm volatile ("sw $k0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, status)));

    // Manipulate the Status value contained in k0.

    // Status.IPL = AO_IR_CS1_PRIO
    // Status.EXL = 0
    // Status.ERL = 0
    // Status.UM  = 0

    // k1 = AO_IR_CS1_PRIO

    asm volatile ("addiu $k1, $zero, %0" :: "K" (AO_IR_CS1_PRIO));

    // k0.IPL = k1

    asm volatile ("ins $k0, $k1, %0, %1" :: "K" (_CP0_STATUS_IPL_POSITION), "K" (_CP0_STATUS_IPL_LENGTH));

    // k0.EXL = 0
    // k0.ERL = 0
    // k0.UM  = 0

    asm volatile ("ins $k0, $zero, %0, %1" :: "K" (_CP0_STATUS_EXL_POSITION), "K" (_CP0_STATUS_UM_POSITION - _CP0_STATUS_EXL_POSITION + 1));

    // Enable interrupts whose priority is greater than the switch priority.

    // Status = k0

    asm volatile ("mtc0 $k0, $%0, %1" :: "K" (_CP0_STATUS), "K" (_CP0_STATUS_SELECT));

    // Interrupts are enabled now.

    // Therefore, we must not use k0 and k1 anymore.

    // Save GPR.

    asm volatile ("sw $a0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a0)));
    asm volatile ("sw $a1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a1)));
    asm volatile ("sw $a2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a2)));
    asm volatile ("sw $a3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a3)));
    asm volatile ("sw $at, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, at)));
    asm volatile ("sw $ra, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, ra)));
    asm volatile ("sw $s4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s4)));
    asm volatile ("sw $s5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s5)));
    asm volatile ("sw $s6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s6)));
    asm volatile ("sw $s7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s7)));
    asm volatile ("sw $t0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t0)));
    asm volatile ("sw $t1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t1)));
    asm volatile ("sw $t2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t2)));
    asm volatile ("sw $t3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t3)));
    asm volatile ("sw $t4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t4)));
    asm volatile ("sw $t5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t5)));
    asm volatile ("sw $t6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t6)));
    asm volatile ("sw $t7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t7)));
    asm volatile ("sw $t8, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t8)));
    asm volatile ("sw $t9, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t9)));
    asm volatile ("sw $v0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, v0)));
    asm volatile ("sw $v1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, v1)));

    // Save hi.
    // Save lo.

    asm volatile ("mfhi $s2");
    asm volatile ("mflo $s3");
    asm volatile ("sw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi)));
    asm volatile ("sw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo)));

    // Save hi1.
    // Save lo1.

    asm volatile ("mfhi $s2, $ac1");
    asm volatile ("mflo $s3, $ac1");
    asm volatile ("sw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi1)));
    asm volatile ("sw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo1)));

    // Save hi2.
    // Save lo2.

    asm volatile ("mfhi $s2, $ac2");
    asm volatile ("mflo $s3, $ac2");
    asm volatile ("sw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi2)));
    asm volatile ("sw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo2)));

    // Save hi3.
    // Save lo3.

    asm volatile ("mfhi $s2, $ac3");
    asm volatile ("mflo $s3, $ac3");
    asm volatile ("sw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi3)));
    asm volatile ("sw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo3)));

    // Save DSPControl.

    asm volatile ("rddsp $s2");
    asm volatile ("sw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, dsp_control)));

    // Save FCSR.

    asm volatile ("cfc1 $s2, $f31");
    asm volatile ("sw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, fcsr)));

    // Save f0 .. f31.

    asm volatile ("sdc1 $f0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f0)));
    asm volatile ("sdc1 $f1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f1)));
    asm volatile ("sdc1 $f2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f2)));
    asm volatile ("sdc1 $f3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f3)));
    asm volatile ("sdc1 $f4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f4)));
    asm volatile ("sdc1 $f5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f5)));
    asm volatile ("sdc1 $f6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f6)));
    asm volatile ("sdc1 $f7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f7)));
    asm volatile ("sdc1 $f8, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f8)));
    asm volatile ("sdc1 $f9, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f9)));
    asm volatile ("sdc1 $f10, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f10)));
    asm volatile ("sdc1 $f11, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f11)));
    asm volatile ("sdc1 $f12, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f12)));
    asm volatile ("sdc1 $f13, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f13)));
    asm volatile ("sdc1 $f14, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f14)));
    asm volatile ("sdc1 $f15, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f15)));
    asm volatile ("sdc1 $f16, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f16)));
    asm volatile ("sdc1 $f17, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f17)));
    asm volatile ("sdc1 $f18, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f18)));
    asm volatile ("sdc1 $f19, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f19)));
    asm volatile ("sdc1 $f20, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f20)));
    asm volatile ("sdc1 $f21, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f21)));
    asm volatile ("sdc1 $f22, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f22)));
    asm volatile ("sdc1 $f23, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f23)));
    asm volatile ("sdc1 $f24, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f24)));
    asm volatile ("sdc1 $f25, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f25)));
    asm volatile ("sdc1 $f26, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f26)));
    asm volatile ("sdc1 $f27, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f27)));
    asm volatile ("sdc1 $f28, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f28)));
    asm volatile ("sdc1 $f29, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f29)));
    asm volatile ("sdc1 $f30, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f30)));
    asm volatile ("sdc1 $f31, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f31)));

