tinko26/ao/sys/ao_sys_xc32_pic32.c
    // Body.

    // s2 = &ao_task_running

    asm volatile ("la $s2, ao_task_running");

    // s3 = ao_task_running[0]

    asm volatile ("lw $s3, 0($s2)");

    // ao_task_running[0]->context.ptr = s1

    asm volatile ("sw $s1, %0($s3)" :: "K" (offsetof(ao_task_t, context.ptr)));

#if AO_TASK_STACK_CHECK

    asm volatile (".set reorder");
    asm volatile (".set at");

    asm volatile ("jal ao_task_stack_check");
    asm volatile ("nop");

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

#else

    asm volatile (".set reorder");
    asm volatile (".set at");

    asm volatile ("jal ao_task_switch");
    asm volatile ("nop");

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

#endif

    // s3 = ao_task_running[0]

    asm volatile ("lw $s3, 0($s2)");

    // s1 = ao_task_running[0]->context.ptr

    asm volatile ("lw $s1, %0($s3)" :: "K" (offsetof(ao_task_t, context.ptr)));

    // Epilog.

    // Restore GPR.

    asm volatile ("lw $a0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a0)));
    asm volatile ("lw $a1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a1)));
    asm volatile ("lw $a2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a2)));
    asm volatile ("lw $a3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a3)));
    asm volatile ("lw $at, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, at)));
    asm volatile ("lw $ra, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, ra)));
    asm volatile ("lw $s4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s4)));
    asm volatile ("lw $s5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s5)));
    asm volatile ("lw $s6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s6)));
    asm volatile ("lw $s7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s7)));
    asm volatile ("lw $t0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t0)));
    asm volatile ("lw $t1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t1)));
    asm volatile ("lw $t2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t2)));
    asm volatile ("lw $t3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t3)));
    asm volatile ("lw $t4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t4)));
    asm volatile ("lw $t5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t5)));
    asm volatile ("lw $t6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t6)));
    asm volatile ("lw $t7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t7)));
    asm volatile ("lw $t8, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t8)));
    asm volatile ("lw $t9, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t9)));
    asm volatile ("lw $v0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, v0)));
    asm volatile ("lw $v1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, v1)));

    // Restore hi.
    // Restore lo.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi)));
    asm volatile ("lw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo)));
    asm volatile ("mthi $s2");
    asm volatile ("mtlo $s3");

    // Restore hi1.
    // Restore lo1.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi1)));
    asm volatile ("lw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo1)));
    asm volatile ("mthi $s2, $ac1");
    asm volatile ("mtlo $s3, $ac1");

    // Restore hi2.
    // Restore lo2.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi2)));
    asm volatile ("lw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo2)));
    asm volatile ("mthi $s2, $ac2");
    asm volatile ("mtlo $s3, $ac2");

    // Restore hi3.
    // Restore lo3.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi3)));
    asm volatile ("lw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo3)));
    asm volatile ("mthi $s2, $ac3");
    asm volatile ("mtlo $s3, $ac3");

    // Restore DSPControl.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, dsp_control)));
    asm volatile ("wrdsp $s2");

    // Restore FCSR.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, fcsr)));
    asm volatile ("ctc1 $s2, $f31");

    // Restore f0 .. f31.

    asm volatile ("ldc1 $f0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f0)));
    asm volatile ("ldc1 $f1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f1)));
    asm volatile ("ldc1 $f2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f2)));
    asm volatile ("ldc1 $f3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f3)));
    asm volatile ("ldc1 $f4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f4)));
    asm volatile ("ldc1 $f5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f5)));
    asm volatile ("ldc1 $f6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f6)));
    asm volatile ("ldc1 $f7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f7)));
    asm volatile ("ldc1 $f8, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f8)));
    asm volatile ("ldc1 $f9, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f9)));
    asm volatile ("ldc1 $f10, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f10)));
    asm volatile ("ldc1 $f11, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f11)));
    asm volatile ("ldc1 $f12, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f12)));
    asm volatile ("ldc1 $f13, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f13)));
    asm volatile ("ldc1 $f14, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f14)));
    asm volatile ("ldc1 $f15, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f15)));
    asm volatile ("ldc1 $f16, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f16)));
    asm volatile ("ldc1 $f17, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f17)));
    asm volatile ("ldc1 $f18, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f18)));
    asm volatile ("ldc1 $f19, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f19)));
    asm volatile ("ldc1 $f20, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f20)));
    asm volatile ("ldc1 $f21, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f21)));
    asm volatile ("ldc1 $f22, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f22)));
    asm volatile ("ldc1 $f23, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f23)));
    asm volatile ("ldc1 $f24, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f24)));
    asm volatile ("ldc1 $f25, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f25)));
    asm volatile ("ldc1 $f26, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f26)));
    asm volatile ("ldc1 $f27, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f27)));
    asm volatile ("ldc1 $f28, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f28)));
    asm volatile ("ldc1 $f29, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f29)));
    asm volatile ("ldc1 $f30, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f30)));
    asm volatile ("ldc1 $f31, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f31)));

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = EPC

    asm volatile ("lw $k0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, epc)));

    // k1 = Status

