tinko26/ao/sys/ao_sys_xc32_pic32.c
    asm volatile ("lw $k1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, status)));

    // Restore EPC.

    asm volatile ("mtc0 $k0, $%0, %1" :: "K" (_CP0_EPC), "K" (_CP0_EPC_SELECT));

    // Restore Status.

    asm volatile ("mtc0 $k1, $%0, %1" :: "K" (_CP0_STATUS), "K" (_CP0_STATUS_SELECT));

    // ao_ir_stack.depth = 0

    asm volatile ("sw $zero, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // sp = s1

    asm volatile ("addu $sp, $s1, $zero");

    // Restore s0.
    // Restore s1.
    // Restore s2.
    // Restore s3.
    // Restore s8.

    asm volatile ("lw $s0, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s0)));
    asm volatile ("lw $s1, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s1)));
    asm volatile ("lw $s2, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s2)));
    asm volatile ("lw $s3, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s3)));
    asm volatile ("lw $s8, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s8)));

    // Restore sp.

    asm volatile ("addiu $sp, $sp, %0" :: "K" (sizeof(ao_task_context_data_t)));

    // Return from exception.

    asm volatile ("eret");
    asm volatile ("nop");

    asm volatile (".set reorder");
    asm volatile (".set at");
}

// ----------------------------------------------------------------------------

void ao_task_start_context(ao_task_t * T)
{
    // Notes.

    // The kernel is locked.


    // Assert.

    ao_assert(T);


    // Variables.

    void * b;

    ao_task_context_data_t * D;

    void * e;

    uint32_t * p;

    size_t s;


    // Ready.

    // Stack.

    b = ao_task_get_stack_beginning_locked(T);

    ao_assert(b);

    s = ao_task_get_stack_size_locked(T);

    e = ao_stack_get_end(b, s);

    // Stack pointer.

    p = e;

    // Stack pointer must be properly aligned.

    ao_assert(ao_is_aligned((uintptr_t) p, AO_STACK_ALIGN));

    // According to the MIPS O32 calling convention, the stack frame of the
    // caller must have an argument section. The argument section must contain
    // enough space for all the arguments of the callee, but at least four
    // words.

    p = p - 4;

    // Make room for the context.

    p = p - sizeof(ao_task_context_data_t) / 4;

    // Stack pointer must not overflow.

    ao_assert(p >= (uint32_t *) b);

    // Context.

    D = (ao_task_context_data_t *) p;

    D->a0 = (uint32_t) T;

    D->dsp_control = 0;

    D->epc = (uint32_t) ao_task_entry;

    D->fcsr = 0x01600000;

    // When generating interrupt handlers, the XC32 compiler assumes that both DSP and FPU are usable.

    // Therefore, the Status register bits CU1 and MX must always be set.

    D->status =
        _CP0_STATUS_CU1_MASK |
        _CP0_STATUS_EXL_MASK |
        _CP0_STATUS_FR_MASK  |
        _CP0_STATUS_IE_MASK  |
        _CP0_STATUS_MX_MASK;

    T->context.ptr = D;
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_TASK && AO_TASK_STACK_CHECK

// ----------------------------------------------------------------------------

void ao_task_stack_check()
{
    // Notes.

    // This function is called by the task switch interrupt handler.

    // The kernel is not locked.


    // Variables.

    void * b;

    void * e;

    void * p;

    size_t s1;

    size_t s2;

    ao_task_t * T;

    ptrdiff_t t3;


    // Ready.

    T = ao_task_running[0];

    ao_assert(T);

    p = T->context.ptr;

    if (p == NULL)
    {
        ao_task_stack_null(T);
    }

    else
    {
        // The kernel is not locked.

        // But, the task stack must not change while the task is started.

        // Therefore, we can read the task stack properties as if the kernel was locked.

        b = ao_task_get_stack_beginning_locked(T);

        ao_assert(b);

        if (p < b)
        {
            ao_task_stack_overflow(T);
        }

        else
        {
            s1 = ao_task_get_stack_size_locked(T);

            ao_assert(s1 > 0);

            e = ao_stack_get_end(b, s1);

            if (p >= e)
            {
                ao_task_stack_underflow(T);
            }

            else
            {
                s2 = (size_t) ((uint8_t *) e - (uint8_t *) p);

                s2 = s2 * 100 / s1;

                if (s2 >= AO_TASK_STACK_THRESHOLD)
                {
                    ao_task_stack_threshold(T, s2);
                }
            }
        }
    }

    ao_task_switch();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MK_GP

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t r = ao_sys_id_revision();

    uint32_t w;


    // Ready.

    ao_sys_kseg0_cacheable_write_back_alloc();

    // DS80000737.

    // Silicon Errata Issue 51.

    if (r == AO_SYS_ID_REVISION_A1) { }

    else
    {
        // DS60001402.

        // Section 10. Prefetch Module.

        w = (AO_SYS_SYSCLK <= 60000000UL) ? 1 : 3;

        ao_sys_pfm_ws_set(w);

        ao_sys_pref_enable_cacheable();
    }
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MK_GPG

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t w;


    // Ready.

    // DS60001570.

    // Section 9. Prefetch Module.

    // ECC disabled.

    if (DEVCFG0bits.FECCCON & 0x10)
    {
        w = (AO_SYS_SYSCLK <= 116000000UL) ? 1 : 2;
    }

    // ECC enabled.

    else
    {
        w = (AO_SYS_SYSCLK <=  96000000UL) ? 1 : 2;
    }

    ao_sys_pfm_ws_set(w);

    ao_sys_kseg0_cacheable_write_back_alloc();

    ao_sys_pref_enable_cacheable();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MK_GPK

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t w;


    // Ready.

    // DS60001519.

    // Section 10. Prefetch Module.

    // ECC disabled.

    if (DEVCFG0bits.FECCCON & 0x10)
    {
        w = (AO_SYS_SYSCLK <= 110000000UL) ? 1 : 2;
    }

