tinko26/ao/sys/ao_sys_xc32_pic32.c
    // ECC enabled.

    else
    {
        w = (AO_SYS_SYSCLK <= 96000000UL) ? 1 : 2;
    }

    ao_sys_pfm_ws_set(w);

    ao_sys_kseg0_cacheable_write_back_alloc();

    ao_sys_pref_enable_cacheable();
}

// ----------------------------------------------------------------------------

#endif

#endif

// ----------------------------------------------------------------------------

#if defined AO_SYS_XC32_PIC32MX

#if defined AO_ALARM

// ----------------------------------------------------------------------------

AO_IR_CT_ATTRIBUTE
void ao_ir_ct()
{
    ao_ir_stack_func0((ao_func0_t) ao_alarm);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_TASK

// ----------------------------------------------------------------------------

static  void    ao_task_stack_check();

// ----------------------------------------------------------------------------

AO_IR_CS1_ATTRIBUTE
void ao_ir_cs1()
{
    // Prolog.

    // Interrupts are disabled, because Status.EXL == 1.

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

    // Make room for the context.

    asm volatile ("addiu $sp, $sp, -%0" :: "K" (sizeof(ao_task_context_data_t)));

    // Save s0.
    // Save s1.
    // Save s8.

    asm volatile ("sw $s0, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s0)));
    asm volatile ("sw $s1, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s1)));
    asm volatile ("sw $s8, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s8)));

    // s1 = sp

    asm volatile ("addu $s1, $sp, $zero");

    // Switch to the interrupt stack.

    // We can safely use k0 and k1, because interrupts are disabled.

    // s0 = &ao_ir_stack

    asm volatile ("la $s0, ao_ir_stack");

    // k1 = 1

    asm volatile ("addiu $k1, $zero, 1");

    // sp = ao_ir_stack.sp

    asm volatile ("lw $sp, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, sp)));

    // ao_ir_stack.depth = k1

    asm volatile ("sw $k1, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // s8 = sp

    asm volatile ("addu $s8, $sp, $zero");

#if AO_IR_STACK_DEPTH_MAX

    // k0 = ao_ir_stack.depth_max

    asm volatile ("lw $k0, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    // k0 = k0 - 1

    asm volatile ("addiu $k0, $k0, -1");

    // if (k0 >= 0) then goto 1

    asm volatile ("bgez $k0, 1f");
    asm volatile ("nop");

    // ao_ir_stack.depth_max = k1

    asm volatile ("sw $k1, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, depth_max)));

    asm volatile ("1:");

#endif

    // k1 = EPC

    asm volatile ("mfc0 $k1, $%0, %1" :: "K" (_CP0_EPC), "K" (_CP0_EPC_SELECT));

    // k0 = Status

    asm volatile ("mfc0 $k0, $%0, %1" :: "K" (_CP0_STATUS), "K" (_CP0_STATUS_SELECT));

    // Save EPC.

    asm volatile ("sw $k1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, epc)));

    // Save Status.

    asm volatile ("sw $k0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, status)));

    // Manipulate the Status value contained in k0.

    // Status.IPL = AO_IR_CS1_PRIO
    // Status.EXL = 0
    // Status.ERL = 0
    // Status.UM  = 0

    // k1 = AO_IR_CS1_PRIO

    asm volatile ("addiu $k1, $zero, %0" :: "K" (AO_IR_CS1_PRIO));

    // k0.IPL = k1

    asm volatile ("ins $k0, $k1, %0, %1" :: "K" (_CP0_STATUS_IPL_POSITION), "K" (_CP0_STATUS_IPL_LENGTH));

    // k0.EXL = 0
    // k0.ERL = 0
    // k0.UM  = 0

    asm volatile ("ins $k0, $zero, %0, %1" :: "K" (_CP0_STATUS_EXL_POSITION), "K" (_CP0_STATUS_UM_POSITION - _CP0_STATUS_EXL_POSITION + 1));

    // Enable interrupts whose priority is greater than the switch priority.

    // Status = k0

    asm volatile ("mtc0 $k0, $%0, %1" :: "K" (_CP0_STATUS), "K" (_CP0_STATUS_SELECT));

    // Interrupts are enabled now.

    // Therefore, we must not use k0 and k1 anymore.

    // Save GPR.

    asm volatile ("sw $a0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a0)));
    asm volatile ("sw $a1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a1)));
    asm volatile ("sw $a2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a2)));
    asm volatile ("sw $a3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a3)));
    asm volatile ("sw $at, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, at)));
    asm volatile ("sw $ra, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, ra)));
    asm volatile ("sw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s2)));
    asm volatile ("sw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s3)));
    asm volatile ("sw $s4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s4)));
    asm volatile ("sw $s5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s5)));
    asm volatile ("sw $s6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s6)));
    asm volatile ("sw $s7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s7)));
    asm volatile ("sw $t0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t0)));
    asm volatile ("sw $t1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t1)));
    asm volatile ("sw $t2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t2)));
    asm volatile ("sw $t3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t3)));
    asm volatile ("sw $t4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t4)));
    asm volatile ("sw $t5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t5)));
    asm volatile ("sw $t6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t6)));
    asm volatile ("sw $t7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t7)));
    asm volatile ("sw $t8, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t8)));
    asm volatile ("sw $t9, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t9)));
    asm volatile ("sw $v0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, v0)));
    asm volatile ("sw $v1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, v1)));

    // Save hi.
    // Save lo.

    asm volatile ("mfhi $s2");
    asm volatile ("mflo $s3");
    asm volatile ("sw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi)));
    asm volatile ("sw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo)));

