tinko26/ao/sys/ao_sys_xc32_pic32.c
    // Body.

    // s2 = &ao_task_running

    asm volatile ("la $s2, ao_task_running");

    // s3 = ao_task_running[0]

    asm volatile ("lw $s3, 0($s2)");

    // ao_task_running[0]->context.ptr = s1

    asm volatile ("sw $s1, %0($s3)" :: "K" (offsetof(ao_task_t, context.ptr)));

#if AO_TASK_STACK_CHECK

    asm volatile (".set reorder");
    asm volatile (".set at");

    asm volatile ("jal ao_task_stack_check");
    asm volatile ("nop");

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

#else

    asm volatile (".set reorder");
    asm volatile (".set at");

    asm volatile ("jal ao_task_switch");
    asm volatile ("nop");

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

#endif

    // s3 = ao_task_running[0]

    asm volatile ("lw $s3, 0($s2)");

    // s1 = ao_task_running[0]->context.ptr

    asm volatile ("lw $s1, %0($s3)" :: "K" (offsetof(ao_task_t, context.ptr)));

    // Epilog.

    // Restore hi.
    // Restore lo.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi)));
    asm volatile ("lw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo)));
    asm volatile ("mthi $s2");
    asm volatile ("mtlo $s3");

    // Restore GPR.

    asm volatile ("lw $a0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a0)));
    asm volatile ("lw $a1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a1)));
    asm volatile ("lw $a2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a2)));
    asm volatile ("lw $a3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, a3)));
    asm volatile ("lw $at, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, at)));
    asm volatile ("lw $ra, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, ra)));
    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s2)));
    asm volatile ("lw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s3)));
    asm volatile ("lw $s4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s4)));
    asm volatile ("lw $s5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s5)));
    asm volatile ("lw $s6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s6)));
    asm volatile ("lw $s7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, s7)));
    asm volatile ("lw $t0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t0)));
    asm volatile ("lw $t1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t1)));
    asm volatile ("lw $t2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t2)));
    asm volatile ("lw $t3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t3)));
    asm volatile ("lw $t4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t4)));
    asm volatile ("lw $t5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t5)));
    asm volatile ("lw $t6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t6)));
    asm volatile ("lw $t7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t7)));
    asm volatile ("lw $t8, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t8)));
    asm volatile ("lw $t9, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, t9)));
    asm volatile ("lw $v0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, v0)));
    asm volatile ("lw $v1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, v1)));

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = EPC

    asm volatile ("lw $k0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, epc)));

    // k1 = Status

    asm volatile ("lw $k1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, status)));

    // Restore EPC.

    asm volatile ("mtc0 $k0, $%0, %1" :: "K" (_CP0_EPC), "K" (_CP0_EPC_SELECT));

    // Restore Status.

    asm volatile ("mtc0 $k1, $%0, %1" :: "K" (_CP0_STATUS), "K" (_CP0_STATUS_SELECT));

    // ao_ir_stack.depth = 0

    asm volatile ("sw $zero, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // sp = s1

    asm volatile ("addu $sp, $s1, $zero");

    // Restore s0.
    // Restore s1.
    // Restore s8.

    asm volatile ("lw $s0, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s0)));
    asm volatile ("lw $s1, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s1)));
    asm volatile ("lw $s8, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s8)));

    // Restore sp.

    asm volatile ("addiu $sp, $sp, %0" :: "K" (sizeof(ao_task_context_data_t)));

    // Return from exception.

    asm volatile ("eret");
    asm volatile ("nop");

    asm volatile (".set reorder");
    asm volatile (".set at");
}

// ----------------------------------------------------------------------------

void ao_task_start_context(ao_task_t * T)
{
    // Notes.

    // The kernel is locked.


    // Assert.

    ao_assert(T);


    // Variables.

    void * b;

    ao_task_context_data_t * D;

    void * e;

    uint32_t * p;

    size_t s;


    // Ready.

    // Stack.

    b = ao_task_get_stack_beginning_locked(T);

    ao_assert(b);

    s = ao_task_get_stack_size_locked(T);

    e = ao_stack_get_end(b, s);

    // Stack pointer.

    p = e;

    // Stack pointer must be properly aligned.

    ao_assert(ao_is_aligned((uintptr_t) p, AO_STACK_ALIGN));

    // According to the MIPS O32 calling convention, the stack frame of the
    // caller must have an argument section. The argument section must contain
    // enough space for all the arguments of the callee, but at least four
    // words.

    p = p - 4;

    // Make room for the context.

    p = p - sizeof(ao_task_context_data_t) / 4;

    // Stack pointer must not overflow.

    ao_assert(p >= (uint32_t *) b);

    // Context.

    D = (ao_task_context_data_t *) p;

    D->a0 = (uint32_t) T;

    D->epc = (uint32_t) ao_task_entry;

    D->status =
        _CP0_STATUS_EXL_MASK  |
        _CP0_STATUS_IE_MASK;

    T->context.ptr = D;
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_TASK && AO_TASK_STACK_CHECK

// ----------------------------------------------------------------------------

void ao_task_stack_check()
{
    // Notes.

