tinko26/ao/sys/ao_sys_xc32_pic32.c
    // This function is called by the task switch interrupt handler.

    // The kernel is not locked.


    // Variables.

    void * b;

    void * e;

    void * p;

    size_t s1;

    size_t s2;

    ao_task_t * T;

    ptrdiff_t t3;


    // Ready.

    T = ao_task_running[0];

    ao_assert(T);

    p = T->context.ptr;

    if (p == NULL)
    {
        ao_task_stack_null(T);
    }

    else
    {
        // The kernel is not locked.

        // But, the task stack must not change while the task is started.

        // Therefore, we can read the task stack properties as if the kernel was locked.

        b = ao_task_get_stack_beginning_locked(T);

        ao_assert(b);

        if (p < b)
        {
            ao_task_stack_overflow(T);
        }

        else
        {
            s1 = ao_task_get_stack_size_locked(T);

            ao_assert(s1 > 0);

            e = ao_stack_get_end(b, s1);

            if (p >= e)
            {
                ao_task_stack_underflow(T);
            }

            else
            {
                s2 = (size_t) ((uint8_t *) e - (uint8_t *) p);

                s2 = s2 * 100 / s1;

                if (s2 >= AO_TASK_STACK_THRESHOLD)
                {
                    ao_task_stack_threshold(T, s2);
                }
            }
        }
    }

    ao_task_switch();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MX_1XX

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    ao_sys_kseg0_cacheable();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MX_1XX_64_100

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    ao_sys_kseg0_cacheable();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MX_1XX_XLP

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t w;


    // Ready.

    // DS60001404.

    // Section 33. Electrical Characteristics.

    if (AO_SYS_SYSCLK < 19000000UL)
    {
        w = 0;
    }

    else if (AO_SYS_SYSCLK < 37000000UL)
    {
        w = 1;
    }

    else if (AO_SYS_SYSCLK < 55000000UL)
    {
        w = 2;
    }

    else
    {
        w = 3;
    }

    ao_sys_pfm_ws_set(w);

    ao_sys_kseg0_cacheable();

    ao_sys_pref_enable_cacheable();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MX_330

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t w;


    // Ready.

    // DS60001185.

    // Section 31. Electrical Characteristics.

    if (AO_SYS_SYSCLK < 31000000UL)
    {
        w = 0;
    }

    else if (AO_SYS_SYSCLK < 61000000UL)
    {
        w = 1;
    }

    else if (AO_SYS_SYSCLK < 101000000UL)
    {
        w = 2;
    }

    else
    {
        w = 3;
    }

    ao_sys_pfm_ws_set(w);

    ao_sys_kseg0_cacheable();

    ao_sys_pref_enable_cacheable();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MX_3XX

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t w;


    // Ready.

    // DS61143.

    // Section 29. Electrical Characteristics.

    if (AO_SYS_SYSCLK < 31000000UL)
    {
        w = 0;
    }

    else if (AO_SYS_SYSCLK < 61000000UL)
    {
        w = 1;
    }

    else
    {
        w = 2;
    }

    ao_sys_pfm_ws_set(w);

    ao_sys_kseg0_cacheable();

    ao_sys_pref_enable_cacheable();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MX_5XX

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t w;


    // Ready.

    // DS60001156.

    // Section 32. Electrical Characteristics.

    if (AO_SYS_SYSCLK < 31000000UL)
    {
        w = 0;
    }

    else if (AO_SYS_SYSCLK < 61000000UL)
    {
        w = 1;
    }

    else
    {
        w = 2;
    }

    ao_sys_pfm_ws_set(w);

    ao_sys_kseg0_cacheable();

    ao_sys_pref_enable_cacheable();
}

// ----------------------------------------------------------------------------

#endif

#endif

// ----------------------------------------------------------------------------

#if defined AO_SYS_XC32_PIC32MZ

#if defined AO_ALARM

// ----------------------------------------------------------------------------

AO_IR_CT_ATTRIBUTE
void ao_ir_ct()
{
    ao_ir_stack_func0((ao_func0_t) ao_alarm);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_sys_lock_pps(ao_sys_lock_pps_t * x)
{
    ao_assert(x);

    uint32_t t1 = x->io & _CFGCON_IOLOCK_MASK;

    uint32_t t2 = CFGCON & ~_CFGCON_IOLOCK_MASK;

    CFGCON = t1 | t2;

    ao_sys_lock_device(&x->device);
}

void ao_sys_unlock_pps(ao_sys_lock_pps_t * x)
{
    ao_assert(x);

    ao_sys_unlock_device(&x->device);

    uint32_t i = CFGCON;

    CFGCON = i & ~_CFGCON_IOLOCK_MASK;

    x->io = i;
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_TASK

// ----------------------------------------------------------------------------

static  void    ao_task_stack_check();

// ----------------------------------------------------------------------------

AO_IR_CS1_ATTRIBUTE
void ao_ir_cs1()
{
    // Prolog.

    // Interrupts are disabled, because Status.EXL == 1.

    asm volatile (".set nomips16");
    asm volatile (".set noreorder");
    asm volatile (".set noat");

