tinko26/ao/sys/ao_sys_xc32_pic32.c
    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi1)));
    asm volatile ("lw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo1)));
    asm volatile ("mthi $s2, $ac1");
    asm volatile ("mtlo $s3, $ac1");

    // Restore hi2.
    // Restore lo2.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi2)));
    asm volatile ("lw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo2)));
    asm volatile ("mthi $s2, $ac2");
    asm volatile ("mtlo $s3, $ac2");

    // Restore hi3.
    // Restore lo3.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, hi3)));
    asm volatile ("lw $s3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, lo3)));
    asm volatile ("mthi $s2, $ac3");
    asm volatile ("mtlo $s3, $ac3");

    // Restore DSPControl.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, dsp_control)));
    asm volatile ("wrdsp $s2");

    // Restore FCSR.

    asm volatile ("lw $s2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, fcsr)));
    asm volatile ("ctc1 $s2, $f31");

    // Restore f0 .. f31.

    asm volatile ("ldc1 $f0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f0)));
    asm volatile ("ldc1 $f1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f1)));
    asm volatile ("ldc1 $f2, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f2)));
    asm volatile ("ldc1 $f3, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f3)));
    asm volatile ("ldc1 $f4, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f4)));
    asm volatile ("ldc1 $f5, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f5)));
    asm volatile ("ldc1 $f6, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f6)));
    asm volatile ("ldc1 $f7, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f7)));
    asm volatile ("ldc1 $f8, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f8)));
    asm volatile ("ldc1 $f9, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f9)));
    asm volatile ("ldc1 $f10, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f10)));
    asm volatile ("ldc1 $f11, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f11)));
    asm volatile ("ldc1 $f12, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f12)));
    asm volatile ("ldc1 $f13, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f13)));
    asm volatile ("ldc1 $f14, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f14)));
    asm volatile ("ldc1 $f15, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f15)));
    asm volatile ("ldc1 $f16, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f16)));
    asm volatile ("ldc1 $f17, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f17)));
    asm volatile ("ldc1 $f18, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f18)));
    asm volatile ("ldc1 $f19, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f19)));
    asm volatile ("ldc1 $f20, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f20)));
    asm volatile ("ldc1 $f21, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f21)));
    asm volatile ("ldc1 $f22, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f22)));
    asm volatile ("ldc1 $f23, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f23)));
    asm volatile ("ldc1 $f24, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f24)));
    asm volatile ("ldc1 $f25, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f25)));
    asm volatile ("ldc1 $f26, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f26)));
    asm volatile ("ldc1 $f27, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f27)));
    asm volatile ("ldc1 $f28, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f28)));
    asm volatile ("ldc1 $f29, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f29)));
    asm volatile ("ldc1 $f30, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f30)));
    asm volatile ("ldc1 $f31, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, f31)));

    // Disable interrupts.

    asm volatile ("di");
    asm volatile ("ehb");

    // k0 = EPC

    asm volatile ("lw $k0, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, epc)));

    // k1 = Status

    asm volatile ("lw $k1, %0($s1)" :: "K" (offsetof(ao_task_context_data_t, status)));

    // Restore EPC.

    asm volatile ("mtc0 $k0, $%0, %1" :: "K" (_CP0_EPC), "K" (_CP0_EPC_SELECT));

    // Restore Status.

    asm volatile ("mtc0 $k1, $%0, %1" :: "K" (_CP0_STATUS), "K" (_CP0_STATUS_SELECT));

    // ao_ir_stack.depth = 0

    asm volatile ("sw $zero, %0($s0)" :: "K" (offsetof(ao_ir_stack_t, depth)));

    // sp = s1

    asm volatile ("addu $sp, $s1, $zero");

    // Restore s0.
    // Restore s1.
    // Restore s2.
    // Restore s3.
    // Restore s8.

    asm volatile ("lw $s0, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s0)));
    asm volatile ("lw $s1, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s1)));
    asm volatile ("lw $s2, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s2)));
    asm volatile ("lw $s3, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s3)));
    asm volatile ("lw $s8, %0($sp)" :: "K" (offsetof(ao_task_context_data_t, s8)));

    // Restore sp.

    asm volatile ("addiu $sp, $sp, %0" :: "K" (sizeof(ao_task_context_data_t)));

    // Return from exception.

    asm volatile ("eret");
    asm volatile ("nop");

    asm volatile (".set reorder");
    asm volatile (".set at");
}

// ----------------------------------------------------------------------------

void ao_task_start_context(ao_task_t * T)
{
    // Notes.

    // The kernel is locked.


    // Assert.

    ao_assert(T);


    // Variables.

    void * b;

    ao_task_context_data_t * D;

    void * e;

    uint32_t * p;

    size_t s;


    // Ready.

    // Stack.

    b = ao_task_get_stack_beginning_locked(T);

    ao_assert(b);

    s = ao_task_get_stack_size_locked(T);

    e = ao_stack_get_end(b, s);

    // Stack pointer.

    p = e;

    // Stack pointer must be properly aligned.

    ao_assert(ao_is_aligned((uintptr_t) p, AO_STACK_ALIGN));

    // According to the MIPS O32 calling convention, the stack frame of the
    // caller must have an argument section. The argument section must contain
    // enough space for all the arguments of the callee, but at least four
    // words.

