tinko26/ao/sys/ao_sys_xc32_pic32.c
    p = p - 4;

    // Make room for the context.

    p = p - sizeof(ao_task_context_data_t) / 4;

    // Stack pointer must not overflow.

    ao_assert(p >= (uint32_t *) b);

    // Context.

    D = (ao_task_context_data_t *) p;

    D->a0 = (uint32_t) T;

    D->dsp_control = 0;

    D->epc = (uint32_t) ao_task_entry;

    D->fcsr = 0x01600000;

    // When generating interrupt handlers, the XC32 compiler assumes that both DSP and FPU are usable.

    // Therefore, the Status register bits CU1 and MX must always be set.

    D->status =
        _CP0_STATUS_CU1_MASK |
        _CP0_STATUS_EXL_MASK |
        _CP0_STATUS_FR_MASK  |
        _CP0_STATUS_IE_MASK  |
        _CP0_STATUS_MX_MASK;

    T->context.ptr = D;
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_TASK && AO_TASK_STACK_CHECK

// ----------------------------------------------------------------------------

void ao_task_stack_check()
{
    // Notes.

    // This function is called by the task switch interrupt handler.

    // The kernel is not locked.


    // Variables.

    void * b;

    void * e;

    void * p;

    size_t s1;

    size_t s2;

    ao_task_t * T;

    ptrdiff_t t3;


    // Ready.

    T = ao_task_running[0];

    ao_assert(T);

    p = T->context.ptr;

    if (p == NULL)
    {
        ao_task_stack_null(T);
    }

    else
    {
        // The kernel is not locked.

        // But, the task stack must not change while the task is started.

        // Therefore, we can read the task stack properties as if the kernel was locked.

        b = ao_task_get_stack_beginning_locked(T);

        ao_assert(b);

        if (p < b)
        {
            ao_task_stack_overflow(T);
        }

        else
        {
            s1 = ao_task_get_stack_size_locked(T);

            ao_assert(s1 > 0);

            e = ao_stack_get_end(b, s1);

            if (p >= e)
            {
                ao_task_stack_underflow(T);
            }

            else
            {
                s2 = (size_t) ((uint8_t *) e - (uint8_t *) p);

                s2 = s2 * 100 / s1;

                if (s2 >= AO_TASK_STACK_THRESHOLD)
                {
                    ao_task_stack_threshold(T, s2);
                }
            }
        }
    }

    ao_task_switch();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MZ_DA

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t w;


    // Ready.

    // DS60001361.

    // Section 44. Electrical Characteristics.

    // ECC disabled.

    if (DEVCFG0bits.FECCCON & 0x10)
    {
        if (AO_SYS_SYSCLK <= 74000000UL)
        {
            w = 0;
        }

        else if (AO_SYS_SYSCLK <= 140000000UL)
        {
            w = 1;
        }

        else
        {
            w = 2;
        }
    }

    // ECC enabled.

    else
    {
        if (AO_SYS_SYSCLK <= 60000000UL)
        {
            w = 0;
        }

        else if (AO_SYS_SYSCLK <= 120000000UL)
        {
            w = 1;
        }

        else
        {
            w = 2;
        }
    }

    ao_sys_pfm_ws_set(w);

    ao_sys_kseg0_cacheable_write_back_alloc();

    ao_sys_pref_enable_instructions_and_data();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MZ_DAK

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t w;


    // Ready.

    // DS60001565.

    // Section 44. Electrical Characteristics.

    // ECC disabled.

    if (DEVCFG0bits.FECCCON & 0x10)
    {
        if (AO_SYS_SYSCLK <= 74000000UL)
        {
            w = 0;
        }

        else if (AO_SYS_SYSCLK <= 140000000UL)
        {
            w = 1;
        }

        else
        {
            w = 2;
        }
    }

    // ECC enabled.

    else
    {
        if (AO_SYS_SYSCLK <= 60000000UL)
        {
            w = 0;
        }

        else if (AO_SYS_SYSCLK <= 120000000UL)
        {
            w = 1;
        }

        else
        {
            w = 2;
        }
    }

    ao_sys_pfm_ws_set(w);

    ao_sys_kseg0_cacheable_write_back_alloc();

    ao_sys_pref_enable_instructions_and_data();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MZ_EC

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t w;


    // Ready.

    // DS60001191.

    // Section 37. Electrical Characteristics.

    // DS80000588.

    // Silicon Errata Issue 2.

    // ECC disabled.

    if (DEVCFG0bits.FECCCON & 0x10)
    {
        if (AO_SYS_SYSCLK <= 74000000UL)
        {
            w = 0;
        }

        else if (AO_SYS_SYSCLK <= 140000000UL)
        {
            w = 1;
        }

        else
        {
            w = 2;
        }
    }

    // ECC enabled.

    else
    {
        if (AO_SYS_SYSCLK <= 60000000UL)
        {
            w = 0;
        }

        else if (AO_SYS_SYSCLK <= 120000000UL)
        {
            w = 1;
        }

        else
        {
            w = 2;
        }
    }

    ao_sys_pfm_ws_set(w);

    ao_sys_kseg0_cacheable_write_back_alloc();

    ao_sys_pref_enable_instructions_and_data();
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MZ_EF

#if defined AO_SYS

// ----------------------------------------------------------------------------

void ao_boot_sys_pcache()
{
    // Variables.

    uint32_t r;

    uint32_t w;


    // Ready.

    // DS60001320.

    // Section 37. Electrical Characteristics.

    // ECC disabled.

    if (DEVCFG0bits.FECCCON & 0x10)
    {
        if (AO_SYS_SYSCLK <= 74000000UL)
        {
            w = 0;
        }

        else if (AO_SYS_SYSCLK <= 140000000UL)
        {
            w = 1;
        }

        else
        {
            // DS80000663.

            // Silicon Errata Issue 38.

