tinko26/ao/sys/ao_sys_xc32_pic32.c
            r = ao_sys_id_revision();

            if (r == AO_SYS_ID_REVISION_B2)
            {
                if (AO_SYS_SYSCLK <= 184000000UL)
                {
                    w = 2;
                }

                else
                {
                    w = 3;
                }
            }

            else
            {
                w = 2;
            }
        }
    }

    // ECC enabled.

    else
    {
        if (AO_SYS_SYSCLK <= 60000000UL)
        {
            w = 0;
        }

        else if (AO_SYS_SYSCLK <= 120000000UL)
        {
            w = 1;
        }

        else
        {
            // DS80000663.

            // Silicon Errata Issue 38.

            r = ao_sys_id_revision();

            if (r == AO_SYS_ID_REVISION_B2)
            {
                if (AO_SYS_SYSCLK <= 184000000UL)
                {
                    w = 2;
                }

                else
                {
                    w = 3;
                }
            }

            else
            {
                w = 2;
            }
        }
    }

    ao_sys_pfm_ws_set(w);

    ao_sys_kseg0_cacheable_write_back_alloc();

    ao_sys_pref_enable_instructions_and_data();
}

// ----------------------------------------------------------------------------

#endif

#endif

// ----------------------------------------------------------------------------

#if defined AO_SYS_XC32_PIC32_CAN

#if defined AO_CAN

// ----------------------------------------------------------------------------

static  void    ao_can_ir_1();

static  void    ao_can_ir_2();

static  void    ao_can_ir_3();

static  void    ao_can_ir_4();

// ----------------------------------------------------------------------------

#if defined AO_SYS_XC32_PIC32

// ----------------------------------------------------------------------------

#if defined AO_CAN

// ----------------------------------------------------------------------------

void ao_can_baud(ao_can_baud_t * x)
{
    // Assert.

    ao_assert(x);

    ao_assert(x->f_pbclk > 0);

    ao_assert(x->f >= ao_can_baud_min(x->f_pbclk));
    ao_assert(x->f <= ao_can_baud_max(x->f_pbclk));

    ao_assert(x->sample >=  50);
    ao_assert(x->sample <= 100);

    ao_assert(x->sjw >= 1);
    ao_assert(x->sjw <= 4);


    // Variables.

    uint32_t            brp;

    uint32_t            f                   = x->f;

    uint32_t            f_error;

    uint32_t            f_error_min         = UINT32_MAX;

    uint32_t            f_max;

    uint32_t            f_min;

    uint32_t            f_pbclk             = x->f_pbclk;

    uint32_t            f_real;

    uint32_t            n                   = 8;

    uint32_t            n1;

    uint32_t            n2;

    uint32_t            np;

    uint32_t            ns                  = 1;

    uint32_t            nx;

    ao_can_reg_cfg_t    r;

    uint32_t            sample              = x->sample * 1000;

    uint32_t            sample_error;

    uint32_t            sample_error_min;

    uint32_t            sample_real;

    bool                sample_thrice       = x->sample_thrice;

    bool                sample_thrice_real;

    uint32_t            sjw                 = x->sjw;

    bool                wake_up_filter      = x->wake_up_filter;


    // Ready.

    x->result = false;

    do
    {
        // Maximum and minimum baud rate.

        f_max = f_pbclk / (2 * n);

        f_min = (f_pbclk - 1) / (128 * n) + 1;

        if
        (
            f >= f_min &&
            f <= f_max
        )
        {
            // Baud rate prescaler bits.

            brp = f_pbclk / (2 * n * f);

            ao_assert(brp >=  1);
            ao_assert(brp <= 64);

            // Baud rate.

            f_real = f_pbclk / (2 * n * brp);

            ao_assert(f_real >= f_pbclk / (128 * n));
            ao_assert(f_real <= f_pbclk / (  2 * n));

            // Baud rate error.

            if (f_real >= f)    { f_error = f_real - f; }

            else                { f_error = f - f_real; }

            if (f_error <= f_error_min)
            {
                if (f_error < f_error_min)
                {
                    sample_error_min = UINT32_MAX;
                }

                n2 = sjw;

                nx = n - ns - n2;

                if (nx > 16)
                {
                    n2 = n2 + (nx - 16);
                    nx = 16;
                }

                ao_assert(n2 >= sjw);

                ao_assert(n2 >= 1);
                ao_assert(n2 <= 8);

                ao_assert(nx >= 1);
                ao_assert(nx <= 16);

                while (n2 <= nx && n2 <= 8 && sample_error_min != 0)
                {
                    // Sample.

                    sample_real = 100000 * (ns + nx) / n;

                    // Sample error.

                    if (sample_real >= sample)  { sample_error = sample_real - sample; }

                    else                        { sample_error = sample - sample_real; }

                    if (sample_error < sample_error_min)
                    {
                        np = nx / 2;

                        n1 = nx - np;

                        sample_thrice_real = brp <= 3 ? 0 : sample_thrice;

                        r.reg = 0;

                        r.bits.brp = brp - 1;

                        r.bits.prseg = np - 1;

                        r.bits.sam = sample_thrice_real ? 1 : 0;

                        r.bits.seg1ph = n1 - 1;

                        r.bits.seg2ph = n2 - 1;

                        r.bits.seg2phts = 1;

                        r.bits.sjw = sjw - 1;

                        r.bits.wakfil = wake_up_filter ? 1 : 0;

                        x->brp = brp;

                        x->cfg = r.reg;

                        x->f_error = f_error;

                        x->f_real = f_real;

                        x->n = n;

                        x->n1 = n1;

                        x->n2 = n2;

                        x->np = np;

