tinko26/ao/sys/ao_sys_xc32_pic32.c
                        x->result = true;

                        x->sample_error = sample_error * 0.001;

                        x->sample_real = sample_real * 0.001;

                        x->sample_thrice_real = sample_thrice_real;

                        sample_error_min = sample_error;
                    }

                    n2++;
                    nx--;
                }

                f_error_min = f_error;
            }
        }

        n++;
    }
    while (n <= 25 && (f_error_min != 0 || sample_error_min != 0));
}

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

#if defined AO_CAN_1 && AO_CAN_1

// ----------------------------------------------------------------------------

#if AO_CAN_BAUD_1 < AO_CAN_BAUD_MIN_1

#error Invalid configuration.

#endif

#if AO_CAN_BAUD_1 > AO_CAN_BAUD_MAX_1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_1 > 0  && AO_CAN_BUFFERS_1_0  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 1  && AO_CAN_BUFFERS_1_1  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 2  && AO_CAN_BUFFERS_1_2  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 3  && AO_CAN_BUFFERS_1_3  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 4  && AO_CAN_BUFFERS_1_4  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 5  && AO_CAN_BUFFERS_1_5  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 6  && AO_CAN_BUFFERS_1_6  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 7  && AO_CAN_BUFFERS_1_7  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 8  && AO_CAN_BUFFERS_1_8  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 9  && AO_CAN_BUFFERS_1_9  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 10 && AO_CAN_BUFFERS_1_10 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 11 && AO_CAN_BUFFERS_1_11 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 12 && AO_CAN_BUFFERS_1_12 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 13 && AO_CAN_BUFFERS_1_13 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 14 && AO_CAN_BUFFERS_1_14 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 15 && AO_CAN_BUFFERS_1_15 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 16 && AO_CAN_BUFFERS_1_16 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 17 && AO_CAN_BUFFERS_1_17 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 18 && AO_CAN_BUFFERS_1_18 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 19 && AO_CAN_BUFFERS_1_19 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 20 && AO_CAN_BUFFERS_1_20 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 21 && AO_CAN_BUFFERS_1_21 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 22 && AO_CAN_BUFFERS_1_22 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 23 && AO_CAN_BUFFERS_1_23 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 24 && AO_CAN_BUFFERS_1_24 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 25 && AO_CAN_BUFFERS_1_25 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 26 && AO_CAN_BUFFERS_1_26 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 27 && AO_CAN_BUFFERS_1_27 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 28 && AO_CAN_BUFFERS_1_28 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 29 && AO_CAN_BUFFERS_1_29 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 30 && AO_CAN_BUFFERS_1_30 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 31 && AO_CAN_BUFFERS_1_31 < 1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_1 > 0  && AO_CAN_BUFFERS_1_0  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 1  && AO_CAN_BUFFERS_1_1  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 2  && AO_CAN_BUFFERS_1_2  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 3  && AO_CAN_BUFFERS_1_3  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 4  && AO_CAN_BUFFERS_1_4  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 5  && AO_CAN_BUFFERS_1_5  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 6  && AO_CAN_BUFFERS_1_6  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 7  && AO_CAN_BUFFERS_1_7  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 8  && AO_CAN_BUFFERS_1_8  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 9  && AO_CAN_BUFFERS_1_9  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 10 && AO_CAN_BUFFERS_1_10 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 11 && AO_CAN_BUFFERS_1_11 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 12 && AO_CAN_BUFFERS_1_12 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 13 && AO_CAN_BUFFERS_1_13 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 14 && AO_CAN_BUFFERS_1_14 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 15 && AO_CAN_BUFFERS_1_15 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 16 && AO_CAN_BUFFERS_1_16 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 17 && AO_CAN_BUFFERS_1_17 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 18 && AO_CAN_BUFFERS_1_18 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 19 && AO_CAN_BUFFERS_1_19 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 20 && AO_CAN_BUFFERS_1_20 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 21 && AO_CAN_BUFFERS_1_21 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 22 && AO_CAN_BUFFERS_1_22 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 23 && AO_CAN_BUFFERS_1_23 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 24 && AO_CAN_BUFFERS_1_24 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 25 && AO_CAN_BUFFERS_1_25 > 32

#error Invalid configuration.

#endif

