tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_1 > 26 && AO_CAN_BUFFERS_1_26 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 27 && AO_CAN_BUFFERS_1_27 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 28 && AO_CAN_BUFFERS_1_28 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 29 && AO_CAN_BUFFERS_1_29 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 30 && AO_CAN_BUFFERS_1_30 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_1 > 31 && AO_CAN_BUFFERS_1_31 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_1 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_RX_1 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_TX_1 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_EID_1_0  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_1  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_2  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_3  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_4  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_5  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_6  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_7  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_8  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_9  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_10 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_11 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_12 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_13 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_14 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_15 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_16 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_17 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_18 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_19 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_20 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_21 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_22 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_23 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_24 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_25 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_26 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_27 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_28 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_29 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_30 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_1_31 > 0x3FFFF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_FIFO_1_0  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_1  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_2  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_3  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_4  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_5  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_6  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_7  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_8  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_9  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_10 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_11 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_12 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_13 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_14 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_15 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_16 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_17 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_18 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_19 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_20 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_21 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_22 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_23 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_24 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_25 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_26 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_27 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_28 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_29 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_30 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_1_31 > 31

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_IDE_1_0  > 0x1

#error Invalid configuration.

#endif

