tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_IDE_1_1  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_2  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_3  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_4  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_5  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_6  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_7  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_8  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_9  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_10 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_11 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_12 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_13 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_14 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_15 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_16 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_17 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_18 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_19 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_20 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_21 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_22 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_23 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_24 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_25 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_26 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_27 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_28 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_29 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_30 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_1_31 > 0x1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_1_0  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_1  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_2  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_3  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_4  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_5  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_6  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_7  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_8  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_9  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_10 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_11 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_12 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_13 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_14 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_15 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_16 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_17 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_18 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_19 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_20 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_21 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_22 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_23 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_24 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_25 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_26 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_27 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_28 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_29 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_30 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_1_31 > 3

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_EID_1_0 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_1_1 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_1_2 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_1_3 > 0x3FFFF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_IDE_1_0 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_1_1 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_1_2 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_1_3 > 0x1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_SID_1_0 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_1_1 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_1_2 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_1_3 > 0x7FF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_SID_1_0  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_1  > 0x7FF

#error Invalid configuration.

#endif

