tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_SID_1_2  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_3  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_4  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_5  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_6  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_7  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_8  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_9  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_10 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_11 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_12 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_13 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_14 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_15 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_16 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_17 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_18 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_19 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_20 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_21 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_22 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_23 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_24 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_25 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_26 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_27 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_28 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_29 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_30 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_1_31 > 0x7FF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#define AO_CAN_RXOF_1           ((AO_CAN_RX_1)      && (AO_CAN_OVERFLOW_1))

#define AO_CAN_TXST_1           ((AO_CAN_TX_1)      && (AO_CAN_SENT_1))

#define AO_CAN_TXUF_1           ((AO_CAN_TX_1)      && (AO_CAN_UNDERFLOW_1))

// ----------------------------------------------------------------------------

#define AO_CAN_RBOV_1           ((AO_CAN_RXOF_1)    || (AO_CAN_TXUF_1))

// ----------------------------------------------------------------------------

static  void                    ao_can_change_1(    uint32_t mode);

static  void                    ao_can_started_1();

static  void                    ao_can_starting_1();

static  void                    ao_can_stopping_1();

static  void                    ao_can_task_proc_1( void * x);

// ----------------------------------------------------------------------------

        ao_can_t                ao_can_buffers_1    [AO_CAN_BUFFERS_1];

// ----------------------------------------------------------------------------

#if AO_CAN_BUS_1

static  ao_can_bus_info_t       ao_can_bus_info_1;

#endif

#if AO_CAN_INVALID_1

static  ao_can_invalid_info_t   ao_can_invalid_info_1;

#endif

#if AO_CAN_MODE_1

static  ao_can_mode_info_t      ao_can_mode_info_1;

#endif

#if AO_CAN_RXOF_1

static  ao_can_overflow_info_t  ao_can_overflow_info_1;

#endif

#if AO_CAN_SYSTEM_1

static  ao_can_system_info_t    ao_can_system_info_1;

#endif

#if AO_CAN_TIMER_1

static  ao_can_timer_info_t     ao_can_timer_info_1;

#endif

#if AO_CAN_TXST_1

static  ao_can_sent_info_t      ao_can_sent_info_1;

#endif

#if AO_CAN_TXUF_1

static  ao_can_underflow_info_t ao_can_underflow_info_1;

#endif

#if AO_CAN_WAKE_UP_1

static  ao_can_wake_up_info_t   ao_can_wake_up_info_1;

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_RX_1

// ----------------------------------------------------------------------------

static  ao_can_t                ao_can_in_can_1     [AO_CAN_FIFOS_RX_1];

        ao_send_obj_t           ao_can_in_1         [AO_CAN_FIFOS_RX_1] =
{

#if AO_CAN_FIFOS_RX_1 >  0

#if AO_CAN_FIFOS_RX_1 >  0

{
        .ptr                    = ao_can_in_can_1 +  0
},

#endif

#if AO_CAN_FIFOS_RX_1 >  1

{
        .ptr                    = ao_can_in_can_1 +  1
},

#endif

#if AO_CAN_FIFOS_RX_1 >  2

{
        .ptr                    = ao_can_in_can_1 +  2
},

#endif

#if AO_CAN_FIFOS_RX_1 >  3

{
        .ptr                    = ao_can_in_can_1 +  3
},

#endif

#if AO_CAN_FIFOS_RX_1 >  4

{
        .ptr                    = ao_can_in_can_1 +  4
},

#endif

#if AO_CAN_FIFOS_RX_1 >  5

{
        .ptr                    = ao_can_in_can_1 +  5
},

#endif

#if AO_CAN_FIFOS_RX_1 >  6

{
        .ptr                    = ao_can_in_can_1 +  6
},

#endif

#if AO_CAN_FIFOS_RX_1 >  7

{
        .ptr                    = ao_can_in_can_1 +  7
},

#endif

#if AO_CAN_FIFOS_RX_1 >  8

{
        .ptr                    = ao_can_in_can_1 +  8
},

#endif

#if AO_CAN_FIFOS_RX_1 >  9

{
        .ptr                    = ao_can_in_can_1 +  9
},

#endif

#if AO_CAN_FIFOS_RX_1 > 10

{
        .ptr                    = ao_can_in_can_1 + 10
},

#endif

#if AO_CAN_FIFOS_RX_1 > 11

{
        .ptr                    = ao_can_in_can_1 + 11
},

#endif

#if AO_CAN_FIFOS_RX_1 > 12

{
        .ptr                    = ao_can_in_can_1 + 12
},

#endif

#if AO_CAN_FIFOS_RX_1 > 13

{
        .ptr                    = ao_can_in_can_1 + 13
},

#endif

#if AO_CAN_FIFOS_RX_1 > 14

{
        .ptr                    = ao_can_in_can_1 + 14
},

#endif

#if AO_CAN_FIFOS_RX_1 > 15

{
        .ptr                    = ao_can_in_can_1 + 15
},

#endif

#if AO_CAN_FIFOS_RX_1 > 16

{
        .ptr                    = ao_can_in_can_1 + 16
},

#endif

#if AO_CAN_FIFOS_RX_1 > 17

{
        .ptr                    = ao_can_in_can_1 + 17
},

#endif

