tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_RX_1 > 18

{
        .ptr                    = ao_can_in_can_1 + 18
},

#endif

#if AO_CAN_FIFOS_RX_1 > 19

{
        .ptr                    = ao_can_in_can_1 + 19
},

#endif

#if AO_CAN_FIFOS_RX_1 > 20

{
        .ptr                    = ao_can_in_can_1 + 20
},

#endif

#if AO_CAN_FIFOS_RX_1 > 21

{
        .ptr                    = ao_can_in_can_1 + 21
},

#endif

#if AO_CAN_FIFOS_RX_1 > 22

{
        .ptr                    = ao_can_in_can_1 + 22
},

#endif

#if AO_CAN_FIFOS_RX_1 > 23

{
        .ptr                    = ao_can_in_can_1 + 23
},

#endif

#if AO_CAN_FIFOS_RX_1 > 24

{
        .ptr                    = ao_can_in_can_1 + 24
},

#endif

#if AO_CAN_FIFOS_RX_1 > 25

{
        .ptr                    = ao_can_in_can_1 + 25
},

#endif

#if AO_CAN_FIFOS_RX_1 > 26

{
        .ptr                    = ao_can_in_can_1 + 26
},

#endif

#if AO_CAN_FIFOS_RX_1 > 27

{
        .ptr                    = ao_can_in_can_1 + 27
},

#endif

#if AO_CAN_FIFOS_RX_1 > 28

{
        .ptr                    = ao_can_in_can_1 + 28
},

#endif

#if AO_CAN_FIFOS_RX_1 > 29

{
        .ptr                    = ao_can_in_can_1 + 29
},

#endif

#if AO_CAN_FIFOS_RX_1 > 30

{
        .ptr                    = ao_can_in_can_1 + 30
},

#endif

#if AO_CAN_FIFOS_RX_1 > 31

{
        .ptr                    = ao_can_in_can_1 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

#endif

#if AO_CAN_TX_1

// ----------------------------------------------------------------------------

static  ao_can_t                ao_can_out_can_1    [AO_CAN_FIFOS_TX_1];

        ao_recv_obj_t           ao_can_out_1        [AO_CAN_FIFOS_TX_1] =
{

#if AO_CAN_FIFOS_TX_1 >  0

#if AO_CAN_FIFOS_TX_1 >  0

{
        .ptr                    = ao_can_out_can_1 +  0
},

#endif

#if AO_CAN_FIFOS_TX_1 >  1

{
        .ptr                    = ao_can_out_can_1 +  1
},

#endif

#if AO_CAN_FIFOS_TX_1 >  2

{
        .ptr                    = ao_can_out_can_1 +  2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  3

{
        .ptr                    = ao_can_out_can_1 +  3
},

#endif

#if AO_CAN_FIFOS_TX_1 >  4

{
        .ptr                    = ao_can_out_can_1 +  4
},

#endif

#if AO_CAN_FIFOS_TX_1 >  5

{
        .ptr                    = ao_can_out_can_1 +  5
},

#endif

#if AO_CAN_FIFOS_TX_1 >  6

{
        .ptr                    = ao_can_out_can_1 +  6
},

#endif

#if AO_CAN_FIFOS_TX_1 >  7

{
        .ptr                    = ao_can_out_can_1 +  7
},

#endif

#if AO_CAN_FIFOS_TX_1 >  8

{
        .ptr                    = ao_can_out_can_1 +  8
},

#endif

#if AO_CAN_FIFOS_TX_1 >  9

{
        .ptr                    = ao_can_out_can_1 +  9
},

#endif

#if AO_CAN_FIFOS_TX_1 > 10

{
        .ptr                    = ao_can_out_can_1 + 10
},

#endif

#if AO_CAN_FIFOS_TX_1 > 11

{
        .ptr                    = ao_can_out_can_1 + 11
},

#endif

#if AO_CAN_FIFOS_TX_1 > 12

{
        .ptr                    = ao_can_out_can_1 + 12
},

#endif

#if AO_CAN_FIFOS_TX_1 > 13

{
        .ptr                    = ao_can_out_can_1 + 13
},

#endif

#if AO_CAN_FIFOS_TX_1 > 14

{
        .ptr                    = ao_can_out_can_1 + 14
},

#endif

#if AO_CAN_FIFOS_TX_1 > 15

{
        .ptr                    = ao_can_out_can_1 + 15
},

#endif

#if AO_CAN_FIFOS_TX_1 > 16

{
        .ptr                    = ao_can_out_can_1 + 16
},

#endif

#if AO_CAN_FIFOS_TX_1 > 17

{
        .ptr                    = ao_can_out_can_1 + 17
},

#endif

#if AO_CAN_FIFOS_TX_1 > 18

{
        .ptr                    = ao_can_out_can_1 + 18
},

#endif

#if AO_CAN_FIFOS_TX_1 > 19

{
        .ptr                    = ao_can_out_can_1 + 19
},

#endif

#if AO_CAN_FIFOS_TX_1 > 20

{
        .ptr                    = ao_can_out_can_1 + 20
},

#endif

#if AO_CAN_FIFOS_TX_1 > 21

{
        .ptr                    = ao_can_out_can_1 + 21
},

#endif

#if AO_CAN_FIFOS_TX_1 > 22

{
        .ptr                    = ao_can_out_can_1 + 22
},

#endif

#if AO_CAN_FIFOS_TX_1 > 23

{
        .ptr                    = ao_can_out_can_1 + 23
},

#endif

#if AO_CAN_FIFOS_TX_1 > 24

{
        .ptr                    = ao_can_out_can_1 + 24
},

#endif

#if AO_CAN_FIFOS_TX_1 > 25

{
        .ptr                    = ao_can_out_can_1 + 25
},

#endif

#if AO_CAN_FIFOS_TX_1 > 26

{
        .ptr                    = ao_can_out_can_1 + 26
},

#endif

#if AO_CAN_FIFOS_TX_1 > 27

{
        .ptr                    = ao_can_out_can_1 + 27
},

#endif

#if AO_CAN_FIFOS_TX_1 > 28

{
        .ptr                    = ao_can_out_can_1 + 28
},

#endif

#if AO_CAN_FIFOS_TX_1 > 29

{
        .ptr                    = ao_can_out_can_1 + 29
},

#endif

#if AO_CAN_FIFOS_TX_1 > 30

{
        .ptr                    = ao_can_out_can_1 + 30
},

#endif

#if AO_CAN_FIFOS_TX_1 > 31

{
        .ptr                    = ao_can_out_can_1 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_change_1;

static  ao_cond_wait_t          ao_can_cond_change_wait_1 =
{
        .cond                   = &ao_can_cond_change_1
};

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_changed_1;

static  ao_cond_wait_t          ao_can_cond_changed_wait_1 =
{
        .cond                   = &ao_can_cond_changed_1
};

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_not_full_1      [AO_CAN_FIFOS_TX_1];

static  ao_cond_wait_t          ao_can_cond_not_full_wait_1 [AO_CAN_FIFOS_TX_1] =
{

#if AO_CAN_FIFOS_TX_1 >  0

#if AO_CAN_FIFOS_TX_1 >  0

{
        .cond                   = ao_can_cond_not_full_1 +  0
},

#endif

#if AO_CAN_FIFOS_TX_1 >  1

{
        .cond                   = ao_can_cond_not_full_1 +  1
},

#endif

#if AO_CAN_FIFOS_TX_1 >  2

{
        .cond                   = ao_can_cond_not_full_1 +  2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  3

{
        .cond                   = ao_can_cond_not_full_1 +  3
},

#endif

#if AO_CAN_FIFOS_TX_1 >  4

{
        .cond                   = ao_can_cond_not_full_1 +  4
},

#endif

#if AO_CAN_FIFOS_TX_1 >  5

{
        .cond                   = ao_can_cond_not_full_1 +  5
},

#endif

#if AO_CAN_FIFOS_TX_1 >  6

{
        .cond                   = ao_can_cond_not_full_1 +  6
},

#endif

#if AO_CAN_FIFOS_TX_1 >  7

{
        .cond                   = ao_can_cond_not_full_1 +  7
},

#endif

#if AO_CAN_FIFOS_TX_1 >  8

{
        .cond                   = ao_can_cond_not_full_1 +  8
},

#endif

