tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_TX_1 >  9

{
        .cond                   = ao_can_cond_not_full_1 +  9
},

#endif

#if AO_CAN_FIFOS_TX_1 > 10

{
        .cond                   = ao_can_cond_not_full_1 + 10
},

#endif

#if AO_CAN_FIFOS_TX_1 > 11

{
        .cond                   = ao_can_cond_not_full_1 + 11
},

#endif

#if AO_CAN_FIFOS_TX_1 > 12

{
        .cond                   = ao_can_cond_not_full_1 + 12
},

#endif

#if AO_CAN_FIFOS_TX_1 > 13

{
        .cond                   = ao_can_cond_not_full_1 + 13
},

#endif

#if AO_CAN_FIFOS_TX_1 > 14

{
        .cond                   = ao_can_cond_not_full_1 + 14
},

#endif

#if AO_CAN_FIFOS_TX_1 > 15

{
        .cond                   = ao_can_cond_not_full_1 + 15
},

#endif

#if AO_CAN_FIFOS_TX_1 > 16

{
        .cond                   = ao_can_cond_not_full_1 + 16
},

#endif

#if AO_CAN_FIFOS_TX_1 > 17

{
        .cond                   = ao_can_cond_not_full_1 + 17
},

#endif

#if AO_CAN_FIFOS_TX_1 > 18

{
        .cond                   = ao_can_cond_not_full_1 + 18
},

#endif

#if AO_CAN_FIFOS_TX_1 > 19

{
        .cond                   = ao_can_cond_not_full_1 + 19
},

#endif

#if AO_CAN_FIFOS_TX_1 > 20

{
        .cond                   = ao_can_cond_not_full_1 + 20
},

#endif

#if AO_CAN_FIFOS_TX_1 > 21

{
        .cond                   = ao_can_cond_not_full_1 + 21
},

#endif

#if AO_CAN_FIFOS_TX_1 > 22

{
        .cond                   = ao_can_cond_not_full_1 + 22
},

#endif

#if AO_CAN_FIFOS_TX_1 > 23

{
        .cond                   = ao_can_cond_not_full_1 + 23
},

#endif

#if AO_CAN_FIFOS_TX_1 > 24

{
        .cond                   = ao_can_cond_not_full_1 + 24
},

#endif

#if AO_CAN_FIFOS_TX_1 > 25

{
        .cond                   = ao_can_cond_not_full_1 + 25
},

#endif

#if AO_CAN_FIFOS_TX_1 > 26

{
        .cond                   = ao_can_cond_not_full_1 + 26
},

#endif

#if AO_CAN_FIFOS_TX_1 > 27

{
        .cond                   = ao_can_cond_not_full_1 + 27
},

#endif

#if AO_CAN_FIFOS_TX_1 > 28

{
        .cond                   = ao_can_cond_not_full_1 + 28
},

#endif

#if AO_CAN_FIFOS_TX_1 > 29

{
        .cond                   = ao_can_cond_not_full_1 + 29
},

#endif

#if AO_CAN_FIFOS_TX_1 > 30

{
        .cond                   = ao_can_cond_not_full_1 + 30
},

#endif

#if AO_CAN_FIFOS_TX_1 > 31

{
        .cond                   = ao_can_cond_not_full_1 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

static  ao_sem_t                ao_can_sem_1;

static  ao_sem_take_t           ao_can_sem_take_1 =
{
        .count                  = 1,

        .sem                    = &ao_can_sem_1
};

// ----------------------------------------------------------------------------

        ao_task_t               ao_can_task_1 =
{
        .proc                   = ao_can_task_proc_1
};

// ----------------------------------------------------------------------------

static  uint32_t    volatile    ao_can_var_mode_1 = 0;

static  bool        volatile    ao_can_var_started_1 = false;

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_change_store_1 [2] =
{
        &ao_can_cond_changed_wait_1.async,

        &ao_can_sem_take_1.async
};

static  ao_async_any_t          ao_can_async_change_1 =
{
        .store                  = ao_can_async_change_store_1,

        .count                  = 2
};

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_send_store_1   [AO_CAN_FIFOS_TX_1 * 2] =
{

#if AO_CAN_FIFOS_TX_1 >  0

#if AO_CAN_FIFOS_TX_1 >  0

        &ao_can_cond_not_full_wait_1[ 0].async,

        &ao_can_out_1               [ 0].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  1

        &ao_can_cond_not_full_wait_1[ 1].async,

        &ao_can_out_1               [ 1].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  2

        &ao_can_cond_not_full_wait_1[ 2].async,

        &ao_can_out_1               [ 2].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  3

        &ao_can_cond_not_full_wait_1[ 3].async,

        &ao_can_out_1               [ 3].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  4

        &ao_can_cond_not_full_wait_1[ 4].async,

        &ao_can_out_1               [ 4].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  5

        &ao_can_cond_not_full_wait_1[ 5].async,

        &ao_can_out_1               [ 5].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  6

        &ao_can_cond_not_full_wait_1[ 6].async,

        &ao_can_out_1               [ 6].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  7

        &ao_can_cond_not_full_wait_1[ 7].async,

        &ao_can_out_1               [ 7].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  8

        &ao_can_cond_not_full_wait_1[ 8].async,

        &ao_can_out_1               [ 8].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  9

        &ao_can_cond_not_full_wait_1[ 9].async,

        &ao_can_out_1               [ 9].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 10

        &ao_can_cond_not_full_wait_1[10].async,

        &ao_can_out_1               [10].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 11

        &ao_can_cond_not_full_wait_1[11].async,

        &ao_can_out_1               [11].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 12

        &ao_can_cond_not_full_wait_1[12].async,

        &ao_can_out_1               [12].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 13

        &ao_can_cond_not_full_wait_1[13].async,

        &ao_can_out_1               [13].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 14

        &ao_can_cond_not_full_wait_1[14].async,

        &ao_can_out_1               [14].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 15

        &ao_can_cond_not_full_wait_1[15].async,

        &ao_can_out_1               [15].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 16

        &ao_can_cond_not_full_wait_1[16].async,

        &ao_can_out_1               [16].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 17

        &ao_can_cond_not_full_wait_1[17].async,

        &ao_can_out_1               [17].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 18

