tinko26/ao/sys/ao_sys_xc32_pic32.c
        &ao_can_cond_not_full_wait_1[18].async,

        &ao_can_out_1               [18].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 19

        &ao_can_cond_not_full_wait_1[19].async,

        &ao_can_out_1               [19].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 20

        &ao_can_cond_not_full_wait_1[20].async,

        &ao_can_out_1               [20].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 21

        &ao_can_cond_not_full_wait_1[21].async,

        &ao_can_out_1               [21].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 22

        &ao_can_cond_not_full_wait_1[22].async,

        &ao_can_out_1               [22].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 23

        &ao_can_cond_not_full_wait_1[23].async,

        &ao_can_out_1               [23].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 24

        &ao_can_cond_not_full_wait_1[24].async,

        &ao_can_out_1               [24].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 25

        &ao_can_cond_not_full_wait_1[25].async,

        &ao_can_out_1               [25].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 26

        &ao_can_cond_not_full_wait_1[26].async,

        &ao_can_out_1               [26].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 27

        &ao_can_cond_not_full_wait_1[27].async,

        &ao_can_out_1               [27].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 28

        &ao_can_cond_not_full_wait_1[28].async,

        &ao_can_out_1               [28].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 29

        &ao_can_cond_not_full_wait_1[29].async,

        &ao_can_out_1               [29].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 30

        &ao_can_cond_not_full_wait_1[30].async,

        &ao_can_out_1               [30].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 31

        &ao_can_cond_not_full_wait_1[31].async,

        &ao_can_out_1               [31].async,

#endif

#endif

};

static  ao_async_all_t          ao_can_async_send_1         [AO_CAN_FIFOS_TX_1] =
{

#if AO_CAN_FIFOS_TX_1 >  0

#if AO_CAN_FIFOS_TX_1 >  0

{
        .store                  = ao_can_async_send_store_1 +  0 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  1

{
        .store                  = ao_can_async_send_store_1 +  1 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  2

{
        .store                  = ao_can_async_send_store_1 +  2 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  3

{
        .store                  = ao_can_async_send_store_1 +  3 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  4

{
        .store                  = ao_can_async_send_store_1 +  4 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  5

{
        .store                  = ao_can_async_send_store_1 +  5 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  6

{
        .store                  = ao_can_async_send_store_1 +  6 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  7

{
        .store                  = ao_can_async_send_store_1 +  7 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  8

{
        .store                  = ao_can_async_send_store_1 +  8 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 >  9

{
        .store                  = ao_can_async_send_store_1 +  9 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 10

{
        .store                  = ao_can_async_send_store_1 + 10 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 11

{
        .store                  = ao_can_async_send_store_1 + 11 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 12

{
        .store                  = ao_can_async_send_store_1 + 12 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 13

{
        .store                  = ao_can_async_send_store_1 + 13 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 14

{
        .store                  = ao_can_async_send_store_1 + 14 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 15

{
        .store                  = ao_can_async_send_store_1 + 15 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 16

{
        .store                  = ao_can_async_send_store_1 + 16 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 17

{
        .store                  = ao_can_async_send_store_1 + 17 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 18

{
        .store                  = ao_can_async_send_store_1 + 18 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 19

{
        .store                  = ao_can_async_send_store_1 + 19 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 20

{
        .store                  = ao_can_async_send_store_1 + 20 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 21

{
        .store                  = ao_can_async_send_store_1 + 21 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 22

{
        .store                  = ao_can_async_send_store_1 + 22 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 23

{
        .store                  = ao_can_async_send_store_1 + 23 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 24

{
        .store                  = ao_can_async_send_store_1 + 24 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 25

{
        .store                  = ao_can_async_send_store_1 + 25 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 26

{
        .store                  = ao_can_async_send_store_1 + 26 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 27

{
        .store                  = ao_can_async_send_store_1 + 27 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 28

{
        .store                  = ao_can_async_send_store_1 + 28 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 29

{
        .store                  = ao_can_async_send_store_1 + 29 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_1 > 30

{
        .store                  = ao_can_async_send_store_1 + 30 * 2,

        .count                  = 2
},

#endif

