tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_TX_1 > 31

{
        .store                  = ao_can_async_send_store_1 + 31 * 2,

        .count                  = 2
},

#endif

#endif

};

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_started_store_1[AO_CAN_FIFOS_TX_1 + 2] =
{
        &ao_can_cond_change_wait_1.async,

        &ao_can_sem_take_1.async,

#if AO_CAN_FIFOS_TX_1 >  0

#if AO_CAN_FIFOS_TX_1 >  0

        &ao_can_async_send_1[ 0].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  1

        &ao_can_async_send_1[ 1].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  2

        &ao_can_async_send_1[ 2].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  3

        &ao_can_async_send_1[ 3].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  4

        &ao_can_async_send_1[ 4].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  5

        &ao_can_async_send_1[ 5].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  6

        &ao_can_async_send_1[ 6].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  7

        &ao_can_async_send_1[ 7].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  8

        &ao_can_async_send_1[ 8].async,

#endif

#if AO_CAN_FIFOS_TX_1 >  9

        &ao_can_async_send_1[ 9].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 10

        &ao_can_async_send_1[10].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 11

        &ao_can_async_send_1[11].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 12

        &ao_can_async_send_1[12].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 13

        &ao_can_async_send_1[13].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 14

        &ao_can_async_send_1[14].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 15

        &ao_can_async_send_1[15].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 16

        &ao_can_async_send_1[16].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 17

        &ao_can_async_send_1[17].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 18

        &ao_can_async_send_1[18].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 19

        &ao_can_async_send_1[19].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 20

        &ao_can_async_send_1[20].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 21

        &ao_can_async_send_1[21].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 22

        &ao_can_async_send_1[22].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 23

        &ao_can_async_send_1[23].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 24

        &ao_can_async_send_1[24].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 25

        &ao_can_async_send_1[25].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 26

        &ao_can_async_send_1[26].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 27

        &ao_can_async_send_1[27].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 28

        &ao_can_async_send_1[28].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 29

        &ao_can_async_send_1[29].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 30

        &ao_can_async_send_1[30].async,

#endif

#if AO_CAN_FIFOS_TX_1 > 31

        &ao_can_async_send_1[31].async,

#endif

#endif

};

static  ao_async_any_t          ao_can_async_started_1 =
{
        .store                  = ao_can_async_started_store_1,

        .count                  = 2 + AO_CAN_FIFOS_TX_1
};

// ----------------------------------------------------------------------------

void ao_can_change_1(uint32_t mode)
{
    // Assert.

    ao_assert
    (
        mode == 0 ||
        mode == 2 ||
        mode == 3 ||
        mode == 4 ||
        mode == 7
    );


    // Variables.

    ao_can_reg_t * const reg = ao_can_reg_1();


    // Ready.

    while (reg->con.bits.opmod != mode)
    {
        // Request.

        ao_cond_clear(&ao_can_cond_changed_1);

        reg->con.bits.reqop = mode;


        // Await.

        ao_cond_wait_begin( &ao_can_cond_changed_wait_1);

        ao_sem_take_begin(  &ao_can_sem_take_1);

        ao_await_any_forever
        (
            &ao_can_async_change_1
        );

        ao_sem_take_end(    &ao_can_sem_take_1);

        ao_cond_wait_end(   &ao_can_cond_changed_wait_1);


        // Stop.

        if (ao_can_sem_take_1.result)
        {
            ao_can_var_started_1 = false;
        }
    }
}

// ----------------------------------------------------------------------------

__attribute__ ((weak))
void ao_can_config_1()
{
    ao_can_config_baud_1();

    ao_can_config_fifos_1();

    ao_can_config_filter_masks_1();

    ao_can_config_filters_1();
}

__attribute__ ((weak))
void ao_can_config_baud_1()
{
    // Variables.

    ao_can_baud_t x;


    // Ready.

    x.f                 = AO_CAN_BAUD_1;

    x.f_pbclk           = AO_SYS_CLOCK_CAN1;

    x.sample            = AO_CAN_BAUD_SAMPLE_1;

    x.sample_thrice     = AO_CAN_BAUD_SAMPLE_THRICE_1;

    x.sjw               = AO_CAN_BAUD_SJW_1;

    x.wake_up_filter    = AO_CAN_BAUD_WAKE_UP_FILTER_1;

    ao_can_baud(&x);

    ao_assert(x.result);

    C1CFG = x.cfg;
}

__attribute__ ((weak))
void ao_can_config_fifos_1()
{
    // Fifo base address.

    C1FIFOBA = KVA_TO_PA(ao_can_buffers_1);


    // Fifos.

#if AO_CAN_FIFOS_1 > 0

#if AO_CAN_FIFOS_1 > 0

    C1FIFOCON0bits.FSIZE = AO_CAN_BUFFERS_1_0 - 1;

#endif

#if AO_CAN_FIFOS_1 > 1

    C1FIFOCON1bits.FSIZE = AO_CAN_BUFFERS_1_1 - 1;

#endif

#if AO_CAN_FIFOS_1 > 2

    C1FIFOCON2bits.FSIZE = AO_CAN_BUFFERS_1_2 - 1;

#endif

#if AO_CAN_FIFOS_1 > 3

    C1FIFOCON3bits.FSIZE = AO_CAN_BUFFERS_1_3 - 1;

#endif

#if AO_CAN_FIFOS_1 > 4

    C1FIFOCON4bits.FSIZE = AO_CAN_BUFFERS_1_4 - 1;

#endif

#if AO_CAN_FIFOS_1 > 5

    C1FIFOCON5bits.FSIZE = AO_CAN_BUFFERS_1_5 - 1;

#endif

#if AO_CAN_FIFOS_1 > 6

    C1FIFOCON6bits.FSIZE = AO_CAN_BUFFERS_1_6 - 1;

#endif

#if AO_CAN_FIFOS_1 > 7

    C1FIFOCON7bits.FSIZE = AO_CAN_BUFFERS_1_7 - 1;

#endif

#if AO_CAN_FIFOS_1 > 8

    C1FIFOCON8bits.FSIZE = AO_CAN_BUFFERS_1_8 - 1;

#endif

#if AO_CAN_FIFOS_1 > 9

    C1FIFOCON9bits.FSIZE = AO_CAN_BUFFERS_1_9 - 1;

#endif

#if AO_CAN_FIFOS_1 > 10

    C1FIFOCON10bits.FSIZE = AO_CAN_BUFFERS_1_10 - 1;

#endif

#if AO_CAN_FIFOS_1 > 11

    C1FIFOCON11bits.FSIZE = AO_CAN_BUFFERS_1_11 - 1;

#endif

#if AO_CAN_FIFOS_1 > 12

    C1FIFOCON12bits.FSIZE = AO_CAN_BUFFERS_1_12 - 1;

#endif

#if AO_CAN_FIFOS_1 > 13

    C1FIFOCON13bits.FSIZE = AO_CAN_BUFFERS_1_13 - 1;

#endif

