tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_1 > 14

    C1FIFOCON14bits.FSIZE = AO_CAN_BUFFERS_1_14 - 1;

#endif

#if AO_CAN_FIFOS_1 > 15

    C1FIFOCON15bits.FSIZE = AO_CAN_BUFFERS_1_15 - 1;

#endif

#if AO_CAN_FIFOS_1 > 16

    C1FIFOCON16bits.FSIZE = AO_CAN_BUFFERS_1_16 - 1;

#endif

#if AO_CAN_FIFOS_1 > 17

    C1FIFOCON17bits.FSIZE = AO_CAN_BUFFERS_1_17 - 1;

#endif

#if AO_CAN_FIFOS_1 > 18

    C1FIFOCON18bits.FSIZE = AO_CAN_BUFFERS_1_18 - 1;

#endif

#if AO_CAN_FIFOS_1 > 19

    C1FIFOCON19bits.FSIZE = AO_CAN_BUFFERS_1_19 - 1;

#endif

#if AO_CAN_FIFOS_1 > 20

    C1FIFOCON20bits.FSIZE = AO_CAN_BUFFERS_1_20 - 1;

#endif

#if AO_CAN_FIFOS_1 > 21

    C1FIFOCON21bits.FSIZE = AO_CAN_BUFFERS_1_21 - 1;

#endif

#if AO_CAN_FIFOS_1 > 22

    C1FIFOCON22bits.FSIZE = AO_CAN_BUFFERS_1_22 - 1;

#endif

#if AO_CAN_FIFOS_1 > 23

    C1FIFOCON23bits.FSIZE = AO_CAN_BUFFERS_1_23 - 1;

#endif

#if AO_CAN_FIFOS_1 > 24

    C1FIFOCON24bits.FSIZE = AO_CAN_BUFFERS_1_24 - 1;

#endif

#if AO_CAN_FIFOS_1 > 25

    C1FIFOCON25bits.FSIZE = AO_CAN_BUFFERS_1_25 - 1;

#endif

#if AO_CAN_FIFOS_1 > 26

    C1FIFOCON26bits.FSIZE = AO_CAN_BUFFERS_1_26 - 1;

#endif

#if AO_CAN_FIFOS_1 > 27

    C1FIFOCON27bits.FSIZE = AO_CAN_BUFFERS_1_27 - 1;

#endif

#if AO_CAN_FIFOS_1 > 28

    C1FIFOCON28bits.FSIZE = AO_CAN_BUFFERS_1_28 - 1;

#endif

#if AO_CAN_FIFOS_1 > 29

    C1FIFOCON29bits.FSIZE = AO_CAN_BUFFERS_1_29 - 1;

#endif

#if AO_CAN_FIFOS_1 > 30

    C1FIFOCON30bits.FSIZE = AO_CAN_BUFFERS_1_30 - 1;

#endif

#if AO_CAN_FIFOS_1 > 31

    C1FIFOCON31bits.FSIZE = AO_CAN_BUFFERS_1_31 - 1;

#endif

#endif

}

__attribute__ ((weak))
void ao_can_config_filter_masks_1()
{
    C1RXM0bits.EID  = AO_CAN_FILTER_MASK_EID_1_0;
    C1RXM0bits.MIDE = AO_CAN_FILTER_MASK_IDE_1_0;
    C1RXM0bits.SID  = AO_CAN_FILTER_MASK_SID_1_0;

    C1RXM1bits.EID  = AO_CAN_FILTER_MASK_EID_1_1;
    C1RXM1bits.MIDE = AO_CAN_FILTER_MASK_IDE_1_1;
    C1RXM1bits.SID  = AO_CAN_FILTER_MASK_SID_1_1;

    C1RXM2bits.EID  = AO_CAN_FILTER_MASK_EID_1_2;
    C1RXM2bits.MIDE = AO_CAN_FILTER_MASK_IDE_1_2;
    C1RXM2bits.SID  = AO_CAN_FILTER_MASK_SID_1_2;

    C1RXM3bits.EID  = AO_CAN_FILTER_MASK_EID_1_3;
    C1RXM3bits.MIDE = AO_CAN_FILTER_MASK_IDE_1_3;
    C1RXM3bits.SID  = AO_CAN_FILTER_MASK_SID_1_3;
}

__attribute__ ((weak))
void ao_can_config_filters_1()
{

#if AO_CAN_FILTER_ENABLE_1_0

    C1RXF0bits.EID          = AO_CAN_FILTER_EID_1_0;
    C1RXF0bits.EXID         = AO_CAN_FILTER_IDE_1_0;
    C1RXF0bits.SID          = AO_CAN_FILTER_SID_1_0;
    C1FLTCON0bits.FSEL0     = AO_CAN_FILTER_FIFO_1_0;
    C1FLTCON0bits.MSEL0     = AO_CAN_FILTER_MASK_1_0;
    C1FLTCON0bits.FLTEN0    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_1

    C1RXF1bits.EID          = AO_CAN_FILTER_EID_1_1;
    C1RXF1bits.EXID         = AO_CAN_FILTER_IDE_1_1;
    C1RXF1bits.SID          = AO_CAN_FILTER_SID_1_1;
    C1FLTCON0bits.FSEL1     = AO_CAN_FILTER_FIFO_1_1;
    C1FLTCON0bits.MSEL1     = AO_CAN_FILTER_MASK_1_1;
    C1FLTCON0bits.FLTEN1    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_2

    C1RXF2bits.EID          = AO_CAN_FILTER_EID_1_2;
    C1RXF2bits.EXID         = AO_CAN_FILTER_IDE_1_2;
    C1RXF2bits.SID          = AO_CAN_FILTER_SID_1_2;
    C1FLTCON0bits.FSEL2     = AO_CAN_FILTER_FIFO_1_2;
    C1FLTCON0bits.MSEL2     = AO_CAN_FILTER_MASK_1_2;
    C1FLTCON0bits.FLTEN2    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_3

    C1RXF3bits.EID          = AO_CAN_FILTER_EID_1_3;
    C1RXF3bits.EXID         = AO_CAN_FILTER_IDE_1_3;
    C1RXF3bits.SID          = AO_CAN_FILTER_SID_1_3;
    C1FLTCON0bits.FSEL3     = AO_CAN_FILTER_FIFO_1_3;
    C1FLTCON0bits.MSEL3     = AO_CAN_FILTER_MASK_1_3;
    C1FLTCON0bits.FLTEN3    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_4

    C1RXF4bits.EID          = AO_CAN_FILTER_EID_1_4;
    C1RXF4bits.EXID         = AO_CAN_FILTER_IDE_1_4;
    C1RXF4bits.SID          = AO_CAN_FILTER_SID_1_4;
    C1FLTCON1bits.FSEL4     = AO_CAN_FILTER_FIFO_1_4;
    C1FLTCON1bits.MSEL4     = AO_CAN_FILTER_MASK_1_4;
    C1FLTCON1bits.FLTEN4    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_5

    C1RXF5bits.EID          = AO_CAN_FILTER_EID_1_5;
    C1RXF5bits.EXID         = AO_CAN_FILTER_IDE_1_5;
    C1RXF5bits.SID          = AO_CAN_FILTER_SID_1_5;
    C1FLTCON1bits.FSEL5     = AO_CAN_FILTER_FIFO_1_5;
    C1FLTCON1bits.MSEL5     = AO_CAN_FILTER_MASK_1_5;
    C1FLTCON1bits.FLTEN5    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_6

    C1RXF6bits.EID          = AO_CAN_FILTER_EID_1_6;
    C1RXF6bits.EXID         = AO_CAN_FILTER_IDE_1_6;
    C1RXF6bits.SID          = AO_CAN_FILTER_SID_1_6;
    C1FLTCON1bits.FSEL6     = AO_CAN_FILTER_FIFO_1_6;
    C1FLTCON1bits.MSEL6     = AO_CAN_FILTER_MASK_1_6;
    C1FLTCON1bits.FLTEN6    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_7

    C1RXF7bits.EID          = AO_CAN_FILTER_EID_1_7;
    C1RXF7bits.EXID         = AO_CAN_FILTER_IDE_1_7;
    C1RXF7bits.SID          = AO_CAN_FILTER_SID_1_7;
    C1FLTCON1bits.FSEL7     = AO_CAN_FILTER_FIFO_1_7;
    C1FLTCON1bits.MSEL7     = AO_CAN_FILTER_MASK_1_7;
    C1FLTCON1bits.FLTEN7    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_8

    C1RXF8bits.EID          = AO_CAN_FILTER_EID_1_8;
    C1RXF8bits.EXID         = AO_CAN_FILTER_IDE_1_8;
    C1RXF8bits.SID          = AO_CAN_FILTER_SID_1_8;
    C1FLTCON2bits.FSEL8     = AO_CAN_FILTER_FIFO_1_8;
    C1FLTCON2bits.MSEL8     = AO_CAN_FILTER_MASK_1_8;
    C1FLTCON2bits.FLTEN8    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_9

    C1RXF9bits.EID          = AO_CAN_FILTER_EID_1_9;
    C1RXF9bits.EXID         = AO_CAN_FILTER_IDE_1_9;
    C1RXF9bits.SID          = AO_CAN_FILTER_SID_1_9;
    C1FLTCON2bits.FSEL9     = AO_CAN_FILTER_FIFO_1_9;
    C1FLTCON2bits.MSEL9     = AO_CAN_FILTER_MASK_1_9;
    C1FLTCON2bits.FLTEN9    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_10

    C1RXF10bits.EID         = AO_CAN_FILTER_EID_1_10;
    C1RXF10bits.EXID        = AO_CAN_FILTER_IDE_1_10;
    C1RXF10bits.SID         = AO_CAN_FILTER_SID_1_10;
    C1FLTCON2bits.FSEL10    = AO_CAN_FILTER_FIFO_1_10;
    C1FLTCON2bits.MSEL10    = AO_CAN_FILTER_MASK_1_10;
    C1FLTCON2bits.FLTEN10   = 1;

#endif

