tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_ENABLE_1_11

    C1RXF11bits.EID         = AO_CAN_FILTER_EID_1_11;
    C1RXF11bits.EXID        = AO_CAN_FILTER_IDE_1_11;
    C1RXF11bits.SID         = AO_CAN_FILTER_SID_1_11;
    C1FLTCON2bits.FSEL11    = AO_CAN_FILTER_FIFO_1_11;
    C1FLTCON2bits.MSEL11    = AO_CAN_FILTER_MASK_1_11;
    C1FLTCON2bits.FLTEN11   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_12

    C1RXF12bits.EID         = AO_CAN_FILTER_EID_1_12;
    C1RXF12bits.EXID        = AO_CAN_FILTER_IDE_1_12;
    C1RXF12bits.SID         = AO_CAN_FILTER_SID_1_12;
    C1FLTCON3bits.FSEL12    = AO_CAN_FILTER_FIFO_1_12;
    C1FLTCON3bits.MSEL12    = AO_CAN_FILTER_MASK_1_12;
    C1FLTCON3bits.FLTEN12   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_13

    C1RXF13bits.EID         = AO_CAN_FILTER_EID_1_13;
    C1RXF13bits.EXID        = AO_CAN_FILTER_IDE_1_13;
    C1RXF13bits.SID         = AO_CAN_FILTER_SID_1_13;
    C1FLTCON3bits.FSEL13    = AO_CAN_FILTER_FIFO_1_13;
    C1FLTCON3bits.MSEL13    = AO_CAN_FILTER_MASK_1_13;
    C1FLTCON3bits.FLTEN13   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_14

    C1RXF14bits.EID         = AO_CAN_FILTER_EID_1_14;
    C1RXF14bits.EXID        = AO_CAN_FILTER_IDE_1_14;
    C1RXF14bits.SID         = AO_CAN_FILTER_SID_1_14;
    C1FLTCON3bits.FSEL14    = AO_CAN_FILTER_FIFO_1_14;
    C1FLTCON3bits.MSEL14    = AO_CAN_FILTER_MASK_1_14;
    C1FLTCON3bits.FLTEN14   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_15

    C1RXF15bits.EID         = AO_CAN_FILTER_EID_1_15;
    C1RXF15bits.EXID        = AO_CAN_FILTER_IDE_1_15;
    C1RXF15bits.SID         = AO_CAN_FILTER_SID_1_15;
    C1FLTCON3bits.FSEL15    = AO_CAN_FILTER_FIFO_1_15;
    C1FLTCON3bits.MSEL15    = AO_CAN_FILTER_MASK_1_15;
    C1FLTCON3bits.FLTEN15   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_16

    C1RXF16bits.EID         = AO_CAN_FILTER_EID_1_16;
    C1RXF16bits.EXID        = AO_CAN_FILTER_IDE_1_16;
    C1RXF16bits.SID         = AO_CAN_FILTER_SID_1_16;
    C1FLTCON4bits.FSEL16    = AO_CAN_FILTER_FIFO_1_16;
    C1FLTCON4bits.MSEL16    = AO_CAN_FILTER_MASK_1_16;
    C1FLTCON4bits.FLTEN16   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_17

    C1RXF17bits.EID         = AO_CAN_FILTER_EID_1_17;
    C1RXF17bits.EXID        = AO_CAN_FILTER_IDE_1_17;
    C1RXF17bits.SID         = AO_CAN_FILTER_SID_1_17;
    C1FLTCON4bits.FSEL17    = AO_CAN_FILTER_FIFO_1_17;
    C1FLTCON4bits.MSEL17    = AO_CAN_FILTER_MASK_1_17;
    C1FLTCON4bits.FLTEN17   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_18

    C1RXF18bits.EID         = AO_CAN_FILTER_EID_1_18;
    C1RXF18bits.EXID        = AO_CAN_FILTER_IDE_1_18;
    C1RXF18bits.SID         = AO_CAN_FILTER_SID_1_18;
    C1FLTCON4bits.FSEL18    = AO_CAN_FILTER_FIFO_1_18;
    C1FLTCON4bits.MSEL18    = AO_CAN_FILTER_MASK_1_18;
    C1FLTCON4bits.FLTEN18   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_19

    C1RXF19bits.EID         = AO_CAN_FILTER_EID_1_19;
    C1RXF19bits.EXID        = AO_CAN_FILTER_IDE_1_19;
    C1RXF19bits.SID         = AO_CAN_FILTER_SID_1_19;
    C1FLTCON4bits.FSEL19    = AO_CAN_FILTER_FIFO_1_19;
    C1FLTCON4bits.MSEL19    = AO_CAN_FILTER_MASK_1_19;
    C1FLTCON4bits.FLTEN19   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_20

    C1RXF20bits.EID         = AO_CAN_FILTER_EID_1_20;
    C1RXF20bits.EXID        = AO_CAN_FILTER_IDE_1_20;
    C1RXF20bits.SID         = AO_CAN_FILTER_SID_1_20;
    C1FLTCON5bits.FSEL20    = AO_CAN_FILTER_FIFO_1_20;
    C1FLTCON5bits.MSEL20    = AO_CAN_FILTER_MASK_1_20;
    C1FLTCON5bits.FLTEN20   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_21

    C1RXF21bits.EID         = AO_CAN_FILTER_EID_1_21;
    C1RXF21bits.EXID        = AO_CAN_FILTER_IDE_1_21;
    C1RXF21bits.SID         = AO_CAN_FILTER_SID_1_21;
    C1FLTCON5bits.FSEL21    = AO_CAN_FILTER_FIFO_1_21;
    C1FLTCON5bits.MSEL21    = AO_CAN_FILTER_MASK_1_21;
    C1FLTCON5bits.FLTEN21   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_22

    C1RXF22bits.EID         = AO_CAN_FILTER_EID_1_22;
    C1RXF22bits.EXID        = AO_CAN_FILTER_IDE_1_22;
    C1RXF22bits.SID         = AO_CAN_FILTER_SID_1_22;
    C1FLTCON5bits.FSEL22    = AO_CAN_FILTER_FIFO_1_22;
    C1FLTCON5bits.MSEL22    = AO_CAN_FILTER_MASK_1_22;
    C1FLTCON5bits.FLTEN22   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_23

    C1RXF23bits.EID         = AO_CAN_FILTER_EID_1_23;
    C1RXF23bits.EXID        = AO_CAN_FILTER_IDE_1_23;
    C1RXF23bits.SID         = AO_CAN_FILTER_SID_1_23;
    C1FLTCON5bits.FSEL23    = AO_CAN_FILTER_FIFO_1_23;
    C1FLTCON5bits.MSEL23    = AO_CAN_FILTER_MASK_1_23;
    C1FLTCON5bits.FLTEN23   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_24

    C1RXF24bits.EID         = AO_CAN_FILTER_EID_1_24;
    C1RXF24bits.EXID        = AO_CAN_FILTER_IDE_1_24;
    C1RXF24bits.SID         = AO_CAN_FILTER_SID_1_24;
    C1FLTCON6bits.FSEL24    = AO_CAN_FILTER_FIFO_1_24;
    C1FLTCON6bits.MSEL24    = AO_CAN_FILTER_MASK_1_24;
    C1FLTCON6bits.FLTEN24   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_25

    C1RXF25bits.EID         = AO_CAN_FILTER_EID_1_25;
    C1RXF25bits.EXID        = AO_CAN_FILTER_IDE_1_25;
    C1RXF25bits.SID         = AO_CAN_FILTER_SID_1_25;
    C1FLTCON6bits.FSEL25    = AO_CAN_FILTER_FIFO_1_25;
    C1FLTCON6bits.MSEL25    = AO_CAN_FILTER_MASK_1_25;
    C1FLTCON6bits.FLTEN25   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_26

    C1RXF26bits.EID         = AO_CAN_FILTER_EID_1_26;
    C1RXF26bits.EXID        = AO_CAN_FILTER_IDE_1_26;
    C1RXF26bits.SID         = AO_CAN_FILTER_SID_1_26;
    C1FLTCON6bits.FSEL26    = AO_CAN_FILTER_FIFO_1_26;
    C1FLTCON6bits.MSEL26    = AO_CAN_FILTER_MASK_1_26;
    C1FLTCON6bits.FLTEN26   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_27

    C1RXF27bits.EID         = AO_CAN_FILTER_EID_1_27;
    C1RXF27bits.EXID        = AO_CAN_FILTER_IDE_1_27;
    C1RXF27bits.SID         = AO_CAN_FILTER_SID_1_27;
    C1FLTCON6bits.FSEL27    = AO_CAN_FILTER_FIFO_1_27;
    C1FLTCON6bits.MSEL27    = AO_CAN_FILTER_MASK_1_27;
    C1FLTCON6bits.FLTEN27   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_28

    C1RXF28bits.EID         = AO_CAN_FILTER_EID_1_28;
    C1RXF28bits.EXID        = AO_CAN_FILTER_IDE_1_28;
    C1RXF28bits.SID         = AO_CAN_FILTER_SID_1_28;
    C1FLTCON7bits.FSEL28    = AO_CAN_FILTER_FIFO_1_28;
    C1FLTCON7bits.MSEL28    = AO_CAN_FILTER_MASK_1_28;
    C1FLTCON7bits.FLTEN28   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_1_29

    C1RXF29bits.EID         = AO_CAN_FILTER_EID_1_29;
    C1RXF29bits.EXID        = AO_CAN_FILTER_IDE_1_29;
    C1RXF29bits.SID         = AO_CAN_FILTER_SID_1_29;
    C1FLTCON7bits.FSEL29    = AO_CAN_FILTER_FIFO_1_29;
    C1FLTCON7bits.MSEL29    = AO_CAN_FILTER_MASK_1_29;
    C1FLTCON7bits.FLTEN29   = 1;

#endif

