tinko26/ao/sys/ao_sys_xc32_pic32.c
            case 27:

#endif

#if AO_CAN_FIFOS_1 > 26  &&  AO_CAN_FIFOS_TX_1 <= 26

            case 26:

#endif

#if AO_CAN_FIFOS_1 > 25  &&  AO_CAN_FIFOS_TX_1 <= 25

            case 25:

#endif

#if AO_CAN_FIFOS_1 > 24  &&  AO_CAN_FIFOS_TX_1 <= 24

            case 24:

#endif

#if AO_CAN_FIFOS_1 > 23  &&  AO_CAN_FIFOS_TX_1 <= 23

            case 23:

#endif

#if AO_CAN_FIFOS_1 > 22  &&  AO_CAN_FIFOS_TX_1 <= 22

            case 22:

#endif

#if AO_CAN_FIFOS_1 > 21  &&  AO_CAN_FIFOS_TX_1 <= 21

            case 21:

#endif

#if AO_CAN_FIFOS_1 > 20  &&  AO_CAN_FIFOS_TX_1 <= 20

            case 20:

#endif

#if AO_CAN_FIFOS_1 > 19  &&  AO_CAN_FIFOS_TX_1 <= 19

            case 19:

#endif

#if AO_CAN_FIFOS_1 > 18  &&  AO_CAN_FIFOS_TX_1 <= 18

            case 18:

#endif

#if AO_CAN_FIFOS_1 > 17  &&  AO_CAN_FIFOS_TX_1 <= 17

            case 17:

#endif

#if AO_CAN_FIFOS_1 > 16  &&  AO_CAN_FIFOS_TX_1 <= 16

            case 16:

#endif

#if AO_CAN_FIFOS_1 > 15  &&  AO_CAN_FIFOS_TX_1 <= 15

            case 15:

#endif

#if AO_CAN_FIFOS_1 > 14  &&  AO_CAN_FIFOS_TX_1 <= 14

            case 14:

#endif

#if AO_CAN_FIFOS_1 > 13  &&  AO_CAN_FIFOS_TX_1 <= 13

            case 13:

#endif

#if AO_CAN_FIFOS_1 > 12  &&  AO_CAN_FIFOS_TX_1 <= 12

            case 12:

#endif

#if AO_CAN_FIFOS_1 > 11  &&  AO_CAN_FIFOS_TX_1 <= 11

            case 11:

#endif

#if AO_CAN_FIFOS_1 > 10  &&  AO_CAN_FIFOS_TX_1 <= 10

            case 10:

#endif

#if AO_CAN_FIFOS_1 >  9  &&  AO_CAN_FIFOS_TX_1 <=  9

            case  9:

#endif

#if AO_CAN_FIFOS_1 >  8  &&  AO_CAN_FIFOS_TX_1 <=  8

            case  8:

#endif

#if AO_CAN_FIFOS_1 >  7  &&  AO_CAN_FIFOS_TX_1 <=  7

            case  7:

#endif

#if AO_CAN_FIFOS_1 >  6  &&  AO_CAN_FIFOS_TX_1 <=  6

            case  6:

#endif

#if AO_CAN_FIFOS_1 >  5  &&  AO_CAN_FIFOS_TX_1 <=  5

            case  5:

#endif

#if AO_CAN_FIFOS_1 >  4  &&  AO_CAN_FIFOS_TX_1 <=  4

            case  4:

#endif

#if AO_CAN_FIFOS_1 >  3  &&  AO_CAN_FIFOS_TX_1 <=  3

            case  3:

#endif

#if AO_CAN_FIFOS_1 >  2  &&  AO_CAN_FIFOS_TX_1 <=  2

            case  2:

#endif

#if AO_CAN_FIFOS_1 >  1  &&  AO_CAN_FIFOS_TX_1 <=  1

            case  1:

#endif

#if AO_CAN_FIFOS_1 >  0  &&  AO_CAN_FIFOS_TX_1 <=  0

            case  0:

#endif

                c1 = PA_TO_KVA1(reg->fifo[i1].ua.reg);

                c2 = ao_can_in_can_1 + i1 - AO_CAN_FIFOS_TX_1;

                if (reg->fifo[i1].con.bits.donly)
                {
                    c2->cmsgsid = 0;

                    c2->cmsgeid = 0;

                    c2->data = *((uint64_t *) c1);
                }

                else
                {
                    *c2 = *c1;
                }

                if (!c2->ide && c2->srr)
                {
                    c2->rtr = 1;
                }

                ao_send_obj_try(ao_can_in_1 + i1 - AO_CAN_FIFOS_TX_1);

                // DS80000480.

                // The CxFIFOCONn.FRESET bit and the CxFIFOCONn.UINC
                // bit are not settable through a normal Special
                // Function Register (SFR) write.

                // Use the SET register operations to change the state
                // of these bits.

                reg->fifo[i1].con.set = _C1FIFOCON0_UINC_MASK;

                break;

#endif

#if AO_CAN_TX_1

#if AO_CAN_FIFOS_1 > 31  &&  AO_CAN_FIFOS_TX_1 > 31

            case 31:

#endif

#if AO_CAN_FIFOS_1 > 30  &&  AO_CAN_FIFOS_TX_1 > 30

            case 30:

#endif

#if AO_CAN_FIFOS_1 > 29  &&  AO_CAN_FIFOS_TX_1 > 29

            case 29:

#endif

#if AO_CAN_FIFOS_1 > 28  &&  AO_CAN_FIFOS_TX_1 > 28

            case 28:

#endif

#if AO_CAN_FIFOS_1 > 27  &&  AO_CAN_FIFOS_TX_1 > 27

            case 27:

#endif

#if AO_CAN_FIFOS_1 > 26  &&  AO_CAN_FIFOS_TX_1 > 26

            case 26:

#endif

#if AO_CAN_FIFOS_1 > 25  &&  AO_CAN_FIFOS_TX_1 > 25

            case 25:

#endif

#if AO_CAN_FIFOS_1 > 24  &&  AO_CAN_FIFOS_TX_1 > 24

            case 24:

#endif

#if AO_CAN_FIFOS_1 > 23  &&  AO_CAN_FIFOS_TX_1 > 23

            case 23:

#endif

#if AO_CAN_FIFOS_1 > 22  &&  AO_CAN_FIFOS_TX_1 > 22

            case 22:

#endif

#if AO_CAN_FIFOS_1 > 21  &&  AO_CAN_FIFOS_TX_1 > 21

            case 21:

#endif

#if AO_CAN_FIFOS_1 > 20  &&  AO_CAN_FIFOS_TX_1 > 20

            case 20:

#endif

#if AO_CAN_FIFOS_1 > 19  &&  AO_CAN_FIFOS_TX_1 > 19

            case 19:

#endif

#if AO_CAN_FIFOS_1 > 18  &&  AO_CAN_FIFOS_TX_1 > 18

            case 18:

#endif

#if AO_CAN_FIFOS_1 > 17  &&  AO_CAN_FIFOS_TX_1 > 17

            case 17:

#endif

#if AO_CAN_FIFOS_1 > 16  &&  AO_CAN_FIFOS_TX_1 > 16

            case 16:

#endif

#if AO_CAN_FIFOS_1 > 15  &&  AO_CAN_FIFOS_TX_1 > 15

            case 15:

#endif

#if AO_CAN_FIFOS_1 > 14  &&  AO_CAN_FIFOS_TX_1 > 14

            case 14:

#endif

#if AO_CAN_FIFOS_1 > 13  &&  AO_CAN_FIFOS_TX_1 > 13

            case 13:

#endif

#if AO_CAN_FIFOS_1 > 12  &&  AO_CAN_FIFOS_TX_1 > 12

            case 12:

#endif

#if AO_CAN_FIFOS_1 > 11  &&  AO_CAN_FIFOS_TX_1 > 11

            case 11:

#endif

#if AO_CAN_FIFOS_1 > 10  &&  AO_CAN_FIFOS_TX_1 > 10

            case 10:

#endif

#if AO_CAN_FIFOS_1 >  9  &&  AO_CAN_FIFOS_TX_1 >  9

            case  9:

#endif

#if AO_CAN_FIFOS_1 >  8  &&  AO_CAN_FIFOS_TX_1 >  8

            case  8:

#endif

#if AO_CAN_FIFOS_1 >  7  &&  AO_CAN_FIFOS_TX_1 >  7

            case  7:

#endif

#if AO_CAN_FIFOS_1 >  6  &&  AO_CAN_FIFOS_TX_1 >  6

            case  6:

#endif

#if AO_CAN_FIFOS_1 >  5  &&  AO_CAN_FIFOS_TX_1 >  5

            case  5:

#endif

#if AO_CAN_FIFOS_1 >  4  &&  AO_CAN_FIFOS_TX_1 >  4

            case  4:

#endif

#if AO_CAN_FIFOS_1 >  3  &&  AO_CAN_FIFOS_TX_1 >  3

            case  3:

#endif

#if AO_CAN_FIFOS_1 >  2  &&  AO_CAN_FIFOS_TX_1 >  2

            case  2:

#endif

#if AO_CAN_FIFOS_1 >  1  &&  AO_CAN_FIFOS_TX_1 >  1

            case  1:

#endif

#if AO_CAN_FIFOS_1 >  0  &&  AO_CAN_FIFOS_TX_1 >  0

            case  0:

#endif

                // Fifo.

#if AO_CAN_TXST_1

