tinko26/ao/sys/ao_sys_xc32_pic32.c
                if
                (
                    reg->fifo[i1].intx.bits.txemptyie &&
                    reg->fifo[i1].intx.bits.txemptyif
                )
                {
                    ao_can_sent_info_1.fifo = i1;

                    ao_can_sent_info_1.fifo_tx = i1;

                    ao_can_sent_1(&ao_can_sent_info_1);

                    reg->fifo[i1].intx.bits.txemptyie = 0;
                }

                if
                (
                    reg->fifo[i1].intx.bits.txnfullie &&
                    reg->fifo[i1].intx.bits.txnfullif
                )
                {

#endif

                    ao_cond_set(ao_can_cond_not_full_1 + i1);

                    reg->fifo[i1].intx.bits.txnfullie = 0;

#if AO_CAN_TXST_1

                }

#endif

                break;

#endif

            default:

                // This really should not have happend.

                ao_assert(false);

                break;
        }
    }
    while (i1 != 0b1000000);
}

// ----------------------------------------------------------------------------

void ao_can_listen_all_1()
{
    ao_can_var_mode_1 = 7;

    ao_cond_set(&ao_can_cond_change_1);
}

void ao_can_listen_only_1()
{
    ao_can_var_mode_1 = 3;

    ao_cond_set(&ao_can_cond_change_1);
}

void ao_can_loopback_1()
{
    ao_can_var_mode_1 = 2;

    ao_cond_set(&ao_can_cond_change_1);
}

void ao_can_normal_1()
{
    ao_can_var_mode_1 = 0;

    ao_cond_set(&ao_can_cond_change_1);
}

// ----------------------------------------------------------------------------

void ao_can_start_1()
{
    ao_task_start(&ao_can_task_1);
}

void ao_can_started_1()
{
    // Variables.

#if AO_CAN_TX_1

    ao_can_t *      c1;
    ao_can_t *      c2;

    size_t          i;

    ao_can_reg_t *  reg = ao_can_reg_1();

#endif


    // Ready.

    while (ao_can_var_started_1)
    {
        // Await begin.

        ao_cond_wait_begin(     &ao_can_cond_change_wait_1);

        ao_sem_take_begin(      &ao_can_sem_take_1);

#if AO_CAN_TX_1

        for (i = 0; i < AO_CAN_FIFOS_TX_1; i++)
        {
            ao_cond_wait_begin( &ao_can_cond_not_full_wait_1[i]);

            ao_recv_obj_begin(  &ao_can_out_1               [i]);

            ao_async_all_begin( &ao_can_async_send_1        [i]);
        }

#endif


        // Await.

        ao_await_any_forever(   &ao_can_async_started_1);


        // Await end.

#if AO_CAN_TX_1

        for (i = 0; i < AO_CAN_FIFOS_TX_1; i++)
        {
            ao_async_all_end(   &ao_can_async_send_1        [i]);

            ao_recv_obj_end(    &ao_can_out_1               [i]);

            ao_cond_wait_end(   &ao_can_cond_not_full_wait_1[i]);
        }

#endif

        ao_sem_take_end(        &ao_can_sem_take_1);

        ao_cond_wait_end(       &ao_can_cond_change_wait_1);


        // Stop.

        if (ao_can_sem_take_1.result)
        {
            ao_can_var_started_1 = false;
        }


        // Change.

        else if (ao_can_cond_change_wait_1.result)
        {
            ao_cond_clear(&ao_can_cond_change_1);

            ao_can_change_1(ao_can_var_mode_1);
        }


        // Out.

#if AO_CAN_TX_1

        else
        {
            for (i = 0; i < AO_CAN_FIFOS_TX_1; i++)
            {
                if
                (
                    ao_can_cond_not_full_wait_1 [i].result &&
                    ao_can_out_1                [i].result
                )
                {
                    c2 = ao_can_out_can_1 + i;

                    c1 = (ao_can_t *) PA_TO_KVA1(reg->fifo[i].ua.reg);

                    *c1 = *c2;


                    // DS61154.

                    // Section 34.7.1.

                    // Format of Transmit Message Buffer.

                    // Unused bits should be clear.

                    // RB0 and RB1 bits must be clear.

                    c1->cmsgeid &= 0x3FFFFE0F;
                    c1->cmsgsid &= 0x000007FF;


                    // In case of an extended message format,
                    // the SRR bit should be set.

                    if (c1->ide)
                    {
                        c1->srr = 1;
                    }


                    // DS80000480.

                    // The CxFIFOCONn.FRESET bit and the CxFIFOCONn.UINC bit
                    // are not settable through a normal Special Function
                    // Register (SFR) write.

                    // Use the SET register operations to change the state of
                    // these bits.

                    reg->fifo[i].con.set = _C1FIFOCON0_UINC_MASK;


#if AO_CAN_TXST_1

                    reg->fifo[i].intx.bits.txemptyie = 1;

#endif

                    if (reg->fifo[i].con.bits.rtren == 0)
                    {
                        if (reg->fifo[i].intx.bits.txnfullif == 0)
                        {
                            ao_cond_clear(ao_can_cond_not_full_1 + i);

                            reg->fifo[i].intx.bits.txnfullie = 1;
                        }

                        reg->fifo[i].con.set = _C1FIFOCON0_TXREQ_MASK;
                    }
                }
            }
        }

#endif

    }
}

void ao_can_starting_1()
{
    // Variables.

    uint32_t mode;


    // Ready.

    ao_can_var_started_1 = true;

    ao_cond_clear(&ao_can_cond_change_1);

    mode = ao_can_var_mode_1;

    ao_assert
    (
        mode == 0 ||
        mode == 2 ||
        mode == 3 ||
        mode == 7
    );

    ao_can_change_1(mode);
}

void ao_can_stop_1()
{
    ao_sem_give(&ao_can_sem_1, 1);
}

void ao_can_stopping_1()
{
    ao_can_change_1(4);
}

// ----------------------------------------------------------------------------

void ao_can_task_proc_1(void * x)
{
    // Variables.

    size_t          i;

    ao_can_reg_t *  reg = ao_can_reg_1();

    (void)          x;


    // Ready.

    while (1)
    {
        // On.

        reg->con.bits.on = 1;

        ao_assert(reg->con.bits.opmod == 4);


        // Configuration.

        ao_can_config_1();


        // Interrupts layer 3.

#if AO_CAN_RX_1

