tinko26/ao/sys/ao_sys_xc32_pic32.c
        for (i = AO_CAN_FIFOS_TX_1; i < AO_CAN_FIFOS_TX_1 + AO_CAN_FIFOS_RX_1; i++)
        {
            reg->fifo[i].con.bits.txen = 0;

            reg->fifo[i].intx.bits.rxnemptyie = 1;

#if AO_CAN_RXOF_1

            reg->fifo[i].intx.bits.rxovflie = 1;

#endif

        }

#endif

#if AO_CAN_TX_1

        for (i = 0; i < AO_CAN_FIFOS_TX_1; i++)
        {
            reg->fifo[i].con.bits.txen = 1;

            if (reg->fifo[i].con.bits.rtren)
            {

#if AO_CAN_TXUF_1

                reg->fifo[i].intx.bits.rxovflie = 1;

#endif

                ao_cond_set(&ao_can_cond_not_full_1[i]);
            }

            else
            {
                if (reg->fifo[i].intx.bits.txnfullif == 0)
                {
                    reg->fifo[i].intx.bits.txnfullie = 1;
                }

                else
                {
                    ao_cond_set(&ao_can_cond_not_full_1[i]);
                }
            }

#if AO_CAN_TXST_1

            if (reg->fifo[i].intx.bits.txemptyif) { }

            else
            {
                reg->fifo[i].intx.bits.txemptyie = 1;
            }

#endif

        }

#endif


        // Interrupts layer 2.

        reg->intx.bits.modie = 1;
        reg->intx.bits.serrie = 1;

#if AO_CAN_BUS_1

        reg->intx.bits.cerrie = 1;

#endif

#if AO_CAN_INVALID_1

        reg->intx.bits.ivrie = 1;

#endif

#if AO_CAN_RBOV_1

        reg->intx.bits.rbovie = 1;

#endif

#if AO_CAN_RX_1

        reg->intx.bits.rbie = 1;

#endif

#if AO_CAN_TIMER_1

        reg->intx.bits.ctmrie = 1;

#endif

#if AO_CAN_TX_1

        reg->intx.bits.tbie = 1;

#endif

#if AO_CAN_WAKE_UP_1

        reg->intx.bits.wakie = 1;

#endif


        // Interrupts layer 1.

        ao_ir_can1_enable();


        // Start.

        ao_can_starting_1();

        ao_can_started_1();


        // Stop.

        ao_can_stopping_1();


        // Interrupts layer 1.

        ao_ir_can1_disable();


        // Interrupts layer 2.

        reg->intx.bits.modie = 0;
        reg->intx.bits.serrie = 0;

#if AO_CAN_BUS_1

        reg->intx.bits.cerrie = 0;

#endif

#if AO_CAN_INVALID_1

        reg->intx.bits.ivrie = 0;

#endif

#if AO_CAN_RBOV_1

        reg->intx.bits.rbovie = 0;

#endif

#if AO_CAN_RX_1

        reg->intx.bits.rbie = 0;

#endif

#if AO_CAN_TIMER_1

        reg->intx.bits.ctmrie = 0;

#endif

#if AO_CAN_TX_1

        reg->intx.bits.tbie = 0;

#endif

#if AO_CAN_WAKE_UP_1

        reg->intx.bits.wakie = 0;

#endif


        // Interrupts layer 3.

#if AO_CAN_TX_1

        for (i = 0; i < AO_CAN_FIFOS_TX_1; i++)
        {

            reg->fifo[i].intx.bits.txnfullie = 0;

#if AO_CAN_TXUF_1

            reg->fifo[i].intx.bits.rxovflie = 0;

#endif

#if AO_CAN_TXST_1

            reg->fifo[i].intx.bits.txemptyie = 0;

#endif

        }

#endif

#if AO_CAN_RX_1

        for (i = AO_CAN_FIFOS_TX_1; i < AO_CAN_FIFOS_TX_1 + AO_CAN_FIFOS_RX_1; i++)
        {
            reg->fifo[i].intx.bits.rxnemptyie = 0;

#if AO_CAN_RXOF_1

            reg->fifo[i].intx.bits.rxovflie = 0;

#endif

        }

#endif


        // Off.

        reg->con.bits.on = 0;

        while (reg->con.bits.canbusy) { }


        // Task.

        ao_stop();
    }
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_CAN_2 && AO_CAN_2

// ----------------------------------------------------------------------------

#if AO_CAN_BAUD_2 < AO_CAN_BAUD_MIN_2

#error Invalid configuration.

#endif

#if AO_CAN_BAUD_2 > AO_CAN_BAUD_MAX_2

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_2 > 0  && AO_CAN_BUFFERS_2_0  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 1  && AO_CAN_BUFFERS_2_1  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 2  && AO_CAN_BUFFERS_2_2  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 3  && AO_CAN_BUFFERS_2_3  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 4  && AO_CAN_BUFFERS_2_4  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 5  && AO_CAN_BUFFERS_2_5  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 6  && AO_CAN_BUFFERS_2_6  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 7  && AO_CAN_BUFFERS_2_7  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 8  && AO_CAN_BUFFERS_2_8  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 9  && AO_CAN_BUFFERS_2_9  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 10 && AO_CAN_BUFFERS_2_10 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 11 && AO_CAN_BUFFERS_2_11 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 12 && AO_CAN_BUFFERS_2_12 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 13 && AO_CAN_BUFFERS_2_13 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 14 && AO_CAN_BUFFERS_2_14 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 15 && AO_CAN_BUFFERS_2_15 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 16 && AO_CAN_BUFFERS_2_16 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 17 && AO_CAN_BUFFERS_2_17 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 18 && AO_CAN_BUFFERS_2_18 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 19 && AO_CAN_BUFFERS_2_19 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 20 && AO_CAN_BUFFERS_2_20 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 21 && AO_CAN_BUFFERS_2_21 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 22 && AO_CAN_BUFFERS_2_22 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 23 && AO_CAN_BUFFERS_2_23 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 24 && AO_CAN_BUFFERS_2_24 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 25 && AO_CAN_BUFFERS_2_25 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 26 && AO_CAN_BUFFERS_2_26 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 27 && AO_CAN_BUFFERS_2_27 < 1

#error Invalid configuration.

#endif

