tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_2 > 28 && AO_CAN_BUFFERS_2_28 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 29 && AO_CAN_BUFFERS_2_29 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 30 && AO_CAN_BUFFERS_2_30 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 31 && AO_CAN_BUFFERS_2_31 < 1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_2 > 0  && AO_CAN_BUFFERS_2_0  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 1  && AO_CAN_BUFFERS_2_1  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 2  && AO_CAN_BUFFERS_2_2  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 3  && AO_CAN_BUFFERS_2_3  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 4  && AO_CAN_BUFFERS_2_4  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 5  && AO_CAN_BUFFERS_2_5  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 6  && AO_CAN_BUFFERS_2_6  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 7  && AO_CAN_BUFFERS_2_7  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 8  && AO_CAN_BUFFERS_2_8  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 9  && AO_CAN_BUFFERS_2_9  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 10 && AO_CAN_BUFFERS_2_10 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 11 && AO_CAN_BUFFERS_2_11 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 12 && AO_CAN_BUFFERS_2_12 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 13 && AO_CAN_BUFFERS_2_13 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 14 && AO_CAN_BUFFERS_2_14 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 15 && AO_CAN_BUFFERS_2_15 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 16 && AO_CAN_BUFFERS_2_16 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 17 && AO_CAN_BUFFERS_2_17 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 18 && AO_CAN_BUFFERS_2_18 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 19 && AO_CAN_BUFFERS_2_19 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 20 && AO_CAN_BUFFERS_2_20 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 21 && AO_CAN_BUFFERS_2_21 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 22 && AO_CAN_BUFFERS_2_22 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 23 && AO_CAN_BUFFERS_2_23 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 24 && AO_CAN_BUFFERS_2_24 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 25 && AO_CAN_BUFFERS_2_25 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 26 && AO_CAN_BUFFERS_2_26 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 27 && AO_CAN_BUFFERS_2_27 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 28 && AO_CAN_BUFFERS_2_28 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 29 && AO_CAN_BUFFERS_2_29 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 30 && AO_CAN_BUFFERS_2_30 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_2 > 31 && AO_CAN_BUFFERS_2_31 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_2 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_RX_2 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_TX_2 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_EID_2_0  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_1  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_2  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_3  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_4  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_5  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_6  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_7  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_8  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_9  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_10 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_11 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_12 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_13 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_14 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_15 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_16 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_17 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_18 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_19 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_20 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_21 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_22 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_23 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_24 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_25 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_26 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_27 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_28 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_29 > 0x3FFFF

#error Invalid configuration.

#endif

