tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_EID_2_30 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_2_31 > 0x3FFFF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_FIFO_2_0  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_1  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_2  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_3  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_4  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_5  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_6  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_7  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_8  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_9  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_10 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_11 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_12 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_13 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_14 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_15 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_16 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_17 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_18 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_19 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_20 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_21 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_22 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_23 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_24 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_25 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_26 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_27 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_28 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_29 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_30 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_2_31 > 31

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_IDE_2_0  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_1  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_2  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_3  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_4  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_5  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_6  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_7  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_8  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_9  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_10 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_11 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_12 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_13 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_14 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_15 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_16 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_17 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_18 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_19 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_20 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_21 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_22 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_23 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_24 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_25 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_26 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_27 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_28 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_29 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_30 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_2_31 > 0x1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_2_0  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_1  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_2  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_3  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_4  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_5  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_6  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_7  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_8  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_9  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_10 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_11 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_12 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_13 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_14 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_15 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_16 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_17 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_18 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_19 > 3

#error Invalid configuration.

#endif

