tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_MASK_2_20 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_21 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_22 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_23 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_24 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_25 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_26 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_27 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_28 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_29 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_30 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_2_31 > 3

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_EID_2_0 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_2_1 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_2_2 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_2_3 > 0x3FFFF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_IDE_2_0 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_2_1 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_2_2 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_2_3 > 0x1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_SID_2_0 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_2_1 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_2_2 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_2_3 > 0x7FF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_SID_2_0  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_1  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_2  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_3  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_4  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_5  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_6  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_7  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_8  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_9  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_10 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_11 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_12 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_13 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_14 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_15 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_16 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_17 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_18 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_19 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_20 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_21 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_22 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_23 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_24 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_25 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_26 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_27 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_28 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_29 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_30 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_2_31 > 0x7FF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#define AO_CAN_RXOF_2           ((AO_CAN_RX_2)      && (AO_CAN_OVERFLOW_2))

#define AO_CAN_TXST_2           ((AO_CAN_TX_2)      && (AO_CAN_SENT_2))

#define AO_CAN_TXUF_2           ((AO_CAN_TX_2)      && (AO_CAN_UNDERFLOW_2))

// ----------------------------------------------------------------------------

#define AO_CAN_RBOV_2           ((AO_CAN_RXOF_2)    || (AO_CAN_TXUF_2))

// ----------------------------------------------------------------------------

static  void                    ao_can_change_2(    uint32_t mode);

static  void                    ao_can_started_2();

static  void                    ao_can_starting_2();

static  void                    ao_can_stopping_2();

static  void                    ao_can_task_proc_2( void * x);

// ----------------------------------------------------------------------------

        ao_can_t                ao_can_buffers_2    [AO_CAN_BUFFERS_2];

// ----------------------------------------------------------------------------

#if AO_CAN_BUS_2

static  ao_can_bus_info_t       ao_can_bus_info_2;

#endif

#if AO_CAN_INVALID_2

static  ao_can_invalid_info_t   ao_can_invalid_info_2;

#endif

#if AO_CAN_MODE_2

static  ao_can_mode_info_t      ao_can_mode_info_2;

#endif

#if AO_CAN_RXOF_2

static  ao_can_overflow_info_t  ao_can_overflow_info_2;

#endif

#if AO_CAN_SYSTEM_2

static  ao_can_system_info_t    ao_can_system_info_2;

#endif

