tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_TIMER_2

static  ao_can_timer_info_t     ao_can_timer_info_2;

#endif

#if AO_CAN_TXST_2

static  ao_can_sent_info_t      ao_can_sent_info_2;

#endif

#if AO_CAN_TXUF_2

static  ao_can_underflow_info_t ao_can_underflow_info_2;

#endif

#if AO_CAN_WAKE_UP_2

static  ao_can_wake_up_info_t   ao_can_wake_up_info_2;

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_RX_2

// ----------------------------------------------------------------------------

static  ao_can_t                ao_can_in_can_2     [AO_CAN_FIFOS_RX_2];

        ao_send_obj_t           ao_can_in_2         [AO_CAN_FIFOS_RX_2] =
{

#if AO_CAN_FIFOS_RX_2 >  0

#if AO_CAN_FIFOS_RX_2 >  0

{
        .ptr                    = ao_can_in_can_2 +  0
},

#endif

#if AO_CAN_FIFOS_RX_2 >  1

{
        .ptr                    = ao_can_in_can_2 +  1
},

#endif

#if AO_CAN_FIFOS_RX_2 >  2

{
        .ptr                    = ao_can_in_can_2 +  2
},

#endif

#if AO_CAN_FIFOS_RX_2 >  3

{
        .ptr                    = ao_can_in_can_2 +  3
},

#endif

#if AO_CAN_FIFOS_RX_2 >  4

{
        .ptr                    = ao_can_in_can_2 +  4
},

#endif

#if AO_CAN_FIFOS_RX_2 >  5

{
        .ptr                    = ao_can_in_can_2 +  5
},

#endif

#if AO_CAN_FIFOS_RX_2 >  6

{
        .ptr                    = ao_can_in_can_2 +  6
},

#endif

#if AO_CAN_FIFOS_RX_2 >  7

{
        .ptr                    = ao_can_in_can_2 +  7
},

#endif

#if AO_CAN_FIFOS_RX_2 >  8

{
        .ptr                    = ao_can_in_can_2 +  8
},

#endif

#if AO_CAN_FIFOS_RX_2 >  9

{
        .ptr                    = ao_can_in_can_2 +  9
},

#endif

#if AO_CAN_FIFOS_RX_2 > 10

{
        .ptr                    = ao_can_in_can_2 + 10
},

#endif

#if AO_CAN_FIFOS_RX_2 > 11

{
        .ptr                    = ao_can_in_can_2 + 11
},

#endif

#if AO_CAN_FIFOS_RX_2 > 12

{
        .ptr                    = ao_can_in_can_2 + 12
},

#endif

#if AO_CAN_FIFOS_RX_2 > 13

{
        .ptr                    = ao_can_in_can_2 + 13
},

#endif

#if AO_CAN_FIFOS_RX_2 > 14

{
        .ptr                    = ao_can_in_can_2 + 14
},

#endif

#if AO_CAN_FIFOS_RX_2 > 15

{
        .ptr                    = ao_can_in_can_2 + 15
},

#endif

#if AO_CAN_FIFOS_RX_2 > 16

{
        .ptr                    = ao_can_in_can_2 + 16
},

#endif

#if AO_CAN_FIFOS_RX_2 > 17

{
        .ptr                    = ao_can_in_can_2 + 17
},

#endif

#if AO_CAN_FIFOS_RX_2 > 18

{
        .ptr                    = ao_can_in_can_2 + 18
},

#endif

#if AO_CAN_FIFOS_RX_2 > 19

{
        .ptr                    = ao_can_in_can_2 + 19
},

#endif

#if AO_CAN_FIFOS_RX_2 > 20

{
        .ptr                    = ao_can_in_can_2 + 20
},

#endif

#if AO_CAN_FIFOS_RX_2 > 21

{
        .ptr                    = ao_can_in_can_2 + 21
},

#endif

#if AO_CAN_FIFOS_RX_2 > 22

{
        .ptr                    = ao_can_in_can_2 + 22
},

#endif

#if AO_CAN_FIFOS_RX_2 > 23

{
        .ptr                    = ao_can_in_can_2 + 23
},

#endif

#if AO_CAN_FIFOS_RX_2 > 24

{
        .ptr                    = ao_can_in_can_2 + 24
},

#endif

#if AO_CAN_FIFOS_RX_2 > 25

{
        .ptr                    = ao_can_in_can_2 + 25
},

#endif

#if AO_CAN_FIFOS_RX_2 > 26

{
        .ptr                    = ao_can_in_can_2 + 26
},

#endif

#if AO_CAN_FIFOS_RX_2 > 27

{
        .ptr                    = ao_can_in_can_2 + 27
},

#endif

#if AO_CAN_FIFOS_RX_2 > 28

{
        .ptr                    = ao_can_in_can_2 + 28
},

#endif

#if AO_CAN_FIFOS_RX_2 > 29

{
        .ptr                    = ao_can_in_can_2 + 29
},

#endif

#if AO_CAN_FIFOS_RX_2 > 30

{
        .ptr                    = ao_can_in_can_2 + 30
},

#endif

#if AO_CAN_FIFOS_RX_2 > 31

{
        .ptr                    = ao_can_in_can_2 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

#endif

#if AO_CAN_TX_2

// ----------------------------------------------------------------------------

static  ao_can_t                ao_can_out_can_2    [AO_CAN_FIFOS_TX_2];

        ao_recv_obj_t           ao_can_out_2        [AO_CAN_FIFOS_TX_2] =
{

#if AO_CAN_FIFOS_TX_2 >  0

#if AO_CAN_FIFOS_TX_2 >  0

{
        .ptr                    = ao_can_out_can_2 +  0
},

#endif

#if AO_CAN_FIFOS_TX_2 >  1

{
        .ptr                    = ao_can_out_can_2 +  1
},

#endif

#if AO_CAN_FIFOS_TX_2 >  2

{
        .ptr                    = ao_can_out_can_2 +  2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  3

{
        .ptr                    = ao_can_out_can_2 +  3
},

#endif

#if AO_CAN_FIFOS_TX_2 >  4

{
        .ptr                    = ao_can_out_can_2 +  4
},

#endif

#if AO_CAN_FIFOS_TX_2 >  5

{
        .ptr                    = ao_can_out_can_2 +  5
},

#endif

#if AO_CAN_FIFOS_TX_2 >  6

{
        .ptr                    = ao_can_out_can_2 +  6
},

#endif

#if AO_CAN_FIFOS_TX_2 >  7

{
        .ptr                    = ao_can_out_can_2 +  7
},

#endif

#if AO_CAN_FIFOS_TX_2 >  8

{
        .ptr                    = ao_can_out_can_2 +  8
},

#endif

#if AO_CAN_FIFOS_TX_2 >  9

{
        .ptr                    = ao_can_out_can_2 +  9
},

#endif

#if AO_CAN_FIFOS_TX_2 > 10

{
        .ptr                    = ao_can_out_can_2 + 10
},

#endif

#if AO_CAN_FIFOS_TX_2 > 11

{
        .ptr                    = ao_can_out_can_2 + 11
},

#endif

#if AO_CAN_FIFOS_TX_2 > 12

{
        .ptr                    = ao_can_out_can_2 + 12
},

#endif

#if AO_CAN_FIFOS_TX_2 > 13

{
        .ptr                    = ao_can_out_can_2 + 13
},

#endif

#if AO_CAN_FIFOS_TX_2 > 14

{
        .ptr                    = ao_can_out_can_2 + 14
},

#endif

#if AO_CAN_FIFOS_TX_2 > 15

{
        .ptr                    = ao_can_out_can_2 + 15
},

#endif

#if AO_CAN_FIFOS_TX_2 > 16

{
        .ptr                    = ao_can_out_can_2 + 16
},

#endif

#if AO_CAN_FIFOS_TX_2 > 17

{
        .ptr                    = ao_can_out_can_2 + 17
},

#endif

#if AO_CAN_FIFOS_TX_2 > 18

{
        .ptr                    = ao_can_out_can_2 + 18
},

#endif

#if AO_CAN_FIFOS_TX_2 > 19

{
        .ptr                    = ao_can_out_can_2 + 19
},

#endif

#if AO_CAN_FIFOS_TX_2 > 20

{
        .ptr                    = ao_can_out_can_2 + 20
},

#endif

#if AO_CAN_FIFOS_TX_2 > 21

{
        .ptr                    = ao_can_out_can_2 + 21
},

#endif

#if AO_CAN_FIFOS_TX_2 > 22

{
        .ptr                    = ao_can_out_can_2 + 22
},

#endif

#if AO_CAN_FIFOS_TX_2 > 23

{
        .ptr                    = ao_can_out_can_2 + 23
},

#endif

