tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_TX_2 > 24

{
        .ptr                    = ao_can_out_can_2 + 24
},

#endif

#if AO_CAN_FIFOS_TX_2 > 25

{
        .ptr                    = ao_can_out_can_2 + 25
},

#endif

#if AO_CAN_FIFOS_TX_2 > 26

{
        .ptr                    = ao_can_out_can_2 + 26
},

#endif

#if AO_CAN_FIFOS_TX_2 > 27

{
        .ptr                    = ao_can_out_can_2 + 27
},

#endif

#if AO_CAN_FIFOS_TX_2 > 28

{
        .ptr                    = ao_can_out_can_2 + 28
},

#endif

#if AO_CAN_FIFOS_TX_2 > 29

{
        .ptr                    = ao_can_out_can_2 + 29
},

#endif

#if AO_CAN_FIFOS_TX_2 > 30

{
        .ptr                    = ao_can_out_can_2 + 30
},

#endif

#if AO_CAN_FIFOS_TX_2 > 31

{
        .ptr                    = ao_can_out_can_2 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_change_2;

static  ao_cond_wait_t          ao_can_cond_change_wait_2 =
{
        .cond                   = &ao_can_cond_change_2
};

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_changed_2;

static  ao_cond_wait_t          ao_can_cond_changed_wait_2 =
{
        .cond                   = &ao_can_cond_changed_2
};

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_not_full_2      [AO_CAN_FIFOS_TX_2];

static  ao_cond_wait_t          ao_can_cond_not_full_wait_2 [AO_CAN_FIFOS_TX_2] =
{

#if AO_CAN_FIFOS_TX_2 >  0

#if AO_CAN_FIFOS_TX_2 >  0

{
        .cond                   = ao_can_cond_not_full_2 +  0
},

#endif

#if AO_CAN_FIFOS_TX_2 >  1

{
        .cond                   = ao_can_cond_not_full_2 +  1
},

#endif

#if AO_CAN_FIFOS_TX_2 >  2

{
        .cond                   = ao_can_cond_not_full_2 +  2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  3

{
        .cond                   = ao_can_cond_not_full_2 +  3
},

#endif

#if AO_CAN_FIFOS_TX_2 >  4

{
        .cond                   = ao_can_cond_not_full_2 +  4
},

#endif

#if AO_CAN_FIFOS_TX_2 >  5

{
        .cond                   = ao_can_cond_not_full_2 +  5
},

#endif

#if AO_CAN_FIFOS_TX_2 >  6

{
        .cond                   = ao_can_cond_not_full_2 +  6
},

#endif

#if AO_CAN_FIFOS_TX_2 >  7

{
        .cond                   = ao_can_cond_not_full_2 +  7
},

#endif

#if AO_CAN_FIFOS_TX_2 >  8

{
        .cond                   = ao_can_cond_not_full_2 +  8
},

#endif

#if AO_CAN_FIFOS_TX_2 >  9

{
        .cond                   = ao_can_cond_not_full_2 +  9
},

#endif

#if AO_CAN_FIFOS_TX_2 > 10

{
        .cond                   = ao_can_cond_not_full_2 + 10
},

#endif

#if AO_CAN_FIFOS_TX_2 > 11

{
        .cond                   = ao_can_cond_not_full_2 + 11
},

#endif

#if AO_CAN_FIFOS_TX_2 > 12

{
        .cond                   = ao_can_cond_not_full_2 + 12
},

#endif

#if AO_CAN_FIFOS_TX_2 > 13

{
        .cond                   = ao_can_cond_not_full_2 + 13
},

#endif

#if AO_CAN_FIFOS_TX_2 > 14

{
        .cond                   = ao_can_cond_not_full_2 + 14
},

#endif

#if AO_CAN_FIFOS_TX_2 > 15

{
        .cond                   = ao_can_cond_not_full_2 + 15
},

#endif

#if AO_CAN_FIFOS_TX_2 > 16

{
        .cond                   = ao_can_cond_not_full_2 + 16
},

#endif

#if AO_CAN_FIFOS_TX_2 > 17

{
        .cond                   = ao_can_cond_not_full_2 + 17
},

#endif

#if AO_CAN_FIFOS_TX_2 > 18

{
        .cond                   = ao_can_cond_not_full_2 + 18
},

#endif

#if AO_CAN_FIFOS_TX_2 > 19

{
        .cond                   = ao_can_cond_not_full_2 + 19
},

#endif

#if AO_CAN_FIFOS_TX_2 > 20

{
        .cond                   = ao_can_cond_not_full_2 + 20
},

#endif

#if AO_CAN_FIFOS_TX_2 > 21

{
        .cond                   = ao_can_cond_not_full_2 + 21
},

#endif

#if AO_CAN_FIFOS_TX_2 > 22

{
        .cond                   = ao_can_cond_not_full_2 + 22
},

#endif

#if AO_CAN_FIFOS_TX_2 > 23

{
        .cond                   = ao_can_cond_not_full_2 + 23
},

#endif

#if AO_CAN_FIFOS_TX_2 > 24

{
        .cond                   = ao_can_cond_not_full_2 + 24
},

#endif

#if AO_CAN_FIFOS_TX_2 > 25

{
        .cond                   = ao_can_cond_not_full_2 + 25
},

#endif

#if AO_CAN_FIFOS_TX_2 > 26

{
        .cond                   = ao_can_cond_not_full_2 + 26
},

#endif

#if AO_CAN_FIFOS_TX_2 > 27

{
        .cond                   = ao_can_cond_not_full_2 + 27
},

#endif

#if AO_CAN_FIFOS_TX_2 > 28

{
        .cond                   = ao_can_cond_not_full_2 + 28
},

#endif

#if AO_CAN_FIFOS_TX_2 > 29

{
        .cond                   = ao_can_cond_not_full_2 + 29
},

#endif

#if AO_CAN_FIFOS_TX_2 > 30

{
        .cond                   = ao_can_cond_not_full_2 + 30
},

#endif

#if AO_CAN_FIFOS_TX_2 > 31

{
        .cond                   = ao_can_cond_not_full_2 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

static  ao_sem_t                ao_can_sem_2;

static  ao_sem_take_t           ao_can_sem_take_2 =
{
        .count                  = 1,

        .sem                    = &ao_can_sem_2
};

// ----------------------------------------------------------------------------

        ao_task_t               ao_can_task_2 =
{
        .proc                   = ao_can_task_proc_2
};

// ----------------------------------------------------------------------------

static  uint32_t    volatile    ao_can_var_mode_2 = 0;

static  bool        volatile    ao_can_var_started_2 = false;

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_change_store_2 [2] =
{
        &ao_can_cond_changed_wait_2.async,

        &ao_can_sem_take_2.async
};

static  ao_async_any_t          ao_can_async_change_2 =
{
        .store                  = ao_can_async_change_store_2,

        .count                  = 2
};

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_send_store_2   [AO_CAN_FIFOS_TX_2 * 2] =
{

#if AO_CAN_FIFOS_TX_2 >  0

#if AO_CAN_FIFOS_TX_2 >  0

        &ao_can_cond_not_full_wait_2[ 0].async,

        &ao_can_out_2               [ 0].async,

#endif

