tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_TX_2 >  1

        &ao_can_cond_not_full_wait_2[ 1].async,

        &ao_can_out_2               [ 1].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  2

        &ao_can_cond_not_full_wait_2[ 2].async,

        &ao_can_out_2               [ 2].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  3

        &ao_can_cond_not_full_wait_2[ 3].async,

        &ao_can_out_2               [ 3].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  4

        &ao_can_cond_not_full_wait_2[ 4].async,

        &ao_can_out_2               [ 4].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  5

        &ao_can_cond_not_full_wait_2[ 5].async,

        &ao_can_out_2               [ 5].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  6

        &ao_can_cond_not_full_wait_2[ 6].async,

        &ao_can_out_2               [ 6].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  7

        &ao_can_cond_not_full_wait_2[ 7].async,

        &ao_can_out_2               [ 7].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  8

        &ao_can_cond_not_full_wait_2[ 8].async,

        &ao_can_out_2               [ 8].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  9

        &ao_can_cond_not_full_wait_2[ 9].async,

        &ao_can_out_2               [ 9].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 10

        &ao_can_cond_not_full_wait_2[10].async,

        &ao_can_out_2               [10].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 11

        &ao_can_cond_not_full_wait_2[11].async,

        &ao_can_out_2               [11].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 12

        &ao_can_cond_not_full_wait_2[12].async,

        &ao_can_out_2               [12].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 13

        &ao_can_cond_not_full_wait_2[13].async,

        &ao_can_out_2               [13].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 14

        &ao_can_cond_not_full_wait_2[14].async,

        &ao_can_out_2               [14].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 15

        &ao_can_cond_not_full_wait_2[15].async,

        &ao_can_out_2               [15].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 16

        &ao_can_cond_not_full_wait_2[16].async,

        &ao_can_out_2               [16].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 17

        &ao_can_cond_not_full_wait_2[17].async,

        &ao_can_out_2               [17].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 18

        &ao_can_cond_not_full_wait_2[18].async,

        &ao_can_out_2               [18].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 19

        &ao_can_cond_not_full_wait_2[19].async,

        &ao_can_out_2               [19].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 20

        &ao_can_cond_not_full_wait_2[20].async,

        &ao_can_out_2               [20].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 21

        &ao_can_cond_not_full_wait_2[21].async,

        &ao_can_out_2               [21].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 22

        &ao_can_cond_not_full_wait_2[22].async,

        &ao_can_out_2               [22].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 23

        &ao_can_cond_not_full_wait_2[23].async,

        &ao_can_out_2               [23].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 24

        &ao_can_cond_not_full_wait_2[24].async,

        &ao_can_out_2               [24].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 25

        &ao_can_cond_not_full_wait_2[25].async,

        &ao_can_out_2               [25].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 26

        &ao_can_cond_not_full_wait_2[26].async,

        &ao_can_out_2               [26].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 27

        &ao_can_cond_not_full_wait_2[27].async,

        &ao_can_out_2               [27].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 28

        &ao_can_cond_not_full_wait_2[28].async,

        &ao_can_out_2               [28].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 29

        &ao_can_cond_not_full_wait_2[29].async,

        &ao_can_out_2               [29].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 30

        &ao_can_cond_not_full_wait_2[30].async,

        &ao_can_out_2               [30].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 31

        &ao_can_cond_not_full_wait_2[31].async,

        &ao_can_out_2               [31].async,

#endif

#endif

};

static  ao_async_all_t          ao_can_async_send_2         [AO_CAN_FIFOS_TX_2] =
{

#if AO_CAN_FIFOS_TX_2 >  0

#if AO_CAN_FIFOS_TX_2 >  0

{
        .store                  = ao_can_async_send_store_2 +  0 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  1

{
        .store                  = ao_can_async_send_store_2 +  1 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  2

{
        .store                  = ao_can_async_send_store_2 +  2 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  3

{
        .store                  = ao_can_async_send_store_2 +  3 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  4

{
        .store                  = ao_can_async_send_store_2 +  4 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  5

{
        .store                  = ao_can_async_send_store_2 +  5 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  6

{
        .store                  = ao_can_async_send_store_2 +  6 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  7

{
        .store                  = ao_can_async_send_store_2 +  7 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  8

{
        .store                  = ao_can_async_send_store_2 +  8 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 >  9

{
        .store                  = ao_can_async_send_store_2 +  9 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 10

{
        .store                  = ao_can_async_send_store_2 + 10 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 11

{
        .store                  = ao_can_async_send_store_2 + 11 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 12

{
        .store                  = ao_can_async_send_store_2 + 12 * 2,

        .count                  = 2
},

#endif

