tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_TX_2 > 13

{
        .store                  = ao_can_async_send_store_2 + 13 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 14

{
        .store                  = ao_can_async_send_store_2 + 14 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 15

{
        .store                  = ao_can_async_send_store_2 + 15 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 16

{
        .store                  = ao_can_async_send_store_2 + 16 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 17

{
        .store                  = ao_can_async_send_store_2 + 17 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 18

{
        .store                  = ao_can_async_send_store_2 + 18 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 19

{
        .store                  = ao_can_async_send_store_2 + 19 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 20

{
        .store                  = ao_can_async_send_store_2 + 20 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 21

{
        .store                  = ao_can_async_send_store_2 + 21 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 22

{
        .store                  = ao_can_async_send_store_2 + 22 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 23

{
        .store                  = ao_can_async_send_store_2 + 23 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 24

{
        .store                  = ao_can_async_send_store_2 + 24 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 25

{
        .store                  = ao_can_async_send_store_2 + 25 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 26

{
        .store                  = ao_can_async_send_store_2 + 26 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 27

{
        .store                  = ao_can_async_send_store_2 + 27 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 28

{
        .store                  = ao_can_async_send_store_2 + 28 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 29

{
        .store                  = ao_can_async_send_store_2 + 29 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 30

{
        .store                  = ao_can_async_send_store_2 + 30 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_2 > 31

{
        .store                  = ao_can_async_send_store_2 + 31 * 2,

        .count                  = 2
},

#endif

#endif

};

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_started_store_2[AO_CAN_FIFOS_TX_2 + 2] =
{
        &ao_can_cond_change_wait_2.async,

        &ao_can_sem_take_2.async,

#if AO_CAN_FIFOS_TX_2 >  0

#if AO_CAN_FIFOS_TX_2 >  0

        &ao_can_async_send_2[ 0].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  1

        &ao_can_async_send_2[ 1].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  2

        &ao_can_async_send_2[ 2].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  3

        &ao_can_async_send_2[ 3].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  4

        &ao_can_async_send_2[ 4].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  5

        &ao_can_async_send_2[ 5].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  6

        &ao_can_async_send_2[ 6].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  7

        &ao_can_async_send_2[ 7].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  8

        &ao_can_async_send_2[ 8].async,

#endif

#if AO_CAN_FIFOS_TX_2 >  9

        &ao_can_async_send_2[ 9].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 10

        &ao_can_async_send_2[10].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 11

        &ao_can_async_send_2[11].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 12

        &ao_can_async_send_2[12].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 13

        &ao_can_async_send_2[13].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 14

        &ao_can_async_send_2[14].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 15

        &ao_can_async_send_2[15].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 16

        &ao_can_async_send_2[16].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 17

        &ao_can_async_send_2[17].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 18

        &ao_can_async_send_2[18].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 19

        &ao_can_async_send_2[19].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 20

        &ao_can_async_send_2[20].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 21

        &ao_can_async_send_2[21].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 22

        &ao_can_async_send_2[22].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 23

        &ao_can_async_send_2[23].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 24

        &ao_can_async_send_2[24].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 25

        &ao_can_async_send_2[25].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 26

        &ao_can_async_send_2[26].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 27

        &ao_can_async_send_2[27].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 28

        &ao_can_async_send_2[28].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 29

        &ao_can_async_send_2[29].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 30

        &ao_can_async_send_2[30].async,

#endif

#if AO_CAN_FIFOS_TX_2 > 31

        &ao_can_async_send_2[31].async,

#endif

#endif

};

static  ao_async_any_t          ao_can_async_started_2 =
{
        .store                  = ao_can_async_started_store_2,

        .count                  = 2 + AO_CAN_FIFOS_TX_2
};

// ----------------------------------------------------------------------------

void ao_can_change_2(uint32_t mode)
{
    // Assert.

    ao_assert
    (
        mode == 0 ||
        mode == 2 ||
        mode == 3 ||
        mode == 4 ||
        mode == 7
    );


    // Variables.

    ao_can_reg_t * const reg = ao_can_reg_2();


    // Ready.

    while (reg->con.bits.opmod != mode)
    {
        // Request.

        ao_cond_clear(&ao_can_cond_changed_2);

