tinko26/ao/sys/ao_sys_xc32_pic32.c
        reg->con.bits.reqop = mode;


        // Await.

        ao_cond_wait_begin( &ao_can_cond_changed_wait_2);

        ao_sem_take_begin(  &ao_can_sem_take_2);

        ao_await_any_forever
        (
            &ao_can_async_change_2
        );

        ao_sem_take_end(    &ao_can_sem_take_2);

        ao_cond_wait_end(   &ao_can_cond_changed_wait_2);


        // Stop.

        if (ao_can_sem_take_2.result)
        {
            ao_can_var_started_2 = false;
        }
    }
}

// ----------------------------------------------------------------------------

__attribute__ ((weak))
void ao_can_config_2()
{
    ao_can_config_baud_2();

    ao_can_config_fifos_2();

    ao_can_config_filter_masks_2();

    ao_can_config_filters_2();
}

__attribute__ ((weak))
void ao_can_config_baud_2()
{
    // Variables.

    ao_can_baud_t x;


    // Ready.

    x.f                 = AO_CAN_BAUD_2;

    x.f_pbclk           = AO_SYS_CLOCK_CAN2;

    x.sample            = AO_CAN_BAUD_SAMPLE_2;

    x.sample_thrice     = AO_CAN_BAUD_SAMPLE_THRICE_2;

    x.sjw               = AO_CAN_BAUD_SJW_2;

    x.wake_up_filter    = AO_CAN_BAUD_WAKE_UP_FILTER_2;

    ao_can_baud(&x);

    ao_assert(x.result);

    C2CFG = x.cfg;
}

__attribute__ ((weak))
void ao_can_config_fifos_2()
{
    // Fifo base address.

    C2FIFOBA = KVA_TO_PA(ao_can_buffers_2);


    // Fifos.

#if AO_CAN_FIFOS_2 > 0

#if AO_CAN_FIFOS_2 > 0

    C2FIFOCON0bits.FSIZE = AO_CAN_BUFFERS_2_0 - 1;

#endif

#if AO_CAN_FIFOS_2 > 1

    C2FIFOCON1bits.FSIZE = AO_CAN_BUFFERS_2_1 - 1;

#endif

#if AO_CAN_FIFOS_2 > 2

    C2FIFOCON2bits.FSIZE = AO_CAN_BUFFERS_2_2 - 1;

#endif

#if AO_CAN_FIFOS_2 > 3

    C2FIFOCON3bits.FSIZE = AO_CAN_BUFFERS_2_3 - 1;

#endif

#if AO_CAN_FIFOS_2 > 4

    C2FIFOCON4bits.FSIZE = AO_CAN_BUFFERS_2_4 - 1;

#endif

#if AO_CAN_FIFOS_2 > 5

    C2FIFOCON5bits.FSIZE = AO_CAN_BUFFERS_2_5 - 1;

#endif

#if AO_CAN_FIFOS_2 > 6

    C2FIFOCON6bits.FSIZE = AO_CAN_BUFFERS_2_6 - 1;

#endif

#if AO_CAN_FIFOS_2 > 7

    C2FIFOCON7bits.FSIZE = AO_CAN_BUFFERS_2_7 - 1;

#endif

#if AO_CAN_FIFOS_2 > 8

    C2FIFOCON8bits.FSIZE = AO_CAN_BUFFERS_2_8 - 1;

#endif

#if AO_CAN_FIFOS_2 > 9

    C2FIFOCON9bits.FSIZE = AO_CAN_BUFFERS_2_9 - 1;

#endif

#if AO_CAN_FIFOS_2 > 10

    C2FIFOCON10bits.FSIZE = AO_CAN_BUFFERS_2_10 - 1;

#endif

#if AO_CAN_FIFOS_2 > 11

    C2FIFOCON11bits.FSIZE = AO_CAN_BUFFERS_2_11 - 1;

#endif

#if AO_CAN_FIFOS_2 > 12

    C2FIFOCON12bits.FSIZE = AO_CAN_BUFFERS_2_12 - 1;

#endif

#if AO_CAN_FIFOS_2 > 13

    C2FIFOCON13bits.FSIZE = AO_CAN_BUFFERS_2_13 - 1;

#endif

#if AO_CAN_FIFOS_2 > 14

    C2FIFOCON14bits.FSIZE = AO_CAN_BUFFERS_2_14 - 1;

#endif

#if AO_CAN_FIFOS_2 > 15

    C2FIFOCON15bits.FSIZE = AO_CAN_BUFFERS_2_15 - 1;

#endif

#if AO_CAN_FIFOS_2 > 16

    C2FIFOCON16bits.FSIZE = AO_CAN_BUFFERS_2_16 - 1;

#endif

#if AO_CAN_FIFOS_2 > 17

    C2FIFOCON17bits.FSIZE = AO_CAN_BUFFERS_2_17 - 1;

#endif

#if AO_CAN_FIFOS_2 > 18

    C2FIFOCON18bits.FSIZE = AO_CAN_BUFFERS_2_18 - 1;

#endif

#if AO_CAN_FIFOS_2 > 19

    C2FIFOCON19bits.FSIZE = AO_CAN_BUFFERS_2_19 - 1;

#endif

#if AO_CAN_FIFOS_2 > 20

    C2FIFOCON20bits.FSIZE = AO_CAN_BUFFERS_2_20 - 1;

#endif

#if AO_CAN_FIFOS_2 > 21

    C2FIFOCON21bits.FSIZE = AO_CAN_BUFFERS_2_21 - 1;

#endif

#if AO_CAN_FIFOS_2 > 22

    C2FIFOCON22bits.FSIZE = AO_CAN_BUFFERS_2_22 - 1;

#endif

#if AO_CAN_FIFOS_2 > 23

    C2FIFOCON23bits.FSIZE = AO_CAN_BUFFERS_2_23 - 1;

#endif

#if AO_CAN_FIFOS_2 > 24

    C2FIFOCON24bits.FSIZE = AO_CAN_BUFFERS_2_24 - 1;

#endif

#if AO_CAN_FIFOS_2 > 25

    C2FIFOCON25bits.FSIZE = AO_CAN_BUFFERS_2_25 - 1;

#endif

#if AO_CAN_FIFOS_2 > 26

    C2FIFOCON26bits.FSIZE = AO_CAN_BUFFERS_2_26 - 1;

#endif

#if AO_CAN_FIFOS_2 > 27

    C2FIFOCON27bits.FSIZE = AO_CAN_BUFFERS_2_27 - 1;

#endif

#if AO_CAN_FIFOS_2 > 28

    C2FIFOCON28bits.FSIZE = AO_CAN_BUFFERS_2_28 - 1;

#endif

#if AO_CAN_FIFOS_2 > 29

    C2FIFOCON29bits.FSIZE = AO_CAN_BUFFERS_2_29 - 1;

#endif

#if AO_CAN_FIFOS_2 > 30

    C2FIFOCON30bits.FSIZE = AO_CAN_BUFFERS_2_30 - 1;

#endif

#if AO_CAN_FIFOS_2 > 31

    C2FIFOCON31bits.FSIZE = AO_CAN_BUFFERS_2_31 - 1;

#endif

#endif

}

__attribute__ ((weak))
void ao_can_config_filter_masks_2()
{
    C2RXM0bits.EID  = AO_CAN_FILTER_MASK_EID_2_0;
    C2RXM0bits.MIDE = AO_CAN_FILTER_MASK_IDE_2_0;
    C2RXM0bits.SID  = AO_CAN_FILTER_MASK_SID_2_0;

    C2RXM1bits.EID  = AO_CAN_FILTER_MASK_EID_2_1;
    C2RXM1bits.MIDE = AO_CAN_FILTER_MASK_IDE_2_1;
    C2RXM1bits.SID  = AO_CAN_FILTER_MASK_SID_2_1;

    C2RXM2bits.EID  = AO_CAN_FILTER_MASK_EID_2_2;
    C2RXM2bits.MIDE = AO_CAN_FILTER_MASK_IDE_2_2;
    C2RXM2bits.SID  = AO_CAN_FILTER_MASK_SID_2_2;

    C2RXM3bits.EID  = AO_CAN_FILTER_MASK_EID_2_3;
    C2RXM3bits.MIDE = AO_CAN_FILTER_MASK_IDE_2_3;
    C2RXM3bits.SID  = AO_CAN_FILTER_MASK_SID_2_3;
}

__attribute__ ((weak))
void ao_can_config_filters_2()
{

#if AO_CAN_FILTER_ENABLE_2_0

    C2RXF0bits.EID          = AO_CAN_FILTER_EID_2_0;
    C2RXF0bits.EXID         = AO_CAN_FILTER_IDE_2_0;
    C2RXF0bits.SID          = AO_CAN_FILTER_SID_2_0;
    C2FLTCON0bits.FSEL0     = AO_CAN_FILTER_FIFO_2_0;
    C2FLTCON0bits.MSEL0     = AO_CAN_FILTER_MASK_2_0;
    C2FLTCON0bits.FLTEN0    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_1

    C2RXF1bits.EID          = AO_CAN_FILTER_EID_2_1;
    C2RXF1bits.EXID         = AO_CAN_FILTER_IDE_2_1;
    C2RXF1bits.SID          = AO_CAN_FILTER_SID_2_1;
    C2FLTCON0bits.FSEL1     = AO_CAN_FILTER_FIFO_2_1;
    C2FLTCON0bits.MSEL1     = AO_CAN_FILTER_MASK_2_1;
    C2FLTCON0bits.FLTEN1    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_2

    C2RXF2bits.EID          = AO_CAN_FILTER_EID_2_2;
    C2RXF2bits.EXID         = AO_CAN_FILTER_IDE_2_2;
    C2RXF2bits.SID          = AO_CAN_FILTER_SID_2_2;
    C2FLTCON0bits.FSEL2     = AO_CAN_FILTER_FIFO_2_2;
    C2FLTCON0bits.MSEL2     = AO_CAN_FILTER_MASK_2_2;
    C2FLTCON0bits.FLTEN2    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_3

    C2RXF3bits.EID          = AO_CAN_FILTER_EID_2_3;
    C2RXF3bits.EXID         = AO_CAN_FILTER_IDE_2_3;
    C2RXF3bits.SID          = AO_CAN_FILTER_SID_2_3;
    C2FLTCON0bits.FSEL3     = AO_CAN_FILTER_FIFO_2_3;
    C2FLTCON0bits.MSEL3     = AO_CAN_FILTER_MASK_2_3;
    C2FLTCON0bits.FLTEN3    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_4

    C2RXF4bits.EID          = AO_CAN_FILTER_EID_2_4;
    C2RXF4bits.EXID         = AO_CAN_FILTER_IDE_2_4;
    C2RXF4bits.SID          = AO_CAN_FILTER_SID_2_4;
    C2FLTCON1bits.FSEL4     = AO_CAN_FILTER_FIFO_2_4;
    C2FLTCON1bits.MSEL4     = AO_CAN_FILTER_MASK_2_4;
    C2FLTCON1bits.FLTEN4    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_5

    C2RXF5bits.EID          = AO_CAN_FILTER_EID_2_5;
    C2RXF5bits.EXID         = AO_CAN_FILTER_IDE_2_5;
    C2RXF5bits.SID          = AO_CAN_FILTER_SID_2_5;
    C2FLTCON1bits.FSEL5     = AO_CAN_FILTER_FIFO_2_5;
    C2FLTCON1bits.MSEL5     = AO_CAN_FILTER_MASK_2_5;
    C2FLTCON1bits.FLTEN5    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_6

    C2RXF6bits.EID          = AO_CAN_FILTER_EID_2_6;
    C2RXF6bits.EXID         = AO_CAN_FILTER_IDE_2_6;
    C2RXF6bits.SID          = AO_CAN_FILTER_SID_2_6;
    C2FLTCON1bits.FSEL6     = AO_CAN_FILTER_FIFO_2_6;
    C2FLTCON1bits.MSEL6     = AO_CAN_FILTER_MASK_2_6;
    C2FLTCON1bits.FLTEN6    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_7

    C2RXF7bits.EID          = AO_CAN_FILTER_EID_2_7;
    C2RXF7bits.EXID         = AO_CAN_FILTER_IDE_2_7;
    C2RXF7bits.SID          = AO_CAN_FILTER_SID_2_7;
    C2FLTCON1bits.FSEL7     = AO_CAN_FILTER_FIFO_2_7;
    C2FLTCON1bits.MSEL7     = AO_CAN_FILTER_MASK_2_7;
    C2FLTCON1bits.FLTEN7    = 1;

#endif

