tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_ENABLE_2_8

    C2RXF8bits.EID          = AO_CAN_FILTER_EID_2_8;
    C2RXF8bits.EXID         = AO_CAN_FILTER_IDE_2_8;
    C2RXF8bits.SID          = AO_CAN_FILTER_SID_2_8;
    C2FLTCON2bits.FSEL8     = AO_CAN_FILTER_FIFO_2_8;
    C2FLTCON2bits.MSEL8     = AO_CAN_FILTER_MASK_2_8;
    C2FLTCON2bits.FLTEN8    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_9

    C2RXF9bits.EID          = AO_CAN_FILTER_EID_2_9;
    C2RXF9bits.EXID         = AO_CAN_FILTER_IDE_2_9;
    C2RXF9bits.SID          = AO_CAN_FILTER_SID_2_9;
    C2FLTCON2bits.FSEL9     = AO_CAN_FILTER_FIFO_2_9;
    C2FLTCON2bits.MSEL9     = AO_CAN_FILTER_MASK_2_9;
    C2FLTCON2bits.FLTEN9    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_10

    C2RXF10bits.EID         = AO_CAN_FILTER_EID_2_10;
    C2RXF10bits.EXID        = AO_CAN_FILTER_IDE_2_10;
    C2RXF10bits.SID         = AO_CAN_FILTER_SID_2_10;
    C2FLTCON2bits.FSEL10    = AO_CAN_FILTER_FIFO_2_10;
    C2FLTCON2bits.MSEL10    = AO_CAN_FILTER_MASK_2_10;
    C2FLTCON2bits.FLTEN10   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_11

    C2RXF11bits.EID         = AO_CAN_FILTER_EID_2_11;
    C2RXF11bits.EXID        = AO_CAN_FILTER_IDE_2_11;
    C2RXF11bits.SID         = AO_CAN_FILTER_SID_2_11;
    C2FLTCON2bits.FSEL11    = AO_CAN_FILTER_FIFO_2_11;
    C2FLTCON2bits.MSEL11    = AO_CAN_FILTER_MASK_2_11;
    C2FLTCON2bits.FLTEN11   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_12

    C2RXF12bits.EID         = AO_CAN_FILTER_EID_2_12;
    C2RXF12bits.EXID        = AO_CAN_FILTER_IDE_2_12;
    C2RXF12bits.SID         = AO_CAN_FILTER_SID_2_12;
    C2FLTCON3bits.FSEL12    = AO_CAN_FILTER_FIFO_2_12;
    C2FLTCON3bits.MSEL12    = AO_CAN_FILTER_MASK_2_12;
    C2FLTCON3bits.FLTEN12   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_13

    C2RXF13bits.EID         = AO_CAN_FILTER_EID_2_13;
    C2RXF13bits.EXID        = AO_CAN_FILTER_IDE_2_13;
    C2RXF13bits.SID         = AO_CAN_FILTER_SID_2_13;
    C2FLTCON3bits.FSEL13    = AO_CAN_FILTER_FIFO_2_13;
    C2FLTCON3bits.MSEL13    = AO_CAN_FILTER_MASK_2_13;
    C2FLTCON3bits.FLTEN13   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_14

    C2RXF14bits.EID         = AO_CAN_FILTER_EID_2_14;
    C2RXF14bits.EXID        = AO_CAN_FILTER_IDE_2_14;
    C2RXF14bits.SID         = AO_CAN_FILTER_SID_2_14;
    C2FLTCON3bits.FSEL14    = AO_CAN_FILTER_FIFO_2_14;
    C2FLTCON3bits.MSEL14    = AO_CAN_FILTER_MASK_2_14;
    C2FLTCON3bits.FLTEN14   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_15

    C2RXF15bits.EID         = AO_CAN_FILTER_EID_2_15;
    C2RXF15bits.EXID        = AO_CAN_FILTER_IDE_2_15;
    C2RXF15bits.SID         = AO_CAN_FILTER_SID_2_15;
    C2FLTCON3bits.FSEL15    = AO_CAN_FILTER_FIFO_2_15;
    C2FLTCON3bits.MSEL15    = AO_CAN_FILTER_MASK_2_15;
    C2FLTCON3bits.FLTEN15   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_16

    C2RXF16bits.EID         = AO_CAN_FILTER_EID_2_16;
    C2RXF16bits.EXID        = AO_CAN_FILTER_IDE_2_16;
    C2RXF16bits.SID         = AO_CAN_FILTER_SID_2_16;
    C2FLTCON4bits.FSEL16    = AO_CAN_FILTER_FIFO_2_16;
    C2FLTCON4bits.MSEL16    = AO_CAN_FILTER_MASK_2_16;
    C2FLTCON4bits.FLTEN16   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_17

    C2RXF17bits.EID         = AO_CAN_FILTER_EID_2_17;
    C2RXF17bits.EXID        = AO_CAN_FILTER_IDE_2_17;
    C2RXF17bits.SID         = AO_CAN_FILTER_SID_2_17;
    C2FLTCON4bits.FSEL17    = AO_CAN_FILTER_FIFO_2_17;
    C2FLTCON4bits.MSEL17    = AO_CAN_FILTER_MASK_2_17;
    C2FLTCON4bits.FLTEN17   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_18

    C2RXF18bits.EID         = AO_CAN_FILTER_EID_2_18;
    C2RXF18bits.EXID        = AO_CAN_FILTER_IDE_2_18;
    C2RXF18bits.SID         = AO_CAN_FILTER_SID_2_18;
    C2FLTCON4bits.FSEL18    = AO_CAN_FILTER_FIFO_2_18;
    C2FLTCON4bits.MSEL18    = AO_CAN_FILTER_MASK_2_18;
    C2FLTCON4bits.FLTEN18   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_19

    C2RXF19bits.EID         = AO_CAN_FILTER_EID_2_19;
    C2RXF19bits.EXID        = AO_CAN_FILTER_IDE_2_19;
    C2RXF19bits.SID         = AO_CAN_FILTER_SID_2_19;
    C2FLTCON4bits.FSEL19    = AO_CAN_FILTER_FIFO_2_19;
    C2FLTCON4bits.MSEL19    = AO_CAN_FILTER_MASK_2_19;
    C2FLTCON4bits.FLTEN19   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_20

    C2RXF20bits.EID         = AO_CAN_FILTER_EID_2_20;
    C2RXF20bits.EXID        = AO_CAN_FILTER_IDE_2_20;
    C2RXF20bits.SID         = AO_CAN_FILTER_SID_2_20;
    C2FLTCON5bits.FSEL20    = AO_CAN_FILTER_FIFO_2_20;
    C2FLTCON5bits.MSEL20    = AO_CAN_FILTER_MASK_2_20;
    C2FLTCON5bits.FLTEN20   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_21

    C2RXF21bits.EID         = AO_CAN_FILTER_EID_2_21;
    C2RXF21bits.EXID        = AO_CAN_FILTER_IDE_2_21;
    C2RXF21bits.SID         = AO_CAN_FILTER_SID_2_21;
    C2FLTCON5bits.FSEL21    = AO_CAN_FILTER_FIFO_2_21;
    C2FLTCON5bits.MSEL21    = AO_CAN_FILTER_MASK_2_21;
    C2FLTCON5bits.FLTEN21   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_22

    C2RXF22bits.EID         = AO_CAN_FILTER_EID_2_22;
    C2RXF22bits.EXID        = AO_CAN_FILTER_IDE_2_22;
    C2RXF22bits.SID         = AO_CAN_FILTER_SID_2_22;
    C2FLTCON5bits.FSEL22    = AO_CAN_FILTER_FIFO_2_22;
    C2FLTCON5bits.MSEL22    = AO_CAN_FILTER_MASK_2_22;
    C2FLTCON5bits.FLTEN22   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_23

    C2RXF23bits.EID         = AO_CAN_FILTER_EID_2_23;
    C2RXF23bits.EXID        = AO_CAN_FILTER_IDE_2_23;
    C2RXF23bits.SID         = AO_CAN_FILTER_SID_2_23;
    C2FLTCON5bits.FSEL23    = AO_CAN_FILTER_FIFO_2_23;
    C2FLTCON5bits.MSEL23    = AO_CAN_FILTER_MASK_2_23;
    C2FLTCON5bits.FLTEN23   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_24

    C2RXF24bits.EID         = AO_CAN_FILTER_EID_2_24;
    C2RXF24bits.EXID        = AO_CAN_FILTER_IDE_2_24;
    C2RXF24bits.SID         = AO_CAN_FILTER_SID_2_24;
    C2FLTCON6bits.FSEL24    = AO_CAN_FILTER_FIFO_2_24;
    C2FLTCON6bits.MSEL24    = AO_CAN_FILTER_MASK_2_24;
    C2FLTCON6bits.FLTEN24   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_25

    C2RXF25bits.EID         = AO_CAN_FILTER_EID_2_25;
    C2RXF25bits.EXID        = AO_CAN_FILTER_IDE_2_25;
    C2RXF25bits.SID         = AO_CAN_FILTER_SID_2_25;
    C2FLTCON6bits.FSEL25    = AO_CAN_FILTER_FIFO_2_25;
    C2FLTCON6bits.MSEL25    = AO_CAN_FILTER_MASK_2_25;
    C2FLTCON6bits.FLTEN25   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_26

    C2RXF26bits.EID         = AO_CAN_FILTER_EID_2_26;
    C2RXF26bits.EXID        = AO_CAN_FILTER_IDE_2_26;
    C2RXF26bits.SID         = AO_CAN_FILTER_SID_2_26;
    C2FLTCON6bits.FSEL26    = AO_CAN_FILTER_FIFO_2_26;
    C2FLTCON6bits.MSEL26    = AO_CAN_FILTER_MASK_2_26;
    C2FLTCON6bits.FLTEN26   = 1;

#endif

