tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_ENABLE_2_27

    C2RXF27bits.EID         = AO_CAN_FILTER_EID_2_27;
    C2RXF27bits.EXID        = AO_CAN_FILTER_IDE_2_27;
    C2RXF27bits.SID         = AO_CAN_FILTER_SID_2_27;
    C2FLTCON6bits.FSEL27    = AO_CAN_FILTER_FIFO_2_27;
    C2FLTCON6bits.MSEL27    = AO_CAN_FILTER_MASK_2_27;
    C2FLTCON6bits.FLTEN27   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_28

    C2RXF28bits.EID         = AO_CAN_FILTER_EID_2_28;
    C2RXF28bits.EXID        = AO_CAN_FILTER_IDE_2_28;
    C2RXF28bits.SID         = AO_CAN_FILTER_SID_2_28;
    C2FLTCON7bits.FSEL28    = AO_CAN_FILTER_FIFO_2_28;
    C2FLTCON7bits.MSEL28    = AO_CAN_FILTER_MASK_2_28;
    C2FLTCON7bits.FLTEN28   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_29

    C2RXF29bits.EID         = AO_CAN_FILTER_EID_2_29;
    C2RXF29bits.EXID        = AO_CAN_FILTER_IDE_2_29;
    C2RXF29bits.SID         = AO_CAN_FILTER_SID_2_29;
    C2FLTCON7bits.FSEL29    = AO_CAN_FILTER_FIFO_2_29;
    C2FLTCON7bits.MSEL29    = AO_CAN_FILTER_MASK_2_29;
    C2FLTCON7bits.FLTEN29   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_30

    C2RXF30bits.EID         = AO_CAN_FILTER_EID_2_30;
    C2RXF30bits.EXID        = AO_CAN_FILTER_IDE_2_30;
    C2RXF30bits.SID         = AO_CAN_FILTER_SID_2_30;
    C2FLTCON7bits.FSEL30    = AO_CAN_FILTER_FIFO_2_30;
    C2FLTCON7bits.MSEL30    = AO_CAN_FILTER_MASK_2_30;
    C2FLTCON7bits.FLTEN30   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_2_31

    C2RXF31bits.EID         = AO_CAN_FILTER_EID_2_31;
    C2RXF31bits.EXID        = AO_CAN_FILTER_IDE_2_31;
    C2RXF31bits.SID         = AO_CAN_FILTER_SID_2_31;
    C2FLTCON7bits.FSEL31    = AO_CAN_FILTER_FIFO_2_31;
    C2FLTCON7bits.MSEL31    = AO_CAN_FILTER_MASK_2_31;
    C2FLTCON7bits.FLTEN31   = 1;

#endif

}

// ----------------------------------------------------------------------------

void ao_can_ir_2()
{
    // Variables.

    ao_can_t *          c1;
    ao_can_t *          c2;

    ao_can_fifo_flags_t f;

    uint32_t            i1;
    uint32_t            i2;

    uint32_t            m;

    uint32_t            r;

    ao_can_reg_t *      reg = ao_can_reg_2();

    ao_time_t           t;


    // Ready.

    do
    {
        t = ao_now();

        i1 = reg->vec.bits.icode;

        ao_ir_can2_reply();

        switch (i1)
        {

#if AO_CAN_INVALID_2

            case 0b1001000:

                // Invalid message received.

                ao_can_invalid_2(&ao_can_invalid_info_2);

                reg->intx.bits.ivrif = 0;

                break;

#endif

                // Mode changed.

            case 0b1000111:

#if AO_CAN_MODE_2

                ao_can_mode_2(&ao_can_mode_info_2);

#endif

                ao_cond_set(&ao_can_cond_changed_2);

                reg->intx.bits.modif = 0;

                break;

#if AO_CAN_TIMER_2

            case 0b1000110:

                // Timer.

                ao_can_timer_2(&ao_can_timer_info_2);

                reg->intx.bits.ctmrif = 0;

                break;

#endif

            case 0b1000101:
            case 0b1000100:

                // System error.

#if AO_CAN_SYSTEM_2

                ao_can_system_info_2.flags = (ao_can_system_flags_t) i1;

                ao_can_system_2(&ao_can_system_info_2);

#endif

                reg->con.bits.on = 0;

                while (reg->con.bits.canbusy) { }

                reg->con.bits.on = 1;

                break;

#if AO_CAN_RBOV_2

            case 0b1000011:

                // Receive buffer overrun.

                r = reg->rxovf.reg;

                m = (AO_CAN_FIFOS_TX_2 == 32) ? UINT32_MAX : (1 << AO_CAN_FIFOS_TX_2) - 1;

#if AO_CAN_RXOF_2

                f = (ao_can_fifo_flags_t) (r & ~m);

                if (f != AO_CAN_FIFO_FLAGS_NONE)
                {
                    ao_can_overflow_info_2.fifos = f;

                    ao_can_overflow_info_2.fifos_rx = (ao_can_fifo_flags_t) ((uint32_t) f >> AO_CAN_FIFOS_TX_2);

                    ao_can_overflow_2(&ao_can_overflow_info_2);
                }

#endif

#if AO_CAN_TXUF_2

                f = (ao_can_fifo_flags_t) (r & m);

                if (f != AO_CAN_FIFO_FLAGS_NONE)
                {
                    ao_can_underflow_info_2.fifos = f;

                    ao_can_underflow_info_2.fifos_tx = f;

                    ao_can_underflow_2(&ao_can_underflow_info_2);
                }

#endif

                // DS61154.

                // Section 34.12.1.17.

                // Clearing all the CxFIFOINTn.RXOVFLIF bits will automatically
                // clear the CxINT.RBOVIF bit.

                while (r)
                {
                    i2 = ao_ffs(r);

                    m = 1 << i2;

                    r = r & ~m;

                    reg->fifo[i2].intx.bits.rxovflif = 0;
                }

                // DS61154.

                // Section 34.12.1.17: The CxINT.RBOVIF bit is not directly clearable.

                // Section 34.3.4    : The CxINT.RBOVIF bit is writable.

                reg->intx.bits.rbovif = 0;

                break;

#endif

#if AO_CAN_WAKE_UP_2

            case 0b1000010:

                // Wake up.

                ao_can_wake_up_2(&ao_can_wake_up_info_2);

                reg->intx.bits.wakif = 0;

                break;

#endif

#if AO_CAN_BUS_2

            case 0b1000001:

                // CAN bus error.

                ao_can_bus_info_2.receive_error_counter = reg->trec.bits.rerrcnt;

                if (reg->trec.bits.rxbp)
                {
                    ao_can_bus_info_2.receive_error_state = AO_CAN_BUS_PASSIVE;
                }

                else if (reg->trec.bits.rxwarn)
                {
                    ao_can_bus_info_2.receive_error_state = AO_CAN_BUS_ACTIVE_WARNING;
                }

                else
                {
                    ao_can_bus_info_2.receive_error_state = AO_CAN_BUS_ACTIVE;
                }

                ao_can_bus_info_2.transmit_error_counter = reg->trec.bits.terrcnt;

                if (reg->trec.bits.txbo)
                {
                    ao_can_bus_info_2.transmit_error_state = AO_CAN_BUS_OFF;
                }

                else if (reg->trec.bits.txbp)
                {
                    ao_can_bus_info_2.transmit_error_state = AO_CAN_BUS_PASSIVE;
                }

