tinko26/ao/sys/ao_sys_xc32_pic32.c
                else if (reg->trec.bits.txwarn)
                {
                    ao_can_bus_info_2.transmit_error_state = AO_CAN_BUS_ACTIVE_WARNING;
                }

                else
                {
                    ao_can_bus_info_2.transmit_error_state = AO_CAN_BUS_ACTIVE;
                }

                ao_can_bus_2(&ao_can_bus_info_2);

                reg->intx.bits.cerrif = 0;

                break;

#endif

            case 0b1000000:

                // No interrupt.

                break;

#if AO_CAN_RX_2

#if AO_CAN_FIFOS_2 > 31  &&  AO_CAN_FIFOS_TX_2 <= 31

            case 31:

#endif

#if AO_CAN_FIFOS_2 > 30  &&  AO_CAN_FIFOS_TX_2 <= 30

            case 30:

#endif

#if AO_CAN_FIFOS_2 > 29  &&  AO_CAN_FIFOS_TX_2 <= 29

            case 29:

#endif

#if AO_CAN_FIFOS_2 > 28  &&  AO_CAN_FIFOS_TX_2 <= 28

            case 28:

#endif

#if AO_CAN_FIFOS_2 > 27  &&  AO_CAN_FIFOS_TX_2 <= 27

            case 27:

#endif

#if AO_CAN_FIFOS_2 > 26  &&  AO_CAN_FIFOS_TX_2 <= 26

            case 26:

#endif

#if AO_CAN_FIFOS_2 > 25  &&  AO_CAN_FIFOS_TX_2 <= 25

            case 25:

#endif

#if AO_CAN_FIFOS_2 > 24  &&  AO_CAN_FIFOS_TX_2 <= 24

            case 24:

#endif

#if AO_CAN_FIFOS_2 > 23  &&  AO_CAN_FIFOS_TX_2 <= 23

            case 23:

#endif

#if AO_CAN_FIFOS_2 > 22  &&  AO_CAN_FIFOS_TX_2 <= 22

            case 22:

#endif

#if AO_CAN_FIFOS_2 > 21  &&  AO_CAN_FIFOS_TX_2 <= 21

            case 21:

#endif

#if AO_CAN_FIFOS_2 > 20  &&  AO_CAN_FIFOS_TX_2 <= 20

            case 20:

#endif

#if AO_CAN_FIFOS_2 > 19  &&  AO_CAN_FIFOS_TX_2 <= 19

            case 19:

#endif

#if AO_CAN_FIFOS_2 > 18  &&  AO_CAN_FIFOS_TX_2 <= 18

            case 18:

#endif

#if AO_CAN_FIFOS_2 > 17  &&  AO_CAN_FIFOS_TX_2 <= 17

            case 17:

#endif

#if AO_CAN_FIFOS_2 > 16  &&  AO_CAN_FIFOS_TX_2 <= 16

            case 16:

#endif

#if AO_CAN_FIFOS_2 > 15  &&  AO_CAN_FIFOS_TX_2 <= 15

            case 15:

#endif

#if AO_CAN_FIFOS_2 > 14  &&  AO_CAN_FIFOS_TX_2 <= 14

            case 14:

#endif

#if AO_CAN_FIFOS_2 > 13  &&  AO_CAN_FIFOS_TX_2 <= 13

            case 13:

#endif

#if AO_CAN_FIFOS_2 > 12  &&  AO_CAN_FIFOS_TX_2 <= 12

            case 12:

#endif

#if AO_CAN_FIFOS_2 > 11  &&  AO_CAN_FIFOS_TX_2 <= 11

            case 11:

#endif

#if AO_CAN_FIFOS_2 > 10  &&  AO_CAN_FIFOS_TX_2 <= 10

            case 10:

#endif

#if AO_CAN_FIFOS_2 >  9  &&  AO_CAN_FIFOS_TX_2 <=  9

            case  9:

#endif

#if AO_CAN_FIFOS_2 >  8  &&  AO_CAN_FIFOS_TX_2 <=  8

            case  8:

#endif

#if AO_CAN_FIFOS_2 >  7  &&  AO_CAN_FIFOS_TX_2 <=  7

            case  7:

#endif

#if AO_CAN_FIFOS_2 >  6  &&  AO_CAN_FIFOS_TX_2 <=  6

            case  6:

#endif

#if AO_CAN_FIFOS_2 >  5  &&  AO_CAN_FIFOS_TX_2 <=  5

            case  5:

#endif

#if AO_CAN_FIFOS_2 >  4  &&  AO_CAN_FIFOS_TX_2 <=  4

            case  4:

#endif

#if AO_CAN_FIFOS_2 >  3  &&  AO_CAN_FIFOS_TX_2 <=  3

            case  3:

#endif

#if AO_CAN_FIFOS_2 >  2  &&  AO_CAN_FIFOS_TX_2 <=  2

            case  2:

#endif

#if AO_CAN_FIFOS_2 >  1  &&  AO_CAN_FIFOS_TX_2 <=  1

            case  1:

#endif

#if AO_CAN_FIFOS_2 >  0  &&  AO_CAN_FIFOS_TX_2 <=  0

            case  0:

#endif

                c1 = PA_TO_KVA1(reg->fifo[i1].ua.reg);

                c2 = ao_can_in_can_2 + i1 - AO_CAN_FIFOS_TX_2;

                if (reg->fifo[i1].con.bits.donly)
                {
                    c2->cmsgsid = 0;

                    c2->cmsgeid = 0;

                    c2->data = *((uint64_t *) c1);
                }

                else
                {
                    *c2 = *c1;
                }

                if (!c2->ide && c2->srr)
                {
                    c2->rtr = 1;
                }

                ao_send_obj_try(ao_can_in_2 + i1 - AO_CAN_FIFOS_TX_2);

                // DS80000480.

                // The CxFIFOCONn.FRESET bit and the CxFIFOCONn.UINC
                // bit are not settable through a normal Special
                // Function Register (SFR) write.

                // Use the SET register operations to change the state
                // of these bits.

                reg->fifo[i1].con.set = _C2FIFOCON0_UINC_MASK;

                break;

#endif

#if AO_CAN_TX_2

#if AO_CAN_FIFOS_2 > 31  &&  AO_CAN_FIFOS_TX_2 > 31

            case 31:

#endif

#if AO_CAN_FIFOS_2 > 30  &&  AO_CAN_FIFOS_TX_2 > 30

            case 30:

#endif

#if AO_CAN_FIFOS_2 > 29  &&  AO_CAN_FIFOS_TX_2 > 29

            case 29:

#endif

#if AO_CAN_FIFOS_2 > 28  &&  AO_CAN_FIFOS_TX_2 > 28

            case 28:

#endif

#if AO_CAN_FIFOS_2 > 27  &&  AO_CAN_FIFOS_TX_2 > 27

            case 27:

#endif

#if AO_CAN_FIFOS_2 > 26  &&  AO_CAN_FIFOS_TX_2 > 26

            case 26:

#endif

#if AO_CAN_FIFOS_2 > 25  &&  AO_CAN_FIFOS_TX_2 > 25

            case 25:

#endif

#if AO_CAN_FIFOS_2 > 24  &&  AO_CAN_FIFOS_TX_2 > 24

            case 24:

#endif

#if AO_CAN_FIFOS_2 > 23  &&  AO_CAN_FIFOS_TX_2 > 23

            case 23:

#endif

#if AO_CAN_FIFOS_2 > 22  &&  AO_CAN_FIFOS_TX_2 > 22

            case 22:

#endif

#if AO_CAN_FIFOS_2 > 21  &&  AO_CAN_FIFOS_TX_2 > 21

            case 21:

#endif

#if AO_CAN_FIFOS_2 > 20  &&  AO_CAN_FIFOS_TX_2 > 20

            case 20:

#endif

#if AO_CAN_FIFOS_2 > 19  &&  AO_CAN_FIFOS_TX_2 > 19

            case 19:

#endif

#if AO_CAN_FIFOS_2 > 18  &&  AO_CAN_FIFOS_TX_2 > 18

            case 18:

#endif

#if AO_CAN_FIFOS_2 > 17  &&  AO_CAN_FIFOS_TX_2 > 17

            case 17:

#endif

#if AO_CAN_FIFOS_2 > 16  &&  AO_CAN_FIFOS_TX_2 > 16

            case 16:

#endif

#if AO_CAN_FIFOS_2 > 15  &&  AO_CAN_FIFOS_TX_2 > 15

            case 15:

#endif

#if AO_CAN_FIFOS_2 > 14  &&  AO_CAN_FIFOS_TX_2 > 14

            case 14:

#endif

#if AO_CAN_FIFOS_2 > 13  &&  AO_CAN_FIFOS_TX_2 > 13

            case 13:

#endif

#if AO_CAN_FIFOS_2 > 12  &&  AO_CAN_FIFOS_TX_2 > 12

            case 12:

#endif

#if AO_CAN_FIFOS_2 > 11  &&  AO_CAN_FIFOS_TX_2 > 11

            case 11:

#endif

#if AO_CAN_FIFOS_2 > 10  &&  AO_CAN_FIFOS_TX_2 > 10

            case 10:

#endif

#if AO_CAN_FIFOS_2 >  9  &&  AO_CAN_FIFOS_TX_2 >  9

