tinko26/ao/sys/ao_sys_xc32_pic32.c
            case  9:

#endif

#if AO_CAN_FIFOS_2 >  8  &&  AO_CAN_FIFOS_TX_2 >  8

            case  8:

#endif

#if AO_CAN_FIFOS_2 >  7  &&  AO_CAN_FIFOS_TX_2 >  7

            case  7:

#endif

#if AO_CAN_FIFOS_2 >  6  &&  AO_CAN_FIFOS_TX_2 >  6

            case  6:

#endif

#if AO_CAN_FIFOS_2 >  5  &&  AO_CAN_FIFOS_TX_2 >  5

            case  5:

#endif

#if AO_CAN_FIFOS_2 >  4  &&  AO_CAN_FIFOS_TX_2 >  4

            case  4:

#endif

#if AO_CAN_FIFOS_2 >  3  &&  AO_CAN_FIFOS_TX_2 >  3

            case  3:

#endif

#if AO_CAN_FIFOS_2 >  2  &&  AO_CAN_FIFOS_TX_2 >  2

            case  2:

#endif

#if AO_CAN_FIFOS_2 >  1  &&  AO_CAN_FIFOS_TX_2 >  1

            case  1:

#endif

#if AO_CAN_FIFOS_2 >  0  &&  AO_CAN_FIFOS_TX_2 >  0

            case  0:

#endif

                // Fifo.

#if AO_CAN_TXST_2

                if
                (
                    reg->fifo[i1].intx.bits.txemptyie &&
                    reg->fifo[i1].intx.bits.txemptyif
                )
                {
                    ao_can_sent_info_2.fifo = i1;

                    ao_can_sent_info_2.fifo_tx = i1;

                    ao_can_sent_2(&ao_can_sent_info_2);

                    reg->fifo[i1].intx.bits.txemptyie = 0;
                }

                if
                (
                    reg->fifo[i1].intx.bits.txnfullie &&
                    reg->fifo[i1].intx.bits.txnfullif
                )
                {

#endif

                    ao_cond_set(ao_can_cond_not_full_2 + i1);

                    reg->fifo[i1].intx.bits.txnfullie = 0;

#if AO_CAN_TXST_2

                }

#endif

                break;

#endif

            default:

                // This really should not have happend.

                ao_assert(false);

                break;
        }
    }
    while (i1 != 0b1000000);
}

// ----------------------------------------------------------------------------

void ao_can_listen_all_2()
{
    ao_can_var_mode_2 = 7;

    ao_cond_set(&ao_can_cond_change_2);
}

void ao_can_listen_only_2()
{
    ao_can_var_mode_2 = 3;

    ao_cond_set(&ao_can_cond_change_2);
}

void ao_can_loopback_2()
{
    ao_can_var_mode_2 = 2;

    ao_cond_set(&ao_can_cond_change_2);
}

void ao_can_normal_2()
{
    ao_can_var_mode_2 = 0;

    ao_cond_set(&ao_can_cond_change_2);
}

// ----------------------------------------------------------------------------

void ao_can_start_2()
{
    ao_task_start(&ao_can_task_2);
}

void ao_can_started_2()
{
    // Variables.

#if AO_CAN_TX_2

    ao_can_t *      c1;
    ao_can_t *      c2;

    size_t          i;

    ao_can_reg_t *  reg = ao_can_reg_2();

#endif


    // Ready.

    while (ao_can_var_started_2)
    {
        // Await begin.

        ao_cond_wait_begin(     &ao_can_cond_change_wait_2);

        ao_sem_take_begin(      &ao_can_sem_take_2);

#if AO_CAN_TX_2

        for (i = 0; i < AO_CAN_FIFOS_TX_2; i++)
        {
            ao_cond_wait_begin( &ao_can_cond_not_full_wait_2[i]);

            ao_recv_obj_begin(  &ao_can_out_2               [i]);

            ao_async_all_begin( &ao_can_async_send_2        [i]);
        }

#endif


        // Await.

        ao_await_any_forever(   &ao_can_async_started_2);


        // Await end.

#if AO_CAN_TX_2

        for (i = 0; i < AO_CAN_FIFOS_TX_2; i++)
        {
            ao_async_all_end(   &ao_can_async_send_2        [i]);

            ao_recv_obj_end(    &ao_can_out_2               [i]);

            ao_cond_wait_end(   &ao_can_cond_not_full_wait_2[i]);
        }

#endif

        ao_sem_take_end(        &ao_can_sem_take_2);

        ao_cond_wait_end(       &ao_can_cond_change_wait_2);


        // Stop.

        if (ao_can_sem_take_2.result)
        {
            ao_can_var_started_2 = false;
        }


        // Change.

        else if (ao_can_cond_change_wait_2.result)
        {
            ao_cond_clear(&ao_can_cond_change_2);

            ao_can_change_2(ao_can_var_mode_2);
        }


        // Out.

#if AO_CAN_TX_2

        else
        {
            for (i = 0; i < AO_CAN_FIFOS_TX_2; i++)
            {
                if
                (
                    ao_can_cond_not_full_wait_2 [i].result &&
                    ao_can_out_2                [i].result
                )
                {
                    c2 = ao_can_out_can_2 + i;

                    c1 = (ao_can_t *) PA_TO_KVA1(reg->fifo[i].ua.reg);

                    *c1 = *c2;


                    // DS61154.

                    // Section 34.7.1.

                    // Format of Transmit Message Buffer.

                    // Unused bits should be clear.

                    // RB0 and RB1 bits must be clear.

                    c1->cmsgeid &= 0x3FFFFE0F;
                    c1->cmsgsid &= 0x000007FF;


                    // In case of an extended message format,
                    // the SRR bit should be set.

                    if (c1->ide)
                    {
                        c1->srr = 1;
                    }


                    // DS80000480.

                    // The CxFIFOCONn.FRESET bit and the CxFIFOCONn.UINC bit
                    // are not settable through a normal Special Function
                    // Register (SFR) write.

                    // Use the SET register operations to change the state of
                    // these bits.

                    reg->fifo[i].con.set = _C2FIFOCON0_UINC_MASK;


#if AO_CAN_TXST_2

                    reg->fifo[i].intx.bits.txemptyie = 1;

#endif

                    if (reg->fifo[i].con.bits.rtren == 0)
                    {
                        if (reg->fifo[i].intx.bits.txnfullif == 0)
                        {
                            ao_cond_clear(ao_can_cond_not_full_2 + i);

                            reg->fifo[i].intx.bits.txnfullie = 1;
                        }

                        reg->fifo[i].con.set = _C2FIFOCON0_TXREQ_MASK;
                    }
                }
            }
        }

#endif

    }
}

void ao_can_starting_2()
{
    // Variables.

    uint32_t mode;


    // Ready.

    ao_can_var_started_2 = true;

