tinko26/ao/sys/ao_sys_xc32_pic32.c
    ao_cond_clear(&ao_can_cond_change_2);

    mode = ao_can_var_mode_2;

    ao_assert
    (
        mode == 0 ||
        mode == 2 ||
        mode == 3 ||
        mode == 7
    );

    ao_can_change_2(mode);
}

void ao_can_stop_2()
{
    ao_sem_give(&ao_can_sem_2, 1);
}

void ao_can_stopping_2()
{
    ao_can_change_2(4);
}

// ----------------------------------------------------------------------------

void ao_can_task_proc_2(void * x)
{
    // Variables.

    size_t          i;

    ao_can_reg_t *  reg = ao_can_reg_2();

    (void)          x;


    // Ready.

    while (1)
    {
        // On.

        reg->con.bits.on = 1;

        ao_assert(reg->con.bits.opmod == 4);


        // Configuration.

        ao_can_config_2();


        // Interrupts layer 3.

#if AO_CAN_RX_2

        for (i = AO_CAN_FIFOS_TX_2; i < AO_CAN_FIFOS_TX_2 + AO_CAN_FIFOS_RX_2; i++)
        {
            reg->fifo[i].con.bits.txen = 0;

            reg->fifo[i].intx.bits.rxnemptyie = 1;

#if AO_CAN_RXOF_2

            reg->fifo[i].intx.bits.rxovflie = 1;

#endif

        }

#endif

#if AO_CAN_TX_2

        for (i = 0; i < AO_CAN_FIFOS_TX_2; i++)
        {
            reg->fifo[i].con.bits.txen = 1;

            if (reg->fifo[i].con.bits.rtren)
            {

#if AO_CAN_TXUF_2

                reg->fifo[i].intx.bits.rxovflie = 1;

#endif

                ao_cond_set(&ao_can_cond_not_full_2[i]);
            }

            else
            {
                if (reg->fifo[i].intx.bits.txnfullif == 0)
                {
                    reg->fifo[i].intx.bits.txnfullie = 1;
                }

                else
                {
                    ao_cond_set(&ao_can_cond_not_full_2[i]);
                }
            }

#if AO_CAN_TXST_2

            if (reg->fifo[i].intx.bits.txemptyif) { }

            else
            {
                reg->fifo[i].intx.bits.txemptyie = 1;
            }

#endif

        }

#endif


        // Interrupts layer 2.

        reg->intx.bits.modie = 1;
        reg->intx.bits.serrie = 1;

#if AO_CAN_BUS_2

        reg->intx.bits.cerrie = 1;

#endif

#if AO_CAN_INVALID_2

        reg->intx.bits.ivrie = 1;

#endif

#if AO_CAN_RBOV_2

        reg->intx.bits.rbovie = 1;

#endif

#if AO_CAN_RX_2

        reg->intx.bits.rbie = 1;

#endif

#if AO_CAN_TIMER_2

        reg->intx.bits.ctmrie = 1;

#endif

#if AO_CAN_TX_2

        reg->intx.bits.tbie = 1;

#endif

#if AO_CAN_WAKE_UP_2

        reg->intx.bits.wakie = 1;

#endif


        // Interrupts layer 1.

        ao_ir_can2_enable();


        // Start.

        ao_can_starting_2();

        ao_can_started_2();


        // Stop.

        ao_can_stopping_2();


        // Interrupts layer 1.

        ao_ir_can2_disable();


        // Interrupts layer 2.

        reg->intx.bits.modie = 0;
        reg->intx.bits.serrie = 0;

#if AO_CAN_BUS_2

        reg->intx.bits.cerrie = 0;

#endif

#if AO_CAN_INVALID_2

        reg->intx.bits.ivrie = 0;

#endif

#if AO_CAN_RBOV_2

        reg->intx.bits.rbovie = 0;

#endif

#if AO_CAN_RX_2

        reg->intx.bits.rbie = 0;

#endif

#if AO_CAN_TIMER_2

        reg->intx.bits.ctmrie = 0;

#endif

#if AO_CAN_TX_2

        reg->intx.bits.tbie = 0;

#endif

#if AO_CAN_WAKE_UP_2

        reg->intx.bits.wakie = 0;

#endif


        // Interrupts layer 3.

#if AO_CAN_TX_2

        for (i = 0; i < AO_CAN_FIFOS_TX_2; i++)
        {

            reg->fifo[i].intx.bits.txnfullie = 0;

#if AO_CAN_TXUF_2

            reg->fifo[i].intx.bits.rxovflie = 0;

#endif

#if AO_CAN_TXST_2

            reg->fifo[i].intx.bits.txemptyie = 0;

#endif

        }

#endif

#if AO_CAN_RX_2

        for (i = AO_CAN_FIFOS_TX_2; i < AO_CAN_FIFOS_TX_2 + AO_CAN_FIFOS_RX_2; i++)
        {
            reg->fifo[i].intx.bits.rxnemptyie = 0;

#if AO_CAN_RXOF_2

            reg->fifo[i].intx.bits.rxovflie = 0;

#endif

        }

#endif


        // Off.

        reg->con.bits.on = 0;

        while (reg->con.bits.canbusy) { }


        // Task.

        ao_stop();
    }
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_CAN_3 && AO_CAN_3

// ----------------------------------------------------------------------------

#if AO_CAN_BAUD_3 < AO_CAN_BAUD_MIN_3

#error Invalid configuration.

#endif

#if AO_CAN_BAUD_3 > AO_CAN_BAUD_MAX_3

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_3 > 0  && AO_CAN_BUFFERS_3_0  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 1  && AO_CAN_BUFFERS_3_1  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 2  && AO_CAN_BUFFERS_3_2  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 3  && AO_CAN_BUFFERS_3_3  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 4  && AO_CAN_BUFFERS_3_4  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 5  && AO_CAN_BUFFERS_3_5  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 6  && AO_CAN_BUFFERS_3_6  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 7  && AO_CAN_BUFFERS_3_7  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 8  && AO_CAN_BUFFERS_3_8  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 9  && AO_CAN_BUFFERS_3_9  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 10 && AO_CAN_BUFFERS_3_10 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 11 && AO_CAN_BUFFERS_3_11 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 12 && AO_CAN_BUFFERS_3_12 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 13 && AO_CAN_BUFFERS_3_13 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 14 && AO_CAN_BUFFERS_3_14 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 15 && AO_CAN_BUFFERS_3_15 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 16 && AO_CAN_BUFFERS_3_16 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 17 && AO_CAN_BUFFERS_3_17 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 18 && AO_CAN_BUFFERS_3_18 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 19 && AO_CAN_BUFFERS_3_19 < 1

#error Invalid configuration.

#endif

