tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_3 > 20 && AO_CAN_BUFFERS_3_20 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 21 && AO_CAN_BUFFERS_3_21 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 22 && AO_CAN_BUFFERS_3_22 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 23 && AO_CAN_BUFFERS_3_23 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 24 && AO_CAN_BUFFERS_3_24 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 25 && AO_CAN_BUFFERS_3_25 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 26 && AO_CAN_BUFFERS_3_26 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 27 && AO_CAN_BUFFERS_3_27 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 28 && AO_CAN_BUFFERS_3_28 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 29 && AO_CAN_BUFFERS_3_29 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 30 && AO_CAN_BUFFERS_3_30 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 31 && AO_CAN_BUFFERS_3_31 < 1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_3 > 0  && AO_CAN_BUFFERS_3_0  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 1  && AO_CAN_BUFFERS_3_1  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 2  && AO_CAN_BUFFERS_3_2  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 3  && AO_CAN_BUFFERS_3_3  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 4  && AO_CAN_BUFFERS_3_4  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 5  && AO_CAN_BUFFERS_3_5  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 6  && AO_CAN_BUFFERS_3_6  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 7  && AO_CAN_BUFFERS_3_7  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 8  && AO_CAN_BUFFERS_3_8  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 9  && AO_CAN_BUFFERS_3_9  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 10 && AO_CAN_BUFFERS_3_10 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 11 && AO_CAN_BUFFERS_3_11 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 12 && AO_CAN_BUFFERS_3_12 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 13 && AO_CAN_BUFFERS_3_13 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 14 && AO_CAN_BUFFERS_3_14 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 15 && AO_CAN_BUFFERS_3_15 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 16 && AO_CAN_BUFFERS_3_16 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 17 && AO_CAN_BUFFERS_3_17 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 18 && AO_CAN_BUFFERS_3_18 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 19 && AO_CAN_BUFFERS_3_19 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 20 && AO_CAN_BUFFERS_3_20 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 21 && AO_CAN_BUFFERS_3_21 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 22 && AO_CAN_BUFFERS_3_22 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 23 && AO_CAN_BUFFERS_3_23 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 24 && AO_CAN_BUFFERS_3_24 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 25 && AO_CAN_BUFFERS_3_25 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 26 && AO_CAN_BUFFERS_3_26 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 27 && AO_CAN_BUFFERS_3_27 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 28 && AO_CAN_BUFFERS_3_28 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 29 && AO_CAN_BUFFERS_3_29 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 30 && AO_CAN_BUFFERS_3_30 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_3 > 31 && AO_CAN_BUFFERS_3_31 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_3 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_RX_3 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_TX_3 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_EID_3_0  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_1  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_2  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_3  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_4  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_5  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_6  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_7  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_8  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_9  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_10 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_11 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_12 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_13 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_14 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_15 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_16 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_17 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_18 > 0x3FFFF

#error Invalid configuration.

#endif

