tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_EID_3_19 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_20 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_21 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_22 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_23 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_24 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_25 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_26 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_27 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_28 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_29 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_30 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_3_31 > 0x3FFFF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_FIFO_3_0  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_1  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_2  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_3  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_4  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_5  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_6  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_7  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_8  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_9  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_10 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_11 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_12 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_13 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_14 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_15 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_16 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_17 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_18 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_19 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_20 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_21 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_22 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_23 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_24 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_25 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_26 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_27 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_28 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_29 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_30 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_3_31 > 31

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_IDE_3_0  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_1  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_2  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_3  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_4  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_5  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_6  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_7  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_8  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_9  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_10 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_11 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_12 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_13 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_14 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_15 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_16 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_17 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_18 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_19 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_20 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_21 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_22 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_23 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_24 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_25 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_26 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_27 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_28 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_29 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_30 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_3_31 > 0x1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_3_0  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_1  > 3

#error Invalid configuration.

#endif

