tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_MASK_3_2  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_3  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_4  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_5  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_6  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_7  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_8  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_9  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_10 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_11 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_12 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_13 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_14 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_15 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_16 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_17 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_18 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_19 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_20 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_21 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_22 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_23 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_24 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_25 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_26 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_27 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_28 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_29 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_30 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_3_31 > 3

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_EID_3_0 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_3_1 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_3_2 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_3_3 > 0x3FFFF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_IDE_3_0 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_3_1 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_3_2 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_3_3 > 0x1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_SID_3_0 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_3_1 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_3_2 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_3_3 > 0x7FF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_SID_3_0  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_1  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_2  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_3  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_4  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_5  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_6  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_7  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_8  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_9  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_10 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_11 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_12 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_13 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_14 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_15 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_16 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_17 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_18 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_19 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_20 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_21 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_22 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_23 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_24 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_25 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_26 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_27 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_28 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_29 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_30 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_3_31 > 0x7FF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#define AO_CAN_RXOF_3           ((AO_CAN_RX_3)      && (AO_CAN_OVERFLOW_3))

#define AO_CAN_TXST_3           ((AO_CAN_TX_3)      && (AO_CAN_SENT_3))

#define AO_CAN_TXUF_3           ((AO_CAN_TX_3)      && (AO_CAN_UNDERFLOW_3))

// ----------------------------------------------------------------------------

