tinko26/ao/sys/ao_sys_xc32_pic32.c
#define AO_CAN_RBOV_3           ((AO_CAN_RXOF_3)    || (AO_CAN_TXUF_3))

// ----------------------------------------------------------------------------

static  void                    ao_can_change_3(    uint32_t mode);

static  void                    ao_can_started_3();

static  void                    ao_can_starting_3();

static  void                    ao_can_stopping_3();

static  void                    ao_can_task_proc_3( void * x);

// ----------------------------------------------------------------------------

        ao_can_t                ao_can_buffers_3    [AO_CAN_BUFFERS_3];

// ----------------------------------------------------------------------------

#if AO_CAN_BUS_3

static  ao_can_bus_info_t       ao_can_bus_info_3;

#endif

#if AO_CAN_INVALID_3

static  ao_can_invalid_info_t   ao_can_invalid_info_3;

#endif

#if AO_CAN_MODE_3

static  ao_can_mode_info_t      ao_can_mode_info_3;

#endif

#if AO_CAN_RXOF_3

static  ao_can_overflow_info_t  ao_can_overflow_info_3;

#endif

#if AO_CAN_SYSTEM_3

static  ao_can_system_info_t    ao_can_system_info_3;

#endif

#if AO_CAN_TIMER_3

static  ao_can_timer_info_t     ao_can_timer_info_3;

#endif

#if AO_CAN_TXST_3

static  ao_can_sent_info_t      ao_can_sent_info_3;

#endif

#if AO_CAN_TXUF_3

static  ao_can_underflow_info_t ao_can_underflow_info_3;

#endif

#if AO_CAN_WAKE_UP_3

static  ao_can_wake_up_info_t   ao_can_wake_up_info_3;

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_RX_3

// ----------------------------------------------------------------------------

static  ao_can_t                ao_can_in_can_3     [AO_CAN_FIFOS_RX_3];

        ao_send_obj_t           ao_can_in_3         [AO_CAN_FIFOS_RX_3] =
{

#if AO_CAN_FIFOS_RX_3 >  0

#if AO_CAN_FIFOS_RX_3 >  0

{
        .ptr                    = ao_can_in_can_3 +  0
},

#endif

#if AO_CAN_FIFOS_RX_3 >  1

{
        .ptr                    = ao_can_in_can_3 +  1
},

#endif

#if AO_CAN_FIFOS_RX_3 >  2

{
        .ptr                    = ao_can_in_can_3 +  2
},

#endif

#if AO_CAN_FIFOS_RX_3 >  3

{
        .ptr                    = ao_can_in_can_3 +  3
},

#endif

#if AO_CAN_FIFOS_RX_3 >  4

{
        .ptr                    = ao_can_in_can_3 +  4
},

#endif

#if AO_CAN_FIFOS_RX_3 >  5

{
        .ptr                    = ao_can_in_can_3 +  5
},

#endif

#if AO_CAN_FIFOS_RX_3 >  6

{
        .ptr                    = ao_can_in_can_3 +  6
},

#endif

#if AO_CAN_FIFOS_RX_3 >  7

{
        .ptr                    = ao_can_in_can_3 +  7
},

#endif

#if AO_CAN_FIFOS_RX_3 >  8

{
        .ptr                    = ao_can_in_can_3 +  8
},

#endif

#if AO_CAN_FIFOS_RX_3 >  9

{
        .ptr                    = ao_can_in_can_3 +  9
},

#endif

#if AO_CAN_FIFOS_RX_3 > 10

{
        .ptr                    = ao_can_in_can_3 + 10
},

#endif

#if AO_CAN_FIFOS_RX_3 > 11

{
        .ptr                    = ao_can_in_can_3 + 11
},

#endif

#if AO_CAN_FIFOS_RX_3 > 12

{
        .ptr                    = ao_can_in_can_3 + 12
},

#endif

#if AO_CAN_FIFOS_RX_3 > 13

{
        .ptr                    = ao_can_in_can_3 + 13
},

#endif

#if AO_CAN_FIFOS_RX_3 > 14

{
        .ptr                    = ao_can_in_can_3 + 14
},

#endif

#if AO_CAN_FIFOS_RX_3 > 15

{
        .ptr                    = ao_can_in_can_3 + 15
},

#endif

#if AO_CAN_FIFOS_RX_3 > 16

{
        .ptr                    = ao_can_in_can_3 + 16
},

#endif

#if AO_CAN_FIFOS_RX_3 > 17

{
        .ptr                    = ao_can_in_can_3 + 17
},

#endif

#if AO_CAN_FIFOS_RX_3 > 18

{
        .ptr                    = ao_can_in_can_3 + 18
},

#endif

#if AO_CAN_FIFOS_RX_3 > 19

{
        .ptr                    = ao_can_in_can_3 + 19
},

#endif

#if AO_CAN_FIFOS_RX_3 > 20

{
        .ptr                    = ao_can_in_can_3 + 20
},

#endif

#if AO_CAN_FIFOS_RX_3 > 21

{
        .ptr                    = ao_can_in_can_3 + 21
},

#endif

#if AO_CAN_FIFOS_RX_3 > 22

{
        .ptr                    = ao_can_in_can_3 + 22
},

#endif

#if AO_CAN_FIFOS_RX_3 > 23

{
        .ptr                    = ao_can_in_can_3 + 23
},

#endif

#if AO_CAN_FIFOS_RX_3 > 24

{
        .ptr                    = ao_can_in_can_3 + 24
},

#endif

#if AO_CAN_FIFOS_RX_3 > 25

{
        .ptr                    = ao_can_in_can_3 + 25
},

#endif

#if AO_CAN_FIFOS_RX_3 > 26

{
        .ptr                    = ao_can_in_can_3 + 26
},

#endif

#if AO_CAN_FIFOS_RX_3 > 27

{
        .ptr                    = ao_can_in_can_3 + 27
},

#endif

#if AO_CAN_FIFOS_RX_3 > 28

{
        .ptr                    = ao_can_in_can_3 + 28
},

#endif

#if AO_CAN_FIFOS_RX_3 > 29

{
        .ptr                    = ao_can_in_can_3 + 29
},

#endif

#if AO_CAN_FIFOS_RX_3 > 30

{
        .ptr                    = ao_can_in_can_3 + 30
},

#endif

#if AO_CAN_FIFOS_RX_3 > 31

{
        .ptr                    = ao_can_in_can_3 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

#endif

#if AO_CAN_TX_3

// ----------------------------------------------------------------------------

static  ao_can_t                ao_can_out_can_3    [AO_CAN_FIFOS_TX_3];

        ao_recv_obj_t           ao_can_out_3        [AO_CAN_FIFOS_TX_3] =
{

#if AO_CAN_FIFOS_TX_3 >  0

#if AO_CAN_FIFOS_TX_3 >  0

{
        .ptr                    = ao_can_out_can_3 +  0
},

#endif

#if AO_CAN_FIFOS_TX_3 >  1

{
        .ptr                    = ao_can_out_can_3 +  1
},

#endif

#if AO_CAN_FIFOS_TX_3 >  2

{
        .ptr                    = ao_can_out_can_3 +  2
},

#endif

#if AO_CAN_FIFOS_TX_3 >  3

{
        .ptr                    = ao_can_out_can_3 +  3
},

#endif

#if AO_CAN_FIFOS_TX_3 >  4

{
        .ptr                    = ao_can_out_can_3 +  4
},

#endif

#if AO_CAN_FIFOS_TX_3 >  5

{
        .ptr                    = ao_can_out_can_3 +  5
},

#endif

#if AO_CAN_FIFOS_TX_3 >  6

{
        .ptr                    = ao_can_out_can_3 +  6
},

#endif

#if AO_CAN_FIFOS_TX_3 >  7

{
        .ptr                    = ao_can_out_can_3 +  7
},

#endif

#if AO_CAN_FIFOS_TX_3 >  8

{
        .ptr                    = ao_can_out_can_3 +  8
},

#endif

#if AO_CAN_FIFOS_TX_3 >  9

{
        .ptr                    = ao_can_out_can_3 +  9
},

#endif

#if AO_CAN_FIFOS_TX_3 > 10

{
        .ptr                    = ao_can_out_can_3 + 10
},

#endif

#if AO_CAN_FIFOS_TX_3 > 11

{
        .ptr                    = ao_can_out_can_3 + 11
},

#endif

#if AO_CAN_FIFOS_TX_3 > 12

{
        .ptr                    = ao_can_out_can_3 + 12
},

#endif

#if AO_CAN_FIFOS_TX_3 > 13

{
        .ptr                    = ao_can_out_can_3 + 13
},

#endif

#if AO_CAN_FIFOS_TX_3 > 14

{
        .ptr                    = ao_can_out_can_3 + 14
},

#endif

