tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_TX_3 > 15

{
        .ptr                    = ao_can_out_can_3 + 15
},

#endif

#if AO_CAN_FIFOS_TX_3 > 16

{
        .ptr                    = ao_can_out_can_3 + 16
},

#endif

#if AO_CAN_FIFOS_TX_3 > 17

{
        .ptr                    = ao_can_out_can_3 + 17
},

#endif

#if AO_CAN_FIFOS_TX_3 > 18

{
        .ptr                    = ao_can_out_can_3 + 18
},

#endif

#if AO_CAN_FIFOS_TX_3 > 19

{
        .ptr                    = ao_can_out_can_3 + 19
},

#endif

#if AO_CAN_FIFOS_TX_3 > 20

{
        .ptr                    = ao_can_out_can_3 + 20
},

#endif

#if AO_CAN_FIFOS_TX_3 > 21

{
        .ptr                    = ao_can_out_can_3 + 21
},

#endif

#if AO_CAN_FIFOS_TX_3 > 22

{
        .ptr                    = ao_can_out_can_3 + 22
},

#endif

#if AO_CAN_FIFOS_TX_3 > 23

{
        .ptr                    = ao_can_out_can_3 + 23
},

#endif

#if AO_CAN_FIFOS_TX_3 > 24

{
        .ptr                    = ao_can_out_can_3 + 24
},

#endif

#if AO_CAN_FIFOS_TX_3 > 25

{
        .ptr                    = ao_can_out_can_3 + 25
},

#endif

#if AO_CAN_FIFOS_TX_3 > 26

{
        .ptr                    = ao_can_out_can_3 + 26
},

#endif

#if AO_CAN_FIFOS_TX_3 > 27

{
        .ptr                    = ao_can_out_can_3 + 27
},

#endif

#if AO_CAN_FIFOS_TX_3 > 28

{
        .ptr                    = ao_can_out_can_3 + 28
},

#endif

#if AO_CAN_FIFOS_TX_3 > 29

{
        .ptr                    = ao_can_out_can_3 + 29
},

#endif

#if AO_CAN_FIFOS_TX_3 > 30

{
        .ptr                    = ao_can_out_can_3 + 30
},

#endif

#if AO_CAN_FIFOS_TX_3 > 31

{
        .ptr                    = ao_can_out_can_3 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_change_3;

static  ao_cond_wait_t          ao_can_cond_change_wait_3 =
{
        .cond                   = &ao_can_cond_change_3
};

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_changed_3;

static  ao_cond_wait_t          ao_can_cond_changed_wait_3 =
{
        .cond                   = &ao_can_cond_changed_3
};

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_not_full_3      [AO_CAN_FIFOS_TX_3];

static  ao_cond_wait_t          ao_can_cond_not_full_wait_3 [AO_CAN_FIFOS_TX_3] =
{

#if AO_CAN_FIFOS_TX_3 >  0

#if AO_CAN_FIFOS_TX_3 >  0

{
        .cond                   = ao_can_cond_not_full_3 +  0
},

#endif

#if AO_CAN_FIFOS_TX_3 >  1

{
        .cond                   = ao_can_cond_not_full_3 +  1
},

#endif

#if AO_CAN_FIFOS_TX_3 >  2

{
        .cond                   = ao_can_cond_not_full_3 +  2
},

#endif

#if AO_CAN_FIFOS_TX_3 >  3

{
        .cond                   = ao_can_cond_not_full_3 +  3
},

#endif

#if AO_CAN_FIFOS_TX_3 >  4

{
        .cond                   = ao_can_cond_not_full_3 +  4
},

#endif

#if AO_CAN_FIFOS_TX_3 >  5

{
        .cond                   = ao_can_cond_not_full_3 +  5
},

#endif

#if AO_CAN_FIFOS_TX_3 >  6

{
        .cond                   = ao_can_cond_not_full_3 +  6
},

#endif

#if AO_CAN_FIFOS_TX_3 >  7

{
        .cond                   = ao_can_cond_not_full_3 +  7
},

#endif

#if AO_CAN_FIFOS_TX_3 >  8

{
        .cond                   = ao_can_cond_not_full_3 +  8
},

#endif

#if AO_CAN_FIFOS_TX_3 >  9

{
        .cond                   = ao_can_cond_not_full_3 +  9
},

#endif

#if AO_CAN_FIFOS_TX_3 > 10

{
        .cond                   = ao_can_cond_not_full_3 + 10
},

#endif

#if AO_CAN_FIFOS_TX_3 > 11

{
        .cond                   = ao_can_cond_not_full_3 + 11
},

#endif

#if AO_CAN_FIFOS_TX_3 > 12

{
        .cond                   = ao_can_cond_not_full_3 + 12
},

#endif

#if AO_CAN_FIFOS_TX_3 > 13

{
        .cond                   = ao_can_cond_not_full_3 + 13
},

#endif

#if AO_CAN_FIFOS_TX_3 > 14

{
        .cond                   = ao_can_cond_not_full_3 + 14
},

#endif

#if AO_CAN_FIFOS_TX_3 > 15

{
        .cond                   = ao_can_cond_not_full_3 + 15
},

#endif

#if AO_CAN_FIFOS_TX_3 > 16

{
        .cond                   = ao_can_cond_not_full_3 + 16
},

#endif

#if AO_CAN_FIFOS_TX_3 > 17

{
        .cond                   = ao_can_cond_not_full_3 + 17
},

#endif

#if AO_CAN_FIFOS_TX_3 > 18

{
        .cond                   = ao_can_cond_not_full_3 + 18
},

#endif

#if AO_CAN_FIFOS_TX_3 > 19

{
        .cond                   = ao_can_cond_not_full_3 + 19
},

#endif

#if AO_CAN_FIFOS_TX_3 > 20

{
        .cond                   = ao_can_cond_not_full_3 + 20
},

#endif

#if AO_CAN_FIFOS_TX_3 > 21

{
        .cond                   = ao_can_cond_not_full_3 + 21
},

#endif

#if AO_CAN_FIFOS_TX_3 > 22

{
        .cond                   = ao_can_cond_not_full_3 + 22
},

#endif

#if AO_CAN_FIFOS_TX_3 > 23

{
        .cond                   = ao_can_cond_not_full_3 + 23
},

#endif

#if AO_CAN_FIFOS_TX_3 > 24

{
        .cond                   = ao_can_cond_not_full_3 + 24
},

#endif

#if AO_CAN_FIFOS_TX_3 > 25

{
        .cond                   = ao_can_cond_not_full_3 + 25
},

#endif

#if AO_CAN_FIFOS_TX_3 > 26

{
        .cond                   = ao_can_cond_not_full_3 + 26
},

#endif

#if AO_CAN_FIFOS_TX_3 > 27

{
        .cond                   = ao_can_cond_not_full_3 + 27
},

#endif

#if AO_CAN_FIFOS_TX_3 > 28

{
        .cond                   = ao_can_cond_not_full_3 + 28
},

#endif

#if AO_CAN_FIFOS_TX_3 > 29

{
        .cond                   = ao_can_cond_not_full_3 + 29
},

#endif

#if AO_CAN_FIFOS_TX_3 > 30

{
        .cond                   = ao_can_cond_not_full_3 + 30
},

#endif

#if AO_CAN_FIFOS_TX_3 > 31

{
        .cond                   = ao_can_cond_not_full_3 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

static  ao_sem_t                ao_can_sem_3;

static  ao_sem_take_t           ao_can_sem_take_3 =
{
        .count                  = 1,

        .sem                    = &ao_can_sem_3
};

// ----------------------------------------------------------------------------

        ao_task_t               ao_can_task_3 =
{
        .proc                   = ao_can_task_proc_3
};

// ----------------------------------------------------------------------------

