tinko26/ao/sys/ao_sys_xc32_pic32.c
static  uint32_t    volatile    ao_can_var_mode_3 = 0;

static  bool        volatile    ao_can_var_started_3 = false;

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_change_store_3 [2] =
{
        &ao_can_cond_changed_wait_3.async,

        &ao_can_sem_take_3.async
};

static  ao_async_any_t          ao_can_async_change_3 =
{
        .store                  = ao_can_async_change_store_3,

        .count                  = 2
};

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_send_store_3   [AO_CAN_FIFOS_TX_3 * 2] =
{

#if AO_CAN_FIFOS_TX_3 >  0

#if AO_CAN_FIFOS_TX_3 >  0

        &ao_can_cond_not_full_wait_3[ 0].async,

        &ao_can_out_3               [ 0].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  1

        &ao_can_cond_not_full_wait_3[ 1].async,

        &ao_can_out_3               [ 1].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  2

        &ao_can_cond_not_full_wait_3[ 2].async,

        &ao_can_out_3               [ 2].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  3

        &ao_can_cond_not_full_wait_3[ 3].async,

        &ao_can_out_3               [ 3].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  4

        &ao_can_cond_not_full_wait_3[ 4].async,

        &ao_can_out_3               [ 4].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  5

        &ao_can_cond_not_full_wait_3[ 5].async,

        &ao_can_out_3               [ 5].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  6

        &ao_can_cond_not_full_wait_3[ 6].async,

        &ao_can_out_3               [ 6].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  7

        &ao_can_cond_not_full_wait_3[ 7].async,

        &ao_can_out_3               [ 7].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  8

        &ao_can_cond_not_full_wait_3[ 8].async,

        &ao_can_out_3               [ 8].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  9

        &ao_can_cond_not_full_wait_3[ 9].async,

        &ao_can_out_3               [ 9].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 10

        &ao_can_cond_not_full_wait_3[10].async,

        &ao_can_out_3               [10].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 11

        &ao_can_cond_not_full_wait_3[11].async,

        &ao_can_out_3               [11].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 12

        &ao_can_cond_not_full_wait_3[12].async,

        &ao_can_out_3               [12].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 13

        &ao_can_cond_not_full_wait_3[13].async,

        &ao_can_out_3               [13].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 14

        &ao_can_cond_not_full_wait_3[14].async,

        &ao_can_out_3               [14].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 15

        &ao_can_cond_not_full_wait_3[15].async,

        &ao_can_out_3               [15].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 16

        &ao_can_cond_not_full_wait_3[16].async,

        &ao_can_out_3               [16].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 17

        &ao_can_cond_not_full_wait_3[17].async,

        &ao_can_out_3               [17].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 18

        &ao_can_cond_not_full_wait_3[18].async,

        &ao_can_out_3               [18].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 19

        &ao_can_cond_not_full_wait_3[19].async,

        &ao_can_out_3               [19].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 20

        &ao_can_cond_not_full_wait_3[20].async,

        &ao_can_out_3               [20].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 21

        &ao_can_cond_not_full_wait_3[21].async,

        &ao_can_out_3               [21].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 22

        &ao_can_cond_not_full_wait_3[22].async,

        &ao_can_out_3               [22].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 23

        &ao_can_cond_not_full_wait_3[23].async,

        &ao_can_out_3               [23].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 24

        &ao_can_cond_not_full_wait_3[24].async,

        &ao_can_out_3               [24].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 25

        &ao_can_cond_not_full_wait_3[25].async,

        &ao_can_out_3               [25].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 26

        &ao_can_cond_not_full_wait_3[26].async,

        &ao_can_out_3               [26].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 27

        &ao_can_cond_not_full_wait_3[27].async,

        &ao_can_out_3               [27].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 28

        &ao_can_cond_not_full_wait_3[28].async,

        &ao_can_out_3               [28].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 29

        &ao_can_cond_not_full_wait_3[29].async,

        &ao_can_out_3               [29].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 30

        &ao_can_cond_not_full_wait_3[30].async,

        &ao_can_out_3               [30].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 31

        &ao_can_cond_not_full_wait_3[31].async,

        &ao_can_out_3               [31].async,

#endif

#endif

};

static  ao_async_all_t          ao_can_async_send_3         [AO_CAN_FIFOS_TX_3] =
{

#if AO_CAN_FIFOS_TX_3 >  0

#if AO_CAN_FIFOS_TX_3 >  0

{
        .store                  = ao_can_async_send_store_3 +  0 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 >  1

{
        .store                  = ao_can_async_send_store_3 +  1 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 >  2

{
        .store                  = ao_can_async_send_store_3 +  2 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 >  3

{
        .store                  = ao_can_async_send_store_3 +  3 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 >  4

{
        .store                  = ao_can_async_send_store_3 +  4 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 >  5

{
        .store                  = ao_can_async_send_store_3 +  5 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 >  6

{
        .store                  = ao_can_async_send_store_3 +  6 * 2,

        .count                  = 2
},

#endif

