tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_TX_3 >  7

{
        .store                  = ao_can_async_send_store_3 +  7 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 >  8

{
        .store                  = ao_can_async_send_store_3 +  8 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 >  9

{
        .store                  = ao_can_async_send_store_3 +  9 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 10

{
        .store                  = ao_can_async_send_store_3 + 10 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 11

{
        .store                  = ao_can_async_send_store_3 + 11 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 12

{
        .store                  = ao_can_async_send_store_3 + 12 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 13

{
        .store                  = ao_can_async_send_store_3 + 13 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 14

{
        .store                  = ao_can_async_send_store_3 + 14 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 15

{
        .store                  = ao_can_async_send_store_3 + 15 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 16

{
        .store                  = ao_can_async_send_store_3 + 16 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 17

{
        .store                  = ao_can_async_send_store_3 + 17 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 18

{
        .store                  = ao_can_async_send_store_3 + 18 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 19

{
        .store                  = ao_can_async_send_store_3 + 19 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 20

{
        .store                  = ao_can_async_send_store_3 + 20 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 21

{
        .store                  = ao_can_async_send_store_3 + 21 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 22

{
        .store                  = ao_can_async_send_store_3 + 22 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 23

{
        .store                  = ao_can_async_send_store_3 + 23 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 24

{
        .store                  = ao_can_async_send_store_3 + 24 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 25

{
        .store                  = ao_can_async_send_store_3 + 25 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 26

{
        .store                  = ao_can_async_send_store_3 + 26 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 27

{
        .store                  = ao_can_async_send_store_3 + 27 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 28

{
        .store                  = ao_can_async_send_store_3 + 28 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 29

{
        .store                  = ao_can_async_send_store_3 + 29 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 30

{
        .store                  = ao_can_async_send_store_3 + 30 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_3 > 31

{
        .store                  = ao_can_async_send_store_3 + 31 * 2,

        .count                  = 2
},

#endif

#endif

};

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_started_store_3[AO_CAN_FIFOS_TX_3 + 2] =
{
        &ao_can_cond_change_wait_3.async,

        &ao_can_sem_take_3.async,

#if AO_CAN_FIFOS_TX_3 >  0

#if AO_CAN_FIFOS_TX_3 >  0

        &ao_can_async_send_3[ 0].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  1

        &ao_can_async_send_3[ 1].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  2

        &ao_can_async_send_3[ 2].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  3

        &ao_can_async_send_3[ 3].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  4

        &ao_can_async_send_3[ 4].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  5

        &ao_can_async_send_3[ 5].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  6

        &ao_can_async_send_3[ 6].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  7

        &ao_can_async_send_3[ 7].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  8

        &ao_can_async_send_3[ 8].async,

#endif

#if AO_CAN_FIFOS_TX_3 >  9

        &ao_can_async_send_3[ 9].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 10

        &ao_can_async_send_3[10].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 11

        &ao_can_async_send_3[11].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 12

        &ao_can_async_send_3[12].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 13

        &ao_can_async_send_3[13].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 14

        &ao_can_async_send_3[14].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 15

        &ao_can_async_send_3[15].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 16

        &ao_can_async_send_3[16].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 17

        &ao_can_async_send_3[17].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 18

        &ao_can_async_send_3[18].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 19

        &ao_can_async_send_3[19].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 20

        &ao_can_async_send_3[20].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 21

        &ao_can_async_send_3[21].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 22

        &ao_can_async_send_3[22].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 23

        &ao_can_async_send_3[23].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 24

        &ao_can_async_send_3[24].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 25

        &ao_can_async_send_3[25].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 26

        &ao_can_async_send_3[26].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 27

