tinko26/ao/sys/ao_sys_xc32_pic32.c
        &ao_can_async_send_3[27].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 28

        &ao_can_async_send_3[28].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 29

        &ao_can_async_send_3[29].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 30

        &ao_can_async_send_3[30].async,

#endif

#if AO_CAN_FIFOS_TX_3 > 31

        &ao_can_async_send_3[31].async,

#endif

#endif

};

static  ao_async_any_t          ao_can_async_started_3 =
{
        .store                  = ao_can_async_started_store_3,

        .count                  = 2 + AO_CAN_FIFOS_TX_3
};

// ----------------------------------------------------------------------------

void ao_can_change_3(uint32_t mode)
{
    // Assert.

    ao_assert
    (
        mode == 0 ||
        mode == 2 ||
        mode == 3 ||
        mode == 4 ||
        mode == 7
    );


    // Variables.

    ao_can_reg_t * const reg = ao_can_reg_3();


    // Ready.

    while (reg->con.bits.opmod != mode)
    {
        // Request.

        ao_cond_clear(&ao_can_cond_changed_3);

        reg->con.bits.reqop = mode;


        // Await.

        ao_cond_wait_begin( &ao_can_cond_changed_wait_3);

        ao_sem_take_begin(  &ao_can_sem_take_3);

        ao_await_any_forever
        (
            &ao_can_async_change_3
        );

        ao_sem_take_end(    &ao_can_sem_take_3);

        ao_cond_wait_end(   &ao_can_cond_changed_wait_3);


        // Stop.

        if (ao_can_sem_take_3.result)
        {
            ao_can_var_started_3 = false;
        }
    }
}

// ----------------------------------------------------------------------------

__attribute__ ((weak))
void ao_can_config_3()
{
    ao_can_config_baud_3();

    ao_can_config_fifos_3();

    ao_can_config_filter_masks_3();

    ao_can_config_filters_3();
}

__attribute__ ((weak))
void ao_can_config_baud_3()
{
    // Variables.

    ao_can_baud_t x;


    // Ready.

    x.f                 = AO_CAN_BAUD_3;

    x.f_pbclk           = AO_SYS_CLOCK_CAN3;

    x.sample            = AO_CAN_BAUD_SAMPLE_3;

    x.sample_thrice     = AO_CAN_BAUD_SAMPLE_THRICE_3;

    x.sjw               = AO_CAN_BAUD_SJW_3;

    x.wake_up_filter    = AO_CAN_BAUD_WAKE_UP_FILTER_3;

    ao_can_baud(&x);

    ao_assert(x.result);

    C3CFG = x.cfg;
}

__attribute__ ((weak))
void ao_can_config_fifos_3()
{
    // Fifo base address.

    C3FIFOBA = KVA_TO_PA(ao_can_buffers_3);


    // Fifos.

#if AO_CAN_FIFOS_3 > 0

#if AO_CAN_FIFOS_3 > 0

    C3FIFOCON0bits.FSIZE = AO_CAN_BUFFERS_3_0 - 1;

#endif

#if AO_CAN_FIFOS_3 > 1

    C3FIFOCON1bits.FSIZE = AO_CAN_BUFFERS_3_1 - 1;

#endif

#if AO_CAN_FIFOS_3 > 2

    C3FIFOCON2bits.FSIZE = AO_CAN_BUFFERS_3_2 - 1;

#endif

#if AO_CAN_FIFOS_3 > 3

    C3FIFOCON3bits.FSIZE = AO_CAN_BUFFERS_3_3 - 1;

#endif

#if AO_CAN_FIFOS_3 > 4

    C3FIFOCON4bits.FSIZE = AO_CAN_BUFFERS_3_4 - 1;

#endif

#if AO_CAN_FIFOS_3 > 5

    C3FIFOCON5bits.FSIZE = AO_CAN_BUFFERS_3_5 - 1;

#endif

#if AO_CAN_FIFOS_3 > 6

    C3FIFOCON6bits.FSIZE = AO_CAN_BUFFERS_3_6 - 1;

#endif

#if AO_CAN_FIFOS_3 > 7

    C3FIFOCON7bits.FSIZE = AO_CAN_BUFFERS_3_7 - 1;

#endif

#if AO_CAN_FIFOS_3 > 8

    C3FIFOCON8bits.FSIZE = AO_CAN_BUFFERS_3_8 - 1;

#endif

#if AO_CAN_FIFOS_3 > 9

    C3FIFOCON9bits.FSIZE = AO_CAN_BUFFERS_3_9 - 1;

#endif

#if AO_CAN_FIFOS_3 > 10

    C3FIFOCON10bits.FSIZE = AO_CAN_BUFFERS_3_10 - 1;

#endif

#if AO_CAN_FIFOS_3 > 11

    C3FIFOCON11bits.FSIZE = AO_CAN_BUFFERS_3_11 - 1;

#endif

#if AO_CAN_FIFOS_3 > 12

    C3FIFOCON12bits.FSIZE = AO_CAN_BUFFERS_3_12 - 1;

#endif

#if AO_CAN_FIFOS_3 > 13

    C3FIFOCON13bits.FSIZE = AO_CAN_BUFFERS_3_13 - 1;

#endif

#if AO_CAN_FIFOS_3 > 14

    C3FIFOCON14bits.FSIZE = AO_CAN_BUFFERS_3_14 - 1;

#endif

#if AO_CAN_FIFOS_3 > 15

    C3FIFOCON15bits.FSIZE = AO_CAN_BUFFERS_3_15 - 1;

#endif

#if AO_CAN_FIFOS_3 > 16

    C3FIFOCON16bits.FSIZE = AO_CAN_BUFFERS_3_16 - 1;

#endif

#if AO_CAN_FIFOS_3 > 17

    C3FIFOCON17bits.FSIZE = AO_CAN_BUFFERS_3_17 - 1;

#endif

#if AO_CAN_FIFOS_3 > 18

    C3FIFOCON18bits.FSIZE = AO_CAN_BUFFERS_3_18 - 1;

#endif

#if AO_CAN_FIFOS_3 > 19

    C3FIFOCON19bits.FSIZE = AO_CAN_BUFFERS_3_19 - 1;

#endif

#if AO_CAN_FIFOS_3 > 20

    C3FIFOCON20bits.FSIZE = AO_CAN_BUFFERS_3_20 - 1;

#endif

#if AO_CAN_FIFOS_3 > 21

    C3FIFOCON21bits.FSIZE = AO_CAN_BUFFERS_3_21 - 1;

#endif

#if AO_CAN_FIFOS_3 > 22

    C3FIFOCON22bits.FSIZE = AO_CAN_BUFFERS_3_22 - 1;

#endif

#if AO_CAN_FIFOS_3 > 23

    C3FIFOCON23bits.FSIZE = AO_CAN_BUFFERS_3_23 - 1;

#endif

#if AO_CAN_FIFOS_3 > 24

    C3FIFOCON24bits.FSIZE = AO_CAN_BUFFERS_3_24 - 1;

#endif

#if AO_CAN_FIFOS_3 > 25

    C3FIFOCON25bits.FSIZE = AO_CAN_BUFFERS_3_25 - 1;

#endif

#if AO_CAN_FIFOS_3 > 26

    C3FIFOCON26bits.FSIZE = AO_CAN_BUFFERS_3_26 - 1;

#endif

#if AO_CAN_FIFOS_3 > 27

    C3FIFOCON27bits.FSIZE = AO_CAN_BUFFERS_3_27 - 1;

#endif

#if AO_CAN_FIFOS_3 > 28

    C3FIFOCON28bits.FSIZE = AO_CAN_BUFFERS_3_28 - 1;

#endif

#if AO_CAN_FIFOS_3 > 29

    C3FIFOCON29bits.FSIZE = AO_CAN_BUFFERS_3_29 - 1;

#endif

#if AO_CAN_FIFOS_3 > 30

    C3FIFOCON30bits.FSIZE = AO_CAN_BUFFERS_3_30 - 1;

#endif

#if AO_CAN_FIFOS_3 > 31

    C3FIFOCON31bits.FSIZE = AO_CAN_BUFFERS_3_31 - 1;

#endif

#endif

}

__attribute__ ((weak))
void ao_can_config_filter_masks_3()
{
    C3RXM0bits.EID  = AO_CAN_FILTER_MASK_EID_3_0;
    C3RXM0bits.MIDE = AO_CAN_FILTER_MASK_IDE_3_0;
    C3RXM0bits.SID  = AO_CAN_FILTER_MASK_SID_3_0;

    C3RXM1bits.EID  = AO_CAN_FILTER_MASK_EID_3_1;
    C3RXM1bits.MIDE = AO_CAN_FILTER_MASK_IDE_3_1;
    C3RXM1bits.SID  = AO_CAN_FILTER_MASK_SID_3_1;

    C3RXM2bits.EID  = AO_CAN_FILTER_MASK_EID_3_2;
    C3RXM2bits.MIDE = AO_CAN_FILTER_MASK_IDE_3_2;
    C3RXM2bits.SID  = AO_CAN_FILTER_MASK_SID_3_2;

    C3RXM3bits.EID  = AO_CAN_FILTER_MASK_EID_3_3;
    C3RXM3bits.MIDE = AO_CAN_FILTER_MASK_IDE_3_3;
    C3RXM3bits.SID  = AO_CAN_FILTER_MASK_SID_3_3;
}

__attribute__ ((weak))
void ao_can_config_filters_3()
{

#if AO_CAN_FILTER_ENABLE_3_0

    C3RXF0bits.EID          = AO_CAN_FILTER_EID_3_0;
    C3RXF0bits.EXID         = AO_CAN_FILTER_IDE_3_0;
    C3RXF0bits.SID          = AO_CAN_FILTER_SID_3_0;
    C3FLTCON0bits.FSEL0     = AO_CAN_FILTER_FIFO_3_0;
    C3FLTCON0bits.MSEL0     = AO_CAN_FILTER_MASK_3_0;
    C3FLTCON0bits.FLTEN0    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_1

    C3RXF1bits.EID          = AO_CAN_FILTER_EID_3_1;
    C3RXF1bits.EXID         = AO_CAN_FILTER_IDE_3_1;
    C3RXF1bits.SID          = AO_CAN_FILTER_SID_3_1;
    C3FLTCON0bits.FSEL1     = AO_CAN_FILTER_FIFO_3_1;
    C3FLTCON0bits.MSEL1     = AO_CAN_FILTER_MASK_3_1;
    C3FLTCON0bits.FLTEN1    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_2

