tinko26/ao/sys/ao_sys_xc32_pic32.c
    C3RXF2bits.EID          = AO_CAN_FILTER_EID_3_2;
    C3RXF2bits.EXID         = AO_CAN_FILTER_IDE_3_2;
    C3RXF2bits.SID          = AO_CAN_FILTER_SID_3_2;
    C3FLTCON0bits.FSEL2     = AO_CAN_FILTER_FIFO_3_2;
    C3FLTCON0bits.MSEL2     = AO_CAN_FILTER_MASK_3_2;
    C3FLTCON0bits.FLTEN2    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_3

    C3RXF3bits.EID          = AO_CAN_FILTER_EID_3_3;
    C3RXF3bits.EXID         = AO_CAN_FILTER_IDE_3_3;
    C3RXF3bits.SID          = AO_CAN_FILTER_SID_3_3;
    C3FLTCON0bits.FSEL3     = AO_CAN_FILTER_FIFO_3_3;
    C3FLTCON0bits.MSEL3     = AO_CAN_FILTER_MASK_3_3;
    C3FLTCON0bits.FLTEN3    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_4

    C3RXF4bits.EID          = AO_CAN_FILTER_EID_3_4;
    C3RXF4bits.EXID         = AO_CAN_FILTER_IDE_3_4;
    C3RXF4bits.SID          = AO_CAN_FILTER_SID_3_4;
    C3FLTCON1bits.FSEL4     = AO_CAN_FILTER_FIFO_3_4;
    C3FLTCON1bits.MSEL4     = AO_CAN_FILTER_MASK_3_4;
    C3FLTCON1bits.FLTEN4    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_5

    C3RXF5bits.EID          = AO_CAN_FILTER_EID_3_5;
    C3RXF5bits.EXID         = AO_CAN_FILTER_IDE_3_5;
    C3RXF5bits.SID          = AO_CAN_FILTER_SID_3_5;
    C3FLTCON1bits.FSEL5     = AO_CAN_FILTER_FIFO_3_5;
    C3FLTCON1bits.MSEL5     = AO_CAN_FILTER_MASK_3_5;
    C3FLTCON1bits.FLTEN5    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_6

    C3RXF6bits.EID          = AO_CAN_FILTER_EID_3_6;
    C3RXF6bits.EXID         = AO_CAN_FILTER_IDE_3_6;
    C3RXF6bits.SID          = AO_CAN_FILTER_SID_3_6;
    C3FLTCON1bits.FSEL6     = AO_CAN_FILTER_FIFO_3_6;
    C3FLTCON1bits.MSEL6     = AO_CAN_FILTER_MASK_3_6;
    C3FLTCON1bits.FLTEN6    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_7

    C3RXF7bits.EID          = AO_CAN_FILTER_EID_3_7;
    C3RXF7bits.EXID         = AO_CAN_FILTER_IDE_3_7;
    C3RXF7bits.SID          = AO_CAN_FILTER_SID_3_7;
    C3FLTCON1bits.FSEL7     = AO_CAN_FILTER_FIFO_3_7;
    C3FLTCON1bits.MSEL7     = AO_CAN_FILTER_MASK_3_7;
    C3FLTCON1bits.FLTEN7    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_8

    C3RXF8bits.EID          = AO_CAN_FILTER_EID_3_8;
    C3RXF8bits.EXID         = AO_CAN_FILTER_IDE_3_8;
    C3RXF8bits.SID          = AO_CAN_FILTER_SID_3_8;
    C3FLTCON2bits.FSEL8     = AO_CAN_FILTER_FIFO_3_8;
    C3FLTCON2bits.MSEL8     = AO_CAN_FILTER_MASK_3_8;
    C3FLTCON2bits.FLTEN8    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_9

    C3RXF9bits.EID          = AO_CAN_FILTER_EID_3_9;
    C3RXF9bits.EXID         = AO_CAN_FILTER_IDE_3_9;
    C3RXF9bits.SID          = AO_CAN_FILTER_SID_3_9;
    C3FLTCON2bits.FSEL9     = AO_CAN_FILTER_FIFO_3_9;
    C3FLTCON2bits.MSEL9     = AO_CAN_FILTER_MASK_3_9;
    C3FLTCON2bits.FLTEN9    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_10

    C3RXF10bits.EID         = AO_CAN_FILTER_EID_3_10;
    C3RXF10bits.EXID        = AO_CAN_FILTER_IDE_3_10;
    C3RXF10bits.SID         = AO_CAN_FILTER_SID_3_10;
    C3FLTCON2bits.FSEL10    = AO_CAN_FILTER_FIFO_3_10;
    C3FLTCON2bits.MSEL10    = AO_CAN_FILTER_MASK_3_10;
    C3FLTCON2bits.FLTEN10   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_11

    C3RXF11bits.EID         = AO_CAN_FILTER_EID_3_11;
    C3RXF11bits.EXID        = AO_CAN_FILTER_IDE_3_11;
    C3RXF11bits.SID         = AO_CAN_FILTER_SID_3_11;
    C3FLTCON2bits.FSEL11    = AO_CAN_FILTER_FIFO_3_11;
    C3FLTCON2bits.MSEL11    = AO_CAN_FILTER_MASK_3_11;
    C3FLTCON2bits.FLTEN11   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_12

    C3RXF12bits.EID         = AO_CAN_FILTER_EID_3_12;
    C3RXF12bits.EXID        = AO_CAN_FILTER_IDE_3_12;
    C3RXF12bits.SID         = AO_CAN_FILTER_SID_3_12;
    C3FLTCON3bits.FSEL12    = AO_CAN_FILTER_FIFO_3_12;
    C3FLTCON3bits.MSEL12    = AO_CAN_FILTER_MASK_3_12;
    C3FLTCON3bits.FLTEN12   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_13

    C3RXF13bits.EID         = AO_CAN_FILTER_EID_3_13;
    C3RXF13bits.EXID        = AO_CAN_FILTER_IDE_3_13;
    C3RXF13bits.SID         = AO_CAN_FILTER_SID_3_13;
    C3FLTCON3bits.FSEL13    = AO_CAN_FILTER_FIFO_3_13;
    C3FLTCON3bits.MSEL13    = AO_CAN_FILTER_MASK_3_13;
    C3FLTCON3bits.FLTEN13   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_14

    C3RXF14bits.EID         = AO_CAN_FILTER_EID_3_14;
    C3RXF14bits.EXID        = AO_CAN_FILTER_IDE_3_14;
    C3RXF14bits.SID         = AO_CAN_FILTER_SID_3_14;
    C3FLTCON3bits.FSEL14    = AO_CAN_FILTER_FIFO_3_14;
    C3FLTCON3bits.MSEL14    = AO_CAN_FILTER_MASK_3_14;
    C3FLTCON3bits.FLTEN14   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_15

    C3RXF15bits.EID         = AO_CAN_FILTER_EID_3_15;
    C3RXF15bits.EXID        = AO_CAN_FILTER_IDE_3_15;
    C3RXF15bits.SID         = AO_CAN_FILTER_SID_3_15;
    C3FLTCON3bits.FSEL15    = AO_CAN_FILTER_FIFO_3_15;
    C3FLTCON3bits.MSEL15    = AO_CAN_FILTER_MASK_3_15;
    C3FLTCON3bits.FLTEN15   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_16

    C3RXF16bits.EID         = AO_CAN_FILTER_EID_3_16;
    C3RXF16bits.EXID        = AO_CAN_FILTER_IDE_3_16;
    C3RXF16bits.SID         = AO_CAN_FILTER_SID_3_16;
    C3FLTCON4bits.FSEL16    = AO_CAN_FILTER_FIFO_3_16;
    C3FLTCON4bits.MSEL16    = AO_CAN_FILTER_MASK_3_16;
    C3FLTCON4bits.FLTEN16   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_17

    C3RXF17bits.EID         = AO_CAN_FILTER_EID_3_17;
    C3RXF17bits.EXID        = AO_CAN_FILTER_IDE_3_17;
    C3RXF17bits.SID         = AO_CAN_FILTER_SID_3_17;
    C3FLTCON4bits.FSEL17    = AO_CAN_FILTER_FIFO_3_17;
    C3FLTCON4bits.MSEL17    = AO_CAN_FILTER_MASK_3_17;
    C3FLTCON4bits.FLTEN17   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_18

    C3RXF18bits.EID         = AO_CAN_FILTER_EID_3_18;
    C3RXF18bits.EXID        = AO_CAN_FILTER_IDE_3_18;
    C3RXF18bits.SID         = AO_CAN_FILTER_SID_3_18;
    C3FLTCON4bits.FSEL18    = AO_CAN_FILTER_FIFO_3_18;
    C3FLTCON4bits.MSEL18    = AO_CAN_FILTER_MASK_3_18;
    C3FLTCON4bits.FLTEN18   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_19

    C3RXF19bits.EID         = AO_CAN_FILTER_EID_3_19;
    C3RXF19bits.EXID        = AO_CAN_FILTER_IDE_3_19;
    C3RXF19bits.SID         = AO_CAN_FILTER_SID_3_19;
    C3FLTCON4bits.FSEL19    = AO_CAN_FILTER_FIFO_3_19;
    C3FLTCON4bits.MSEL19    = AO_CAN_FILTER_MASK_3_19;
    C3FLTCON4bits.FLTEN19   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_20

