tinko26/ao/sys/ao_sys_xc32_pic32.c
    C3RXF20bits.EID         = AO_CAN_FILTER_EID_3_20;
    C3RXF20bits.EXID        = AO_CAN_FILTER_IDE_3_20;
    C3RXF20bits.SID         = AO_CAN_FILTER_SID_3_20;
    C3FLTCON5bits.FSEL20    = AO_CAN_FILTER_FIFO_3_20;
    C3FLTCON5bits.MSEL20    = AO_CAN_FILTER_MASK_3_20;
    C3FLTCON5bits.FLTEN20   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_21

    C3RXF21bits.EID         = AO_CAN_FILTER_EID_3_21;
    C3RXF21bits.EXID        = AO_CAN_FILTER_IDE_3_21;
    C3RXF21bits.SID         = AO_CAN_FILTER_SID_3_21;
    C3FLTCON5bits.FSEL21    = AO_CAN_FILTER_FIFO_3_21;
    C3FLTCON5bits.MSEL21    = AO_CAN_FILTER_MASK_3_21;
    C3FLTCON5bits.FLTEN21   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_22

    C3RXF22bits.EID         = AO_CAN_FILTER_EID_3_22;
    C3RXF22bits.EXID        = AO_CAN_FILTER_IDE_3_22;
    C3RXF22bits.SID         = AO_CAN_FILTER_SID_3_22;
    C3FLTCON5bits.FSEL22    = AO_CAN_FILTER_FIFO_3_22;
    C3FLTCON5bits.MSEL22    = AO_CAN_FILTER_MASK_3_22;
    C3FLTCON5bits.FLTEN22   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_23

    C3RXF23bits.EID         = AO_CAN_FILTER_EID_3_23;
    C3RXF23bits.EXID        = AO_CAN_FILTER_IDE_3_23;
    C3RXF23bits.SID         = AO_CAN_FILTER_SID_3_23;
    C3FLTCON5bits.FSEL23    = AO_CAN_FILTER_FIFO_3_23;
    C3FLTCON5bits.MSEL23    = AO_CAN_FILTER_MASK_3_23;
    C3FLTCON5bits.FLTEN23   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_24

    C3RXF24bits.EID         = AO_CAN_FILTER_EID_3_24;
    C3RXF24bits.EXID        = AO_CAN_FILTER_IDE_3_24;
    C3RXF24bits.SID         = AO_CAN_FILTER_SID_3_24;
    C3FLTCON6bits.FSEL24    = AO_CAN_FILTER_FIFO_3_24;
    C3FLTCON6bits.MSEL24    = AO_CAN_FILTER_MASK_3_24;
    C3FLTCON6bits.FLTEN24   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_25

    C3RXF25bits.EID         = AO_CAN_FILTER_EID_3_25;
    C3RXF25bits.EXID        = AO_CAN_FILTER_IDE_3_25;
    C3RXF25bits.SID         = AO_CAN_FILTER_SID_3_25;
    C3FLTCON6bits.FSEL25    = AO_CAN_FILTER_FIFO_3_25;
    C3FLTCON6bits.MSEL25    = AO_CAN_FILTER_MASK_3_25;
    C3FLTCON6bits.FLTEN25   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_26

    C3RXF26bits.EID         = AO_CAN_FILTER_EID_3_26;
    C3RXF26bits.EXID        = AO_CAN_FILTER_IDE_3_26;
    C3RXF26bits.SID         = AO_CAN_FILTER_SID_3_26;
    C3FLTCON6bits.FSEL26    = AO_CAN_FILTER_FIFO_3_26;
    C3FLTCON6bits.MSEL26    = AO_CAN_FILTER_MASK_3_26;
    C3FLTCON6bits.FLTEN26   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_27

    C3RXF27bits.EID         = AO_CAN_FILTER_EID_3_27;
    C3RXF27bits.EXID        = AO_CAN_FILTER_IDE_3_27;
    C3RXF27bits.SID         = AO_CAN_FILTER_SID_3_27;
    C3FLTCON6bits.FSEL27    = AO_CAN_FILTER_FIFO_3_27;
    C3FLTCON6bits.MSEL27    = AO_CAN_FILTER_MASK_3_27;
    C3FLTCON6bits.FLTEN27   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_28

    C3RXF28bits.EID         = AO_CAN_FILTER_EID_3_28;
    C3RXF28bits.EXID        = AO_CAN_FILTER_IDE_3_28;
    C3RXF28bits.SID         = AO_CAN_FILTER_SID_3_28;
    C3FLTCON7bits.FSEL28    = AO_CAN_FILTER_FIFO_3_28;
    C3FLTCON7bits.MSEL28    = AO_CAN_FILTER_MASK_3_28;
    C3FLTCON7bits.FLTEN28   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_29

    C3RXF29bits.EID         = AO_CAN_FILTER_EID_3_29;
    C3RXF29bits.EXID        = AO_CAN_FILTER_IDE_3_29;
    C3RXF29bits.SID         = AO_CAN_FILTER_SID_3_29;
    C3FLTCON7bits.FSEL29    = AO_CAN_FILTER_FIFO_3_29;
    C3FLTCON7bits.MSEL29    = AO_CAN_FILTER_MASK_3_29;
    C3FLTCON7bits.FLTEN29   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_30

    C3RXF30bits.EID         = AO_CAN_FILTER_EID_3_30;
    C3RXF30bits.EXID        = AO_CAN_FILTER_IDE_3_30;
    C3RXF30bits.SID         = AO_CAN_FILTER_SID_3_30;
    C3FLTCON7bits.FSEL30    = AO_CAN_FILTER_FIFO_3_30;
    C3FLTCON7bits.MSEL30    = AO_CAN_FILTER_MASK_3_30;
    C3FLTCON7bits.FLTEN30   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_3_31

    C3RXF31bits.EID         = AO_CAN_FILTER_EID_3_31;
    C3RXF31bits.EXID        = AO_CAN_FILTER_IDE_3_31;
    C3RXF31bits.SID         = AO_CAN_FILTER_SID_3_31;
    C3FLTCON7bits.FSEL31    = AO_CAN_FILTER_FIFO_3_31;
    C3FLTCON7bits.MSEL31    = AO_CAN_FILTER_MASK_3_31;
    C3FLTCON7bits.FLTEN31   = 1;

#endif

}

// ----------------------------------------------------------------------------

void ao_can_ir_3()
{
    // Variables.

    ao_can_t *          c1;
    ao_can_t *          c2;

    ao_can_fifo_flags_t f;

    uint32_t            i1;
    uint32_t            i2;

    uint32_t            m;

    uint32_t            r;

    ao_can_reg_t *      reg = ao_can_reg_3();

    ao_time_t           t;


    // Ready.

    do
    {
        t = ao_now();

        i1 = reg->vec.bits.icode;

        ao_ir_can3_reply();

        switch (i1)
        {

#if AO_CAN_INVALID_3

            case 0b1001000:

                // Invalid message received.

                ao_can_invalid_3(&ao_can_invalid_info_3);

                reg->intx.bits.ivrif = 0;

                break;

#endif

                // Mode changed.

            case 0b1000111:

#if AO_CAN_MODE_3

                ao_can_mode_3(&ao_can_mode_info_3);

#endif

                ao_cond_set(&ao_can_cond_changed_3);

                reg->intx.bits.modif = 0;

                break;

#if AO_CAN_TIMER_3

            case 0b1000110:

                // Timer.

                ao_can_timer_3(&ao_can_timer_info_3);

                reg->intx.bits.ctmrif = 0;

                break;

#endif

            case 0b1000101:
            case 0b1000100:

                // System error.

#if AO_CAN_SYSTEM_3

                ao_can_system_info_3.flags = (ao_can_system_flags_t) i1;

                ao_can_system_3(&ao_can_system_info_3);

#endif

                reg->con.bits.on = 0;

                while (reg->con.bits.canbusy) { }

                reg->con.bits.on = 1;

                break;

#if AO_CAN_RBOV_3

            case 0b1000011:

                // Receive buffer overrun.

                r = reg->rxovf.reg;

                m = (AO_CAN_FIFOS_TX_3 == 32) ? UINT32_MAX : (1 << AO_CAN_FIFOS_TX_3) - 1;

#if AO_CAN_RXOF_3

                f = (ao_can_fifo_flags_t) (r & ~m);

                if (f != AO_CAN_FIFO_FLAGS_NONE)
                {
                    ao_can_overflow_info_3.fifos = f;

                    ao_can_overflow_info_3.fifos_rx = (ao_can_fifo_flags_t) ((uint32_t) f >> AO_CAN_FIFOS_TX_3);

                    ao_can_overflow_3(&ao_can_overflow_info_3);
                }

#endif

