tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_TXUF_3

                f = (ao_can_fifo_flags_t) (r & m);

                if (f != AO_CAN_FIFO_FLAGS_NONE)
                {
                    ao_can_underflow_info_3.fifos = f;

                    ao_can_underflow_info_3.fifos_tx = f;

                    ao_can_underflow_3(&ao_can_underflow_info_3);
                }

#endif

                // DS61154.

                // Section 34.12.1.17.

                // Clearing all the CxFIFOINTn.RXOVFLIF bits will automatically
                // clear the CxINT.RBOVIF bit.

                while (r)
                {
                    i2 = ao_ffs(r);

                    m = 1 << i2;

                    r = r & ~m;

                    reg->fifo[i2].intx.bits.rxovflif = 0;
                }

                // DS61154.

                // Section 34.12.1.17: The CxINT.RBOVIF bit is not directly clearable.

                // Section 34.3.4    : The CxINT.RBOVIF bit is writable.

                reg->intx.bits.rbovif = 0;

                break;

#endif

#if AO_CAN_WAKE_UP_3

            case 0b1000010:

                // Wake up.

                ao_can_wake_up_3(&ao_can_wake_up_info_3);

                reg->intx.bits.wakif = 0;

                break;

#endif

#if AO_CAN_BUS_3

            case 0b1000001:

                // CAN bus error.

                ao_can_bus_info_3.receive_error_counter = reg->trec.bits.rerrcnt;

                if (reg->trec.bits.rxbp)
                {
                    ao_can_bus_info_3.receive_error_state = AO_CAN_BUS_PASSIVE;
                }

                else if (reg->trec.bits.rxwarn)
                {
                    ao_can_bus_info_3.receive_error_state = AO_CAN_BUS_ACTIVE_WARNING;
                }

                else
                {
                    ao_can_bus_info_3.receive_error_state = AO_CAN_BUS_ACTIVE;
                }

                ao_can_bus_info_3.transmit_error_counter = reg->trec.bits.terrcnt;

                if (reg->trec.bits.txbo)
                {
                    ao_can_bus_info_3.transmit_error_state = AO_CAN_BUS_OFF;
                }

                else if (reg->trec.bits.txbp)
                {
                    ao_can_bus_info_3.transmit_error_state = AO_CAN_BUS_PASSIVE;
                }

                else if (reg->trec.bits.txwarn)
                {
                    ao_can_bus_info_3.transmit_error_state = AO_CAN_BUS_ACTIVE_WARNING;
                }

                else
                {
                    ao_can_bus_info_3.transmit_error_state = AO_CAN_BUS_ACTIVE;
                }

                ao_can_bus_3(&ao_can_bus_info_3);

                reg->intx.bits.cerrif = 0;

                break;

#endif

            case 0b1000000:

                // No interrupt.

                break;

#if AO_CAN_RX_3

#if AO_CAN_FIFOS_3 > 31  &&  AO_CAN_FIFOS_TX_3 <= 31

            case 31:

#endif

#if AO_CAN_FIFOS_3 > 30  &&  AO_CAN_FIFOS_TX_3 <= 30

            case 30:

#endif

#if AO_CAN_FIFOS_3 > 29  &&  AO_CAN_FIFOS_TX_3 <= 29

            case 29:

#endif

#if AO_CAN_FIFOS_3 > 28  &&  AO_CAN_FIFOS_TX_3 <= 28

            case 28:

#endif

#if AO_CAN_FIFOS_3 > 27  &&  AO_CAN_FIFOS_TX_3 <= 27

            case 27:

#endif

#if AO_CAN_FIFOS_3 > 26  &&  AO_CAN_FIFOS_TX_3 <= 26

            case 26:

#endif

#if AO_CAN_FIFOS_3 > 25  &&  AO_CAN_FIFOS_TX_3 <= 25

            case 25:

#endif

#if AO_CAN_FIFOS_3 > 24  &&  AO_CAN_FIFOS_TX_3 <= 24

            case 24:

#endif

#if AO_CAN_FIFOS_3 > 23  &&  AO_CAN_FIFOS_TX_3 <= 23

            case 23:

#endif

#if AO_CAN_FIFOS_3 > 22  &&  AO_CAN_FIFOS_TX_3 <= 22

            case 22:

#endif

#if AO_CAN_FIFOS_3 > 21  &&  AO_CAN_FIFOS_TX_3 <= 21

            case 21:

#endif

#if AO_CAN_FIFOS_3 > 20  &&  AO_CAN_FIFOS_TX_3 <= 20

            case 20:

#endif

#if AO_CAN_FIFOS_3 > 19  &&  AO_CAN_FIFOS_TX_3 <= 19

            case 19:

#endif

#if AO_CAN_FIFOS_3 > 18  &&  AO_CAN_FIFOS_TX_3 <= 18

            case 18:

#endif

#if AO_CAN_FIFOS_3 > 17  &&  AO_CAN_FIFOS_TX_3 <= 17

            case 17:

#endif

#if AO_CAN_FIFOS_3 > 16  &&  AO_CAN_FIFOS_TX_3 <= 16

            case 16:

#endif

#if AO_CAN_FIFOS_3 > 15  &&  AO_CAN_FIFOS_TX_3 <= 15

            case 15:

#endif

#if AO_CAN_FIFOS_3 > 14  &&  AO_CAN_FIFOS_TX_3 <= 14

            case 14:

#endif

#if AO_CAN_FIFOS_3 > 13  &&  AO_CAN_FIFOS_TX_3 <= 13

            case 13:

#endif

#if AO_CAN_FIFOS_3 > 12  &&  AO_CAN_FIFOS_TX_3 <= 12

            case 12:

#endif

#if AO_CAN_FIFOS_3 > 11  &&  AO_CAN_FIFOS_TX_3 <= 11

            case 11:

#endif

#if AO_CAN_FIFOS_3 > 10  &&  AO_CAN_FIFOS_TX_3 <= 10

            case 10:

#endif

#if AO_CAN_FIFOS_3 >  9  &&  AO_CAN_FIFOS_TX_3 <=  9

            case  9:

#endif

#if AO_CAN_FIFOS_3 >  8  &&  AO_CAN_FIFOS_TX_3 <=  8

            case  8:

#endif

#if AO_CAN_FIFOS_3 >  7  &&  AO_CAN_FIFOS_TX_3 <=  7

            case  7:

#endif

#if AO_CAN_FIFOS_3 >  6  &&  AO_CAN_FIFOS_TX_3 <=  6

            case  6:

#endif

#if AO_CAN_FIFOS_3 >  5  &&  AO_CAN_FIFOS_TX_3 <=  5

            case  5:

#endif

#if AO_CAN_FIFOS_3 >  4  &&  AO_CAN_FIFOS_TX_3 <=  4

            case  4:

#endif

#if AO_CAN_FIFOS_3 >  3  &&  AO_CAN_FIFOS_TX_3 <=  3

            case  3:

#endif

#if AO_CAN_FIFOS_3 >  2  &&  AO_CAN_FIFOS_TX_3 <=  2

            case  2:

#endif

#if AO_CAN_FIFOS_3 >  1  &&  AO_CAN_FIFOS_TX_3 <=  1

            case  1:

#endif

#if AO_CAN_FIFOS_3 >  0  &&  AO_CAN_FIFOS_TX_3 <=  0

            case  0:

#endif

                c1 = PA_TO_KVA1(reg->fifo[i1].ua.reg);

                c2 = ao_can_in_can_3 + i1 - AO_CAN_FIFOS_TX_3;

                if (reg->fifo[i1].con.bits.donly)
                {
                    c2->cmsgsid = 0;

                    c2->cmsgeid = 0;

                    c2->data = *((uint64_t *) c1);
                }

                else
                {
                    *c2 = *c1;
                }

                if (!c2->ide && c2->srr)
                {
                    c2->rtr = 1;
                }

                ao_send_obj_try(ao_can_in_3 + i1 - AO_CAN_FIFOS_TX_3);

                // DS80000480.

