tinko26/ao/sys/ao_sys_xc32_pic32.c
                // The CxFIFOCONn.FRESET bit and the CxFIFOCONn.UINC
                // bit are not settable through a normal Special
                // Function Register (SFR) write.

                // Use the SET register operations to change the state
                // of these bits.

                reg->fifo[i1].con.set = _C3FIFOCON0_UINC_MASK;

                break;

#endif

#if AO_CAN_TX_3

#if AO_CAN_FIFOS_3 > 31  &&  AO_CAN_FIFOS_TX_3 > 31

            case 31:

#endif

#if AO_CAN_FIFOS_3 > 30  &&  AO_CAN_FIFOS_TX_3 > 30

            case 30:

#endif

#if AO_CAN_FIFOS_3 > 29  &&  AO_CAN_FIFOS_TX_3 > 29

            case 29:

#endif

#if AO_CAN_FIFOS_3 > 28  &&  AO_CAN_FIFOS_TX_3 > 28

            case 28:

#endif

#if AO_CAN_FIFOS_3 > 27  &&  AO_CAN_FIFOS_TX_3 > 27

            case 27:

#endif

#if AO_CAN_FIFOS_3 > 26  &&  AO_CAN_FIFOS_TX_3 > 26

            case 26:

#endif

#if AO_CAN_FIFOS_3 > 25  &&  AO_CAN_FIFOS_TX_3 > 25

            case 25:

#endif

#if AO_CAN_FIFOS_3 > 24  &&  AO_CAN_FIFOS_TX_3 > 24

            case 24:

#endif

#if AO_CAN_FIFOS_3 > 23  &&  AO_CAN_FIFOS_TX_3 > 23

            case 23:

#endif

#if AO_CAN_FIFOS_3 > 22  &&  AO_CAN_FIFOS_TX_3 > 22

            case 22:

#endif

#if AO_CAN_FIFOS_3 > 21  &&  AO_CAN_FIFOS_TX_3 > 21

            case 21:

#endif

#if AO_CAN_FIFOS_3 > 20  &&  AO_CAN_FIFOS_TX_3 > 20

            case 20:

#endif

#if AO_CAN_FIFOS_3 > 19  &&  AO_CAN_FIFOS_TX_3 > 19

            case 19:

#endif

#if AO_CAN_FIFOS_3 > 18  &&  AO_CAN_FIFOS_TX_3 > 18

            case 18:

#endif

#if AO_CAN_FIFOS_3 > 17  &&  AO_CAN_FIFOS_TX_3 > 17

            case 17:

#endif

#if AO_CAN_FIFOS_3 > 16  &&  AO_CAN_FIFOS_TX_3 > 16

            case 16:

#endif

#if AO_CAN_FIFOS_3 > 15  &&  AO_CAN_FIFOS_TX_3 > 15

            case 15:

#endif

#if AO_CAN_FIFOS_3 > 14  &&  AO_CAN_FIFOS_TX_3 > 14

            case 14:

#endif

#if AO_CAN_FIFOS_3 > 13  &&  AO_CAN_FIFOS_TX_3 > 13

            case 13:

#endif

#if AO_CAN_FIFOS_3 > 12  &&  AO_CAN_FIFOS_TX_3 > 12

            case 12:

#endif

#if AO_CAN_FIFOS_3 > 11  &&  AO_CAN_FIFOS_TX_3 > 11

            case 11:

#endif

#if AO_CAN_FIFOS_3 > 10  &&  AO_CAN_FIFOS_TX_3 > 10

            case 10:

#endif

#if AO_CAN_FIFOS_3 >  9  &&  AO_CAN_FIFOS_TX_3 >  9

            case  9:

#endif

#if AO_CAN_FIFOS_3 >  8  &&  AO_CAN_FIFOS_TX_3 >  8

            case  8:

#endif

#if AO_CAN_FIFOS_3 >  7  &&  AO_CAN_FIFOS_TX_3 >  7

            case  7:

#endif

#if AO_CAN_FIFOS_3 >  6  &&  AO_CAN_FIFOS_TX_3 >  6

            case  6:

#endif

#if AO_CAN_FIFOS_3 >  5  &&  AO_CAN_FIFOS_TX_3 >  5

            case  5:

#endif

#if AO_CAN_FIFOS_3 >  4  &&  AO_CAN_FIFOS_TX_3 >  4

            case  4:

#endif

#if AO_CAN_FIFOS_3 >  3  &&  AO_CAN_FIFOS_TX_3 >  3

            case  3:

#endif

#if AO_CAN_FIFOS_3 >  2  &&  AO_CAN_FIFOS_TX_3 >  2

            case  2:

#endif

#if AO_CAN_FIFOS_3 >  1  &&  AO_CAN_FIFOS_TX_3 >  1

            case  1:

#endif

#if AO_CAN_FIFOS_3 >  0  &&  AO_CAN_FIFOS_TX_3 >  0

            case  0:

#endif

                // Fifo.

#if AO_CAN_TXST_3

                if
                (
                    reg->fifo[i1].intx.bits.txemptyie &&
                    reg->fifo[i1].intx.bits.txemptyif
                )
                {
                    ao_can_sent_info_3.fifo = i1;

                    ao_can_sent_info_3.fifo_tx = i1;

                    ao_can_sent_3(&ao_can_sent_info_3);

                    reg->fifo[i1].intx.bits.txemptyie = 0;
                }

                if
                (
                    reg->fifo[i1].intx.bits.txnfullie &&
                    reg->fifo[i1].intx.bits.txnfullif
                )
                {

#endif

                    ao_cond_set(ao_can_cond_not_full_3 + i1);

                    reg->fifo[i1].intx.bits.txnfullie = 0;

#if AO_CAN_TXST_3

                }

#endif

                break;

#endif

            default:

                // This really should not have happend.

                ao_assert(false);

                break;
        }
    }
    while (i1 != 0b1000000);
}

// ----------------------------------------------------------------------------

void ao_can_listen_all_3()
{
    ao_can_var_mode_3 = 7;

    ao_cond_set(&ao_can_cond_change_3);
}

void ao_can_listen_only_3()
{
    ao_can_var_mode_3 = 3;

    ao_cond_set(&ao_can_cond_change_3);
}

void ao_can_loopback_3()
{
    ao_can_var_mode_3 = 2;

    ao_cond_set(&ao_can_cond_change_3);
}

void ao_can_normal_3()
{
    ao_can_var_mode_3 = 0;

    ao_cond_set(&ao_can_cond_change_3);
}

// ----------------------------------------------------------------------------

void ao_can_start_3()
{
    ao_task_start(&ao_can_task_3);
}

void ao_can_started_3()
{
    // Variables.

#if AO_CAN_TX_3

    ao_can_t *      c1;
    ao_can_t *      c2;

    size_t          i;

    ao_can_reg_t *  reg = ao_can_reg_3();

#endif


    // Ready.

    while (ao_can_var_started_3)
    {
        // Await begin.

        ao_cond_wait_begin(     &ao_can_cond_change_wait_3);

        ao_sem_take_begin(      &ao_can_sem_take_3);

#if AO_CAN_TX_3

        for (i = 0; i < AO_CAN_FIFOS_TX_3; i++)
        {
            ao_cond_wait_begin( &ao_can_cond_not_full_wait_3[i]);

            ao_recv_obj_begin(  &ao_can_out_3               [i]);

            ao_async_all_begin( &ao_can_async_send_3        [i]);
        }

#endif


        // Await.

        ao_await_any_forever(   &ao_can_async_started_3);


        // Await end.

#if AO_CAN_TX_3

        for (i = 0; i < AO_CAN_FIFOS_TX_3; i++)
        {
            ao_async_all_end(   &ao_can_async_send_3        [i]);

            ao_recv_obj_end(    &ao_can_out_3               [i]);

            ao_cond_wait_end(   &ao_can_cond_not_full_wait_3[i]);
        }

#endif

        ao_sem_take_end(        &ao_can_sem_take_3);

        ao_cond_wait_end(       &ao_can_cond_change_wait_3);


        // Stop.

        if (ao_can_sem_take_3.result)
        {
            ao_can_var_started_3 = false;
        }


        // Change.

        else if (ao_can_cond_change_wait_3.result)
        {
            ao_cond_clear(&ao_can_cond_change_3);

            ao_can_change_3(ao_can_var_mode_3);
        }


        // Out.

#if AO_CAN_TX_3

        else
        {
            for (i = 0; i < AO_CAN_FIFOS_TX_3; i++)
            {
                if
                (
                    ao_can_cond_not_full_wait_3 [i].result &&
                    ao_can_out_3                [i].result
                )
                {
                    c2 = ao_can_out_can_3 + i;

