tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_4 > 1  && AO_CAN_BUFFERS_4_1  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 2  && AO_CAN_BUFFERS_4_2  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 3  && AO_CAN_BUFFERS_4_3  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 4  && AO_CAN_BUFFERS_4_4  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 5  && AO_CAN_BUFFERS_4_5  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 6  && AO_CAN_BUFFERS_4_6  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 7  && AO_CAN_BUFFERS_4_7  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 8  && AO_CAN_BUFFERS_4_8  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 9  && AO_CAN_BUFFERS_4_9  < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 10 && AO_CAN_BUFFERS_4_10 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 11 && AO_CAN_BUFFERS_4_11 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 12 && AO_CAN_BUFFERS_4_12 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 13 && AO_CAN_BUFFERS_4_13 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 14 && AO_CAN_BUFFERS_4_14 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 15 && AO_CAN_BUFFERS_4_15 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 16 && AO_CAN_BUFFERS_4_16 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 17 && AO_CAN_BUFFERS_4_17 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 18 && AO_CAN_BUFFERS_4_18 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 19 && AO_CAN_BUFFERS_4_19 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 20 && AO_CAN_BUFFERS_4_20 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 21 && AO_CAN_BUFFERS_4_21 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 22 && AO_CAN_BUFFERS_4_22 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 23 && AO_CAN_BUFFERS_4_23 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 24 && AO_CAN_BUFFERS_4_24 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 25 && AO_CAN_BUFFERS_4_25 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 26 && AO_CAN_BUFFERS_4_26 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 27 && AO_CAN_BUFFERS_4_27 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 28 && AO_CAN_BUFFERS_4_28 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 29 && AO_CAN_BUFFERS_4_29 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 30 && AO_CAN_BUFFERS_4_30 < 1

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 31 && AO_CAN_BUFFERS_4_31 < 1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_4 > 0  && AO_CAN_BUFFERS_4_0  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 1  && AO_CAN_BUFFERS_4_1  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 2  && AO_CAN_BUFFERS_4_2  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 3  && AO_CAN_BUFFERS_4_3  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 4  && AO_CAN_BUFFERS_4_4  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 5  && AO_CAN_BUFFERS_4_5  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 6  && AO_CAN_BUFFERS_4_6  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 7  && AO_CAN_BUFFERS_4_7  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 8  && AO_CAN_BUFFERS_4_8  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 9  && AO_CAN_BUFFERS_4_9  > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 10 && AO_CAN_BUFFERS_4_10 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 11 && AO_CAN_BUFFERS_4_11 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 12 && AO_CAN_BUFFERS_4_12 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 13 && AO_CAN_BUFFERS_4_13 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 14 && AO_CAN_BUFFERS_4_14 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 15 && AO_CAN_BUFFERS_4_15 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 16 && AO_CAN_BUFFERS_4_16 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 17 && AO_CAN_BUFFERS_4_17 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 18 && AO_CAN_BUFFERS_4_18 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 19 && AO_CAN_BUFFERS_4_19 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 20 && AO_CAN_BUFFERS_4_20 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 21 && AO_CAN_BUFFERS_4_21 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 22 && AO_CAN_BUFFERS_4_22 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 23 && AO_CAN_BUFFERS_4_23 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 24 && AO_CAN_BUFFERS_4_24 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 25 && AO_CAN_BUFFERS_4_25 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 26 && AO_CAN_BUFFERS_4_26 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 27 && AO_CAN_BUFFERS_4_27 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 28 && AO_CAN_BUFFERS_4_28 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 29 && AO_CAN_BUFFERS_4_29 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 30 && AO_CAN_BUFFERS_4_30 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_4 > 31 && AO_CAN_BUFFERS_4_31 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_4 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FIFOS_RX_4 > 32

#error Invalid configuration.

#endif

#if AO_CAN_FIFOS_TX_4 > 32

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_EID_4_0  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_1  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_2  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_3  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_4  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_5  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_6  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_7  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_8  > 0x3FFFF

#error Invalid configuration.

#endif

