tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_EID_4_9  > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_10 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_11 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_12 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_13 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_14 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_15 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_16 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_17 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_18 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_19 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_20 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_21 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_22 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_23 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_24 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_25 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_26 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_27 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_28 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_29 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_30 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_EID_4_31 > 0x3FFFF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_FIFO_4_0  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_1  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_2  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_3  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_4  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_5  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_6  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_7  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_8  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_9  > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_10 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_11 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_12 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_13 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_14 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_15 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_16 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_17 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_18 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_19 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_20 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_21 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_22 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_23 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_24 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_25 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_26 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_27 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_28 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_29 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_30 > 31

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_FIFO_4_31 > 31

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_IDE_4_0  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_1  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_2  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_3  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_4  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_5  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_6  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_7  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_8  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_9  > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_10 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_11 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_12 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_13 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_14 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_15 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_16 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_17 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_18 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_19 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_20 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_21 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_22 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_23 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_24 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_25 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_26 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_27 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_28 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_29 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_30 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_IDE_4_31 > 0x1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_4_0  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_1  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_2  > 3

#error Invalid configuration.

#endif

