tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_MASK_4_3  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_4  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_5  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_6  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_7  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_8  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_9  > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_10 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_11 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_12 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_13 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_14 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_15 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_16 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_17 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_18 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_19 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_20 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_21 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_22 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_23 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_24 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_25 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_26 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_27 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_28 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_29 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_30 > 3

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_4_31 > 3

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_EID_4_0 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_4_1 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_4_2 > 0x3FFFF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_EID_4_3 > 0x3FFFF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_IDE_4_0 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_4_1 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_4_2 > 0x1

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_IDE_4_3 > 0x1

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_MASK_SID_4_0 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_4_1 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_4_2 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_MASK_SID_4_3 > 0x7FF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_FILTER_SID_4_0  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_1  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_2  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_3  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_4  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_5  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_6  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_7  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_8  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_9  > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_10 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_11 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_12 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_13 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_14 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_15 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_16 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_17 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_18 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_19 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_20 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_21 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_22 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_23 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_24 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_25 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_26 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_27 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_28 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_29 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_30 > 0x7FF

#error Invalid configuration.

#endif

#if AO_CAN_FILTER_SID_4_31 > 0x7FF

#error Invalid configuration.

#endif

// ----------------------------------------------------------------------------

#define AO_CAN_RXOF_4           ((AO_CAN_RX_4)      && (AO_CAN_OVERFLOW_4))

#define AO_CAN_TXST_4           ((AO_CAN_TX_4)      && (AO_CAN_SENT_4))

#define AO_CAN_TXUF_4           ((AO_CAN_TX_4)      && (AO_CAN_UNDERFLOW_4))

// ----------------------------------------------------------------------------

#define AO_CAN_RBOV_4           ((AO_CAN_RXOF_4)    || (AO_CAN_TXUF_4))

// ----------------------------------------------------------------------------

static  void                    ao_can_change_4(    uint32_t mode);

static  void                    ao_can_started_4();

static  void                    ao_can_starting_4();

static  void                    ao_can_stopping_4();

static  void                    ao_can_task_proc_4( void * x);

// ----------------------------------------------------------------------------

        ao_can_t                ao_can_buffers_4    [AO_CAN_BUFFERS_4];

// ----------------------------------------------------------------------------

#if AO_CAN_BUS_4

