tinko26/ao/sys/ao_sys_xc32_pic32.c
static  ao_can_bus_info_t       ao_can_bus_info_4;

#endif

#if AO_CAN_INVALID_4

static  ao_can_invalid_info_t   ao_can_invalid_info_4;

#endif

#if AO_CAN_MODE_4

static  ao_can_mode_info_t      ao_can_mode_info_4;

#endif

#if AO_CAN_RXOF_4

static  ao_can_overflow_info_t  ao_can_overflow_info_4;

#endif

#if AO_CAN_SYSTEM_4

static  ao_can_system_info_t    ao_can_system_info_4;

#endif

#if AO_CAN_TIMER_4

static  ao_can_timer_info_t     ao_can_timer_info_4;

#endif

#if AO_CAN_TXST_4

static  ao_can_sent_info_t      ao_can_sent_info_4;

#endif

#if AO_CAN_TXUF_4

static  ao_can_underflow_info_t ao_can_underflow_info_4;

#endif

#if AO_CAN_WAKE_UP_4

static  ao_can_wake_up_info_t   ao_can_wake_up_info_4;

#endif

// ----------------------------------------------------------------------------

#if AO_CAN_RX_4

// ----------------------------------------------------------------------------

static  ao_can_t                ao_can_in_can_4     [AO_CAN_FIFOS_RX_4];

        ao_send_obj_t           ao_can_in_4         [AO_CAN_FIFOS_RX_4] =
{

#if AO_CAN_FIFOS_RX_4 >  0

#if AO_CAN_FIFOS_RX_4 >  0

{
        .ptr                    = ao_can_in_can_4 +  0
},

#endif

#if AO_CAN_FIFOS_RX_4 >  1

{
        .ptr                    = ao_can_in_can_4 +  1
},

#endif

#if AO_CAN_FIFOS_RX_4 >  2

{
        .ptr                    = ao_can_in_can_4 +  2
},

#endif

#if AO_CAN_FIFOS_RX_4 >  3

{
        .ptr                    = ao_can_in_can_4 +  3
},

#endif

#if AO_CAN_FIFOS_RX_4 >  4

{
        .ptr                    = ao_can_in_can_4 +  4
},

#endif

#if AO_CAN_FIFOS_RX_4 >  5

{
        .ptr                    = ao_can_in_can_4 +  5
},

#endif

#if AO_CAN_FIFOS_RX_4 >  6

{
        .ptr                    = ao_can_in_can_4 +  6
},

#endif

#if AO_CAN_FIFOS_RX_4 >  7

{
        .ptr                    = ao_can_in_can_4 +  7
},

#endif

#if AO_CAN_FIFOS_RX_4 >  8

{
        .ptr                    = ao_can_in_can_4 +  8
},

#endif

#if AO_CAN_FIFOS_RX_4 >  9

{
        .ptr                    = ao_can_in_can_4 +  9
},

#endif

#if AO_CAN_FIFOS_RX_4 > 10

{
        .ptr                    = ao_can_in_can_4 + 10
},

#endif

#if AO_CAN_FIFOS_RX_4 > 11

{
        .ptr                    = ao_can_in_can_4 + 11
},

#endif

#if AO_CAN_FIFOS_RX_4 > 12

{
        .ptr                    = ao_can_in_can_4 + 12
},

#endif

#if AO_CAN_FIFOS_RX_4 > 13

{
        .ptr                    = ao_can_in_can_4 + 13
},

#endif

#if AO_CAN_FIFOS_RX_4 > 14

{
        .ptr                    = ao_can_in_can_4 + 14
},

#endif

#if AO_CAN_FIFOS_RX_4 > 15

{
        .ptr                    = ao_can_in_can_4 + 15
},

#endif

#if AO_CAN_FIFOS_RX_4 > 16

{
        .ptr                    = ao_can_in_can_4 + 16
},

#endif

#if AO_CAN_FIFOS_RX_4 > 17

{
        .ptr                    = ao_can_in_can_4 + 17
},

#endif

#if AO_CAN_FIFOS_RX_4 > 18

{
        .ptr                    = ao_can_in_can_4 + 18
},

#endif

#if AO_CAN_FIFOS_RX_4 > 19

{
        .ptr                    = ao_can_in_can_4 + 19
},

#endif

#if AO_CAN_FIFOS_RX_4 > 20

{
        .ptr                    = ao_can_in_can_4 + 20
},

#endif

#if AO_CAN_FIFOS_RX_4 > 21

{
        .ptr                    = ao_can_in_can_4 + 21
},

#endif

#if AO_CAN_FIFOS_RX_4 > 22

{
        .ptr                    = ao_can_in_can_4 + 22
},

#endif

#if AO_CAN_FIFOS_RX_4 > 23

{
        .ptr                    = ao_can_in_can_4 + 23
},

#endif

#if AO_CAN_FIFOS_RX_4 > 24

{
        .ptr                    = ao_can_in_can_4 + 24
},

#endif

#if AO_CAN_FIFOS_RX_4 > 25

{
        .ptr                    = ao_can_in_can_4 + 25
},

#endif

#if AO_CAN_FIFOS_RX_4 > 26

{
        .ptr                    = ao_can_in_can_4 + 26
},

#endif

#if AO_CAN_FIFOS_RX_4 > 27

{
        .ptr                    = ao_can_in_can_4 + 27
},

#endif

#if AO_CAN_FIFOS_RX_4 > 28

{
        .ptr                    = ao_can_in_can_4 + 28
},

#endif

#if AO_CAN_FIFOS_RX_4 > 29

{
        .ptr                    = ao_can_in_can_4 + 29
},

#endif

#if AO_CAN_FIFOS_RX_4 > 30

{
        .ptr                    = ao_can_in_can_4 + 30
},

#endif

#if AO_CAN_FIFOS_RX_4 > 31

{
        .ptr                    = ao_can_in_can_4 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

#endif

#if AO_CAN_TX_4

// ----------------------------------------------------------------------------

static  ao_can_t                ao_can_out_can_4    [AO_CAN_FIFOS_TX_4];

        ao_recv_obj_t           ao_can_out_4        [AO_CAN_FIFOS_TX_4] =
{

#if AO_CAN_FIFOS_TX_4 >  0

#if AO_CAN_FIFOS_TX_4 >  0

{
        .ptr                    = ao_can_out_can_4 +  0
},

#endif

#if AO_CAN_FIFOS_TX_4 >  1

{
        .ptr                    = ao_can_out_can_4 +  1
},

#endif

#if AO_CAN_FIFOS_TX_4 >  2

{
        .ptr                    = ao_can_out_can_4 +  2
},

#endif

#if AO_CAN_FIFOS_TX_4 >  3

{
        .ptr                    = ao_can_out_can_4 +  3
},

#endif

#if AO_CAN_FIFOS_TX_4 >  4

{
        .ptr                    = ao_can_out_can_4 +  4
},

#endif

#if AO_CAN_FIFOS_TX_4 >  5

{
        .ptr                    = ao_can_out_can_4 +  5
},

#endif

#if AO_CAN_FIFOS_TX_4 >  6

{
        .ptr                    = ao_can_out_can_4 +  6
},

#endif

#if AO_CAN_FIFOS_TX_4 >  7

{
        .ptr                    = ao_can_out_can_4 +  7
},

#endif

#if AO_CAN_FIFOS_TX_4 >  8

{
        .ptr                    = ao_can_out_can_4 +  8
},

#endif

#if AO_CAN_FIFOS_TX_4 >  9

{
        .ptr                    = ao_can_out_can_4 +  9
},

#endif

#if AO_CAN_FIFOS_TX_4 > 10

{
        .ptr                    = ao_can_out_can_4 + 10
},

#endif

#if AO_CAN_FIFOS_TX_4 > 11

{
        .ptr                    = ao_can_out_can_4 + 11
},

#endif

#if AO_CAN_FIFOS_TX_4 > 12

{
        .ptr                    = ao_can_out_can_4 + 12
},

#endif

#if AO_CAN_FIFOS_TX_4 > 13

{
        .ptr                    = ao_can_out_can_4 + 13
},

#endif

#if AO_CAN_FIFOS_TX_4 > 14

{
        .ptr                    = ao_can_out_can_4 + 14
},

#endif

