tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_TX_4 > 15

{
        .ptr                    = ao_can_out_can_4 + 15
},

#endif

#if AO_CAN_FIFOS_TX_4 > 16

{
        .ptr                    = ao_can_out_can_4 + 16
},

#endif

#if AO_CAN_FIFOS_TX_4 > 17

{
        .ptr                    = ao_can_out_can_4 + 17
},

#endif

#if AO_CAN_FIFOS_TX_4 > 18

{
        .ptr                    = ao_can_out_can_4 + 18
},

#endif

#if AO_CAN_FIFOS_TX_4 > 19

{
        .ptr                    = ao_can_out_can_4 + 19
},

#endif

#if AO_CAN_FIFOS_TX_4 > 20

{
        .ptr                    = ao_can_out_can_4 + 20
},

#endif

#if AO_CAN_FIFOS_TX_4 > 21

{
        .ptr                    = ao_can_out_can_4 + 21
},

#endif

#if AO_CAN_FIFOS_TX_4 > 22

{
        .ptr                    = ao_can_out_can_4 + 22
},

#endif

#if AO_CAN_FIFOS_TX_4 > 23

{
        .ptr                    = ao_can_out_can_4 + 23
},

#endif

#if AO_CAN_FIFOS_TX_4 > 24

{
        .ptr                    = ao_can_out_can_4 + 24
},

#endif

#if AO_CAN_FIFOS_TX_4 > 25

{
        .ptr                    = ao_can_out_can_4 + 25
},

#endif

#if AO_CAN_FIFOS_TX_4 > 26

{
        .ptr                    = ao_can_out_can_4 + 26
},

#endif

#if AO_CAN_FIFOS_TX_4 > 27

{
        .ptr                    = ao_can_out_can_4 + 27
},

#endif

#if AO_CAN_FIFOS_TX_4 > 28

{
        .ptr                    = ao_can_out_can_4 + 28
},

#endif

#if AO_CAN_FIFOS_TX_4 > 29

{
        .ptr                    = ao_can_out_can_4 + 29
},

#endif

#if AO_CAN_FIFOS_TX_4 > 30

{
        .ptr                    = ao_can_out_can_4 + 30
},

#endif

#if AO_CAN_FIFOS_TX_4 > 31

{
        .ptr                    = ao_can_out_can_4 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_change_4;

static  ao_cond_wait_t          ao_can_cond_change_wait_4 =
{
        .cond                   = &ao_can_cond_change_4
};

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_changed_4;

static  ao_cond_wait_t          ao_can_cond_changed_wait_4 =
{
        .cond                   = &ao_can_cond_changed_4
};

// ----------------------------------------------------------------------------

static  ao_cond_t               ao_can_cond_not_full_4      [AO_CAN_FIFOS_TX_4];

static  ao_cond_wait_t          ao_can_cond_not_full_wait_4 [AO_CAN_FIFOS_TX_4] =
{

#if AO_CAN_FIFOS_TX_4 >  0

#if AO_CAN_FIFOS_TX_4 >  0

{
        .cond                   = ao_can_cond_not_full_4 +  0
},

#endif

#if AO_CAN_FIFOS_TX_4 >  1

{
        .cond                   = ao_can_cond_not_full_4 +  1
},

#endif

#if AO_CAN_FIFOS_TX_4 >  2

{
        .cond                   = ao_can_cond_not_full_4 +  2
},

#endif

#if AO_CAN_FIFOS_TX_4 >  3

{
        .cond                   = ao_can_cond_not_full_4 +  3
},

#endif

#if AO_CAN_FIFOS_TX_4 >  4

{
        .cond                   = ao_can_cond_not_full_4 +  4
},

#endif

#if AO_CAN_FIFOS_TX_4 >  5

{
        .cond                   = ao_can_cond_not_full_4 +  5
},

#endif

#if AO_CAN_FIFOS_TX_4 >  6

{
        .cond                   = ao_can_cond_not_full_4 +  6
},

#endif

#if AO_CAN_FIFOS_TX_4 >  7

{
        .cond                   = ao_can_cond_not_full_4 +  7
},

#endif

#if AO_CAN_FIFOS_TX_4 >  8

{
        .cond                   = ao_can_cond_not_full_4 +  8
},

#endif

#if AO_CAN_FIFOS_TX_4 >  9

{
        .cond                   = ao_can_cond_not_full_4 +  9
},

#endif

#if AO_CAN_FIFOS_TX_4 > 10

{
        .cond                   = ao_can_cond_not_full_4 + 10
},

#endif

#if AO_CAN_FIFOS_TX_4 > 11

{
        .cond                   = ao_can_cond_not_full_4 + 11
},

#endif

#if AO_CAN_FIFOS_TX_4 > 12

{
        .cond                   = ao_can_cond_not_full_4 + 12
},

#endif

#if AO_CAN_FIFOS_TX_4 > 13

{
        .cond                   = ao_can_cond_not_full_4 + 13
},

#endif

#if AO_CAN_FIFOS_TX_4 > 14

{
        .cond                   = ao_can_cond_not_full_4 + 14
},

#endif

#if AO_CAN_FIFOS_TX_4 > 15

{
        .cond                   = ao_can_cond_not_full_4 + 15
},

#endif

#if AO_CAN_FIFOS_TX_4 > 16

{
        .cond                   = ao_can_cond_not_full_4 + 16
},

#endif

#if AO_CAN_FIFOS_TX_4 > 17

{
        .cond                   = ao_can_cond_not_full_4 + 17
},

#endif

#if AO_CAN_FIFOS_TX_4 > 18

{
        .cond                   = ao_can_cond_not_full_4 + 18
},

#endif

#if AO_CAN_FIFOS_TX_4 > 19

{
        .cond                   = ao_can_cond_not_full_4 + 19
},

#endif

#if AO_CAN_FIFOS_TX_4 > 20

{
        .cond                   = ao_can_cond_not_full_4 + 20
},

#endif

#if AO_CAN_FIFOS_TX_4 > 21

{
        .cond                   = ao_can_cond_not_full_4 + 21
},

#endif

#if AO_CAN_FIFOS_TX_4 > 22

{
        .cond                   = ao_can_cond_not_full_4 + 22
},

#endif

#if AO_CAN_FIFOS_TX_4 > 23

{
        .cond                   = ao_can_cond_not_full_4 + 23
},

#endif

#if AO_CAN_FIFOS_TX_4 > 24

{
        .cond                   = ao_can_cond_not_full_4 + 24
},

#endif

#if AO_CAN_FIFOS_TX_4 > 25

{
        .cond                   = ao_can_cond_not_full_4 + 25
},

#endif

#if AO_CAN_FIFOS_TX_4 > 26

{
        .cond                   = ao_can_cond_not_full_4 + 26
},

#endif

#if AO_CAN_FIFOS_TX_4 > 27

{
        .cond                   = ao_can_cond_not_full_4 + 27
},

#endif

#if AO_CAN_FIFOS_TX_4 > 28

{
        .cond                   = ao_can_cond_not_full_4 + 28
},

#endif

#if AO_CAN_FIFOS_TX_4 > 29

{
        .cond                   = ao_can_cond_not_full_4 + 29
},

#endif

#if AO_CAN_FIFOS_TX_4 > 30

{
        .cond                   = ao_can_cond_not_full_4 + 30
},

#endif

#if AO_CAN_FIFOS_TX_4 > 31

{
        .cond                   = ao_can_cond_not_full_4 + 31
},

#endif

#endif

};

// ----------------------------------------------------------------------------

static  ao_sem_t                ao_can_sem_4;

static  ao_sem_take_t           ao_can_sem_take_4 =
{
        .count                  = 1,

        .sem                    = &ao_can_sem_4
};

// ----------------------------------------------------------------------------

