tinko26/ao/sys/ao_sys_xc32_pic32.c
        ao_task_t               ao_can_task_4 =
{
        .proc                   = ao_can_task_proc_4
};

// ----------------------------------------------------------------------------

static  uint32_t    volatile    ao_can_var_mode_4 = 0;

static  bool        volatile    ao_can_var_started_4 = false;

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_change_store_4 [2] =
{
        &ao_can_cond_changed_wait_4.async,

        &ao_can_sem_take_4.async
};

static  ao_async_any_t          ao_can_async_change_4 =
{
        .store                  = ao_can_async_change_store_4,

        .count                  = 2
};

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_send_store_4   [AO_CAN_FIFOS_TX_4 * 2] =
{

#if AO_CAN_FIFOS_TX_4 >  0

#if AO_CAN_FIFOS_TX_4 >  0

        &ao_can_cond_not_full_wait_4[ 0].async,

        &ao_can_out_4               [ 0].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  1

        &ao_can_cond_not_full_wait_4[ 1].async,

        &ao_can_out_4               [ 1].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  2

        &ao_can_cond_not_full_wait_4[ 2].async,

        &ao_can_out_4               [ 2].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  3

        &ao_can_cond_not_full_wait_4[ 3].async,

        &ao_can_out_4               [ 3].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  4

        &ao_can_cond_not_full_wait_4[ 4].async,

        &ao_can_out_4               [ 4].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  5

        &ao_can_cond_not_full_wait_4[ 5].async,

        &ao_can_out_4               [ 5].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  6

        &ao_can_cond_not_full_wait_4[ 6].async,

        &ao_can_out_4               [ 6].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  7

        &ao_can_cond_not_full_wait_4[ 7].async,

        &ao_can_out_4               [ 7].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  8

        &ao_can_cond_not_full_wait_4[ 8].async,

        &ao_can_out_4               [ 8].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  9

        &ao_can_cond_not_full_wait_4[ 9].async,

        &ao_can_out_4               [ 9].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 10

        &ao_can_cond_not_full_wait_4[10].async,

        &ao_can_out_4               [10].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 11

        &ao_can_cond_not_full_wait_4[11].async,

        &ao_can_out_4               [11].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 12

        &ao_can_cond_not_full_wait_4[12].async,

        &ao_can_out_4               [12].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 13

        &ao_can_cond_not_full_wait_4[13].async,

        &ao_can_out_4               [13].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 14

        &ao_can_cond_not_full_wait_4[14].async,

        &ao_can_out_4               [14].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 15

        &ao_can_cond_not_full_wait_4[15].async,

        &ao_can_out_4               [15].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 16

        &ao_can_cond_not_full_wait_4[16].async,

        &ao_can_out_4               [16].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 17

        &ao_can_cond_not_full_wait_4[17].async,

        &ao_can_out_4               [17].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 18

        &ao_can_cond_not_full_wait_4[18].async,

        &ao_can_out_4               [18].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 19

        &ao_can_cond_not_full_wait_4[19].async,

        &ao_can_out_4               [19].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 20

        &ao_can_cond_not_full_wait_4[20].async,

        &ao_can_out_4               [20].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 21

        &ao_can_cond_not_full_wait_4[21].async,

        &ao_can_out_4               [21].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 22

        &ao_can_cond_not_full_wait_4[22].async,

        &ao_can_out_4               [22].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 23

        &ao_can_cond_not_full_wait_4[23].async,

        &ao_can_out_4               [23].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 24

        &ao_can_cond_not_full_wait_4[24].async,

        &ao_can_out_4               [24].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 25

        &ao_can_cond_not_full_wait_4[25].async,

        &ao_can_out_4               [25].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 26

        &ao_can_cond_not_full_wait_4[26].async,

        &ao_can_out_4               [26].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 27

        &ao_can_cond_not_full_wait_4[27].async,

        &ao_can_out_4               [27].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 28

        &ao_can_cond_not_full_wait_4[28].async,

        &ao_can_out_4               [28].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 29

        &ao_can_cond_not_full_wait_4[29].async,

        &ao_can_out_4               [29].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 30

        &ao_can_cond_not_full_wait_4[30].async,

        &ao_can_out_4               [30].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 31

        &ao_can_cond_not_full_wait_4[31].async,

        &ao_can_out_4               [31].async,

#endif

#endif

};

static  ao_async_all_t          ao_can_async_send_4         [AO_CAN_FIFOS_TX_4] =
{

#if AO_CAN_FIFOS_TX_4 >  0

#if AO_CAN_FIFOS_TX_4 >  0

{
        .store                  = ao_can_async_send_store_4 +  0 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 >  1

{
        .store                  = ao_can_async_send_store_4 +  1 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 >  2

{
        .store                  = ao_can_async_send_store_4 +  2 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 >  3

{
        .store                  = ao_can_async_send_store_4 +  3 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 >  4

{
        .store                  = ao_can_async_send_store_4 +  4 * 2,

        .count                  = 2
},

#endif

