tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_TX_4 >  5

{
        .store                  = ao_can_async_send_store_4 +  5 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 >  6

{
        .store                  = ao_can_async_send_store_4 +  6 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 >  7

{
        .store                  = ao_can_async_send_store_4 +  7 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 >  8

{
        .store                  = ao_can_async_send_store_4 +  8 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 >  9

{
        .store                  = ao_can_async_send_store_4 +  9 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 10

{
        .store                  = ao_can_async_send_store_4 + 10 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 11

{
        .store                  = ao_can_async_send_store_4 + 11 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 12

{
        .store                  = ao_can_async_send_store_4 + 12 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 13

{
        .store                  = ao_can_async_send_store_4 + 13 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 14

{
        .store                  = ao_can_async_send_store_4 + 14 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 15

{
        .store                  = ao_can_async_send_store_4 + 15 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 16

{
        .store                  = ao_can_async_send_store_4 + 16 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 17

{
        .store                  = ao_can_async_send_store_4 + 17 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 18

{
        .store                  = ao_can_async_send_store_4 + 18 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 19

{
        .store                  = ao_can_async_send_store_4 + 19 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 20

{
        .store                  = ao_can_async_send_store_4 + 20 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 21

{
        .store                  = ao_can_async_send_store_4 + 21 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 22

{
        .store                  = ao_can_async_send_store_4 + 22 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 23

{
        .store                  = ao_can_async_send_store_4 + 23 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 24

{
        .store                  = ao_can_async_send_store_4 + 24 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 25

{
        .store                  = ao_can_async_send_store_4 + 25 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 26

{
        .store                  = ao_can_async_send_store_4 + 26 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 27

{
        .store                  = ao_can_async_send_store_4 + 27 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 28

{
        .store                  = ao_can_async_send_store_4 + 28 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 29

{
        .store                  = ao_can_async_send_store_4 + 29 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 30

{
        .store                  = ao_can_async_send_store_4 + 30 * 2,

        .count                  = 2
},

#endif

#if AO_CAN_FIFOS_TX_4 > 31

{
        .store                  = ao_can_async_send_store_4 + 31 * 2,

        .count                  = 2
},

#endif

#endif

};

// ----------------------------------------------------------------------------

static  ao_async_t *            ao_can_async_started_store_4[AO_CAN_FIFOS_TX_4 + 2] =
{
        &ao_can_cond_change_wait_4.async,

        &ao_can_sem_take_4.async,

#if AO_CAN_FIFOS_TX_4 >  0

#if AO_CAN_FIFOS_TX_4 >  0

        &ao_can_async_send_4[ 0].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  1

        &ao_can_async_send_4[ 1].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  2

        &ao_can_async_send_4[ 2].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  3

        &ao_can_async_send_4[ 3].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  4

        &ao_can_async_send_4[ 4].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  5

        &ao_can_async_send_4[ 5].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  6

        &ao_can_async_send_4[ 6].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  7

        &ao_can_async_send_4[ 7].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  8

        &ao_can_async_send_4[ 8].async,

#endif

#if AO_CAN_FIFOS_TX_4 >  9

        &ao_can_async_send_4[ 9].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 10

        &ao_can_async_send_4[10].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 11

        &ao_can_async_send_4[11].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 12

        &ao_can_async_send_4[12].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 13

        &ao_can_async_send_4[13].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 14

        &ao_can_async_send_4[14].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 15

        &ao_can_async_send_4[15].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 16

        &ao_can_async_send_4[16].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 17

        &ao_can_async_send_4[17].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 18

        &ao_can_async_send_4[18].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 19

        &ao_can_async_send_4[19].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 20

        &ao_can_async_send_4[20].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 21

        &ao_can_async_send_4[21].async,

#endif

