tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_TX_4 > 22

        &ao_can_async_send_4[22].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 23

        &ao_can_async_send_4[23].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 24

        &ao_can_async_send_4[24].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 25

        &ao_can_async_send_4[25].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 26

        &ao_can_async_send_4[26].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 27

        &ao_can_async_send_4[27].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 28

        &ao_can_async_send_4[28].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 29

        &ao_can_async_send_4[29].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 30

        &ao_can_async_send_4[30].async,

#endif

#if AO_CAN_FIFOS_TX_4 > 31

        &ao_can_async_send_4[31].async,

#endif

#endif

};

static  ao_async_any_t          ao_can_async_started_4 =
{
        .store                  = ao_can_async_started_store_4,

        .count                  = 2 + AO_CAN_FIFOS_TX_4
};

// ----------------------------------------------------------------------------

void ao_can_change_4(uint32_t mode)
{
    // Assert.

    ao_assert
    (
        mode == 0 ||
        mode == 2 ||
        mode == 3 ||
        mode == 4 ||
        mode == 7
    );


    // Variables.

    ao_can_reg_t * const reg = ao_can_reg_4();


    // Ready.

    while (reg->con.bits.opmod != mode)
    {
        // Request.

        ao_cond_clear(&ao_can_cond_changed_4);

        reg->con.bits.reqop = mode;


        // Await.

        ao_cond_wait_begin( &ao_can_cond_changed_wait_4);

        ao_sem_take_begin(  &ao_can_sem_take_4);

        ao_await_any_forever
        (
            &ao_can_async_change_4
        );

        ao_sem_take_end(    &ao_can_sem_take_4);

        ao_cond_wait_end(   &ao_can_cond_changed_wait_4);


        // Stop.

        if (ao_can_sem_take_4.result)
        {
            ao_can_var_started_4 = false;
        }
    }
}

// ----------------------------------------------------------------------------

__attribute__ ((weak))
void ao_can_config_4()
{
    ao_can_config_baud_4();

    ao_can_config_fifos_4();

    ao_can_config_filter_masks_4();

    ao_can_config_filters_4();
}

__attribute__ ((weak))
void ao_can_config_baud_4()
{
    // Variables.

    ao_can_baud_t x;


    // Ready.

    x.f                 = AO_CAN_BAUD_4;

    x.f_pbclk           = AO_SYS_CLOCK_CAN4;

    x.sample            = AO_CAN_BAUD_SAMPLE_4;

    x.sample_thrice     = AO_CAN_BAUD_SAMPLE_THRICE_4;

    x.sjw               = AO_CAN_BAUD_SJW_4;

    x.wake_up_filter    = AO_CAN_BAUD_WAKE_UP_FILTER_4;

    ao_can_baud(&x);

    ao_assert(x.result);

    C4CFG = x.cfg;
}

__attribute__ ((weak))
void ao_can_config_fifos_4()
{
    // Fifo base address.

    C4FIFOBA = KVA_TO_PA(ao_can_buffers_4);


    // Fifos.

#if AO_CAN_FIFOS_4 > 0

#if AO_CAN_FIFOS_4 > 0

    C4FIFOCON0bits.FSIZE = AO_CAN_BUFFERS_4_0 - 1;

#endif

#if AO_CAN_FIFOS_4 > 1

    C4FIFOCON1bits.FSIZE = AO_CAN_BUFFERS_4_1 - 1;

#endif

#if AO_CAN_FIFOS_4 > 2

    C4FIFOCON2bits.FSIZE = AO_CAN_BUFFERS_4_2 - 1;

#endif

#if AO_CAN_FIFOS_4 > 3

    C4FIFOCON3bits.FSIZE = AO_CAN_BUFFERS_4_3 - 1;

#endif

#if AO_CAN_FIFOS_4 > 4

    C4FIFOCON4bits.FSIZE = AO_CAN_BUFFERS_4_4 - 1;

#endif

#if AO_CAN_FIFOS_4 > 5

    C4FIFOCON5bits.FSIZE = AO_CAN_BUFFERS_4_5 - 1;

#endif

#if AO_CAN_FIFOS_4 > 6

    C4FIFOCON6bits.FSIZE = AO_CAN_BUFFERS_4_6 - 1;

#endif

#if AO_CAN_FIFOS_4 > 7

    C4FIFOCON7bits.FSIZE = AO_CAN_BUFFERS_4_7 - 1;

#endif

#if AO_CAN_FIFOS_4 > 8

    C4FIFOCON8bits.FSIZE = AO_CAN_BUFFERS_4_8 - 1;

#endif

#if AO_CAN_FIFOS_4 > 9

    C4FIFOCON9bits.FSIZE = AO_CAN_BUFFERS_4_9 - 1;

#endif

#if AO_CAN_FIFOS_4 > 10

    C4FIFOCON10bits.FSIZE = AO_CAN_BUFFERS_4_10 - 1;

#endif

#if AO_CAN_FIFOS_4 > 11

    C4FIFOCON11bits.FSIZE = AO_CAN_BUFFERS_4_11 - 1;

#endif

#if AO_CAN_FIFOS_4 > 12

    C4FIFOCON12bits.FSIZE = AO_CAN_BUFFERS_4_12 - 1;

#endif

#if AO_CAN_FIFOS_4 > 13

    C4FIFOCON13bits.FSIZE = AO_CAN_BUFFERS_4_13 - 1;

#endif

#if AO_CAN_FIFOS_4 > 14

    C4FIFOCON14bits.FSIZE = AO_CAN_BUFFERS_4_14 - 1;

#endif

#if AO_CAN_FIFOS_4 > 15

    C4FIFOCON15bits.FSIZE = AO_CAN_BUFFERS_4_15 - 1;

#endif

#if AO_CAN_FIFOS_4 > 16

    C4FIFOCON16bits.FSIZE = AO_CAN_BUFFERS_4_16 - 1;

#endif

#if AO_CAN_FIFOS_4 > 17

    C4FIFOCON17bits.FSIZE = AO_CAN_BUFFERS_4_17 - 1;

#endif

#if AO_CAN_FIFOS_4 > 18

    C4FIFOCON18bits.FSIZE = AO_CAN_BUFFERS_4_18 - 1;

#endif

#if AO_CAN_FIFOS_4 > 19

    C4FIFOCON19bits.FSIZE = AO_CAN_BUFFERS_4_19 - 1;

#endif

#if AO_CAN_FIFOS_4 > 20

    C4FIFOCON20bits.FSIZE = AO_CAN_BUFFERS_4_20 - 1;

#endif

#if AO_CAN_FIFOS_4 > 21

    C4FIFOCON21bits.FSIZE = AO_CAN_BUFFERS_4_21 - 1;

#endif

#if AO_CAN_FIFOS_4 > 22

    C4FIFOCON22bits.FSIZE = AO_CAN_BUFFERS_4_22 - 1;

#endif

#if AO_CAN_FIFOS_4 > 23

    C4FIFOCON23bits.FSIZE = AO_CAN_BUFFERS_4_23 - 1;

#endif

#if AO_CAN_FIFOS_4 > 24

    C4FIFOCON24bits.FSIZE = AO_CAN_BUFFERS_4_24 - 1;

#endif

#if AO_CAN_FIFOS_4 > 25

    C4FIFOCON25bits.FSIZE = AO_CAN_BUFFERS_4_25 - 1;

#endif

#if AO_CAN_FIFOS_4 > 26

    C4FIFOCON26bits.FSIZE = AO_CAN_BUFFERS_4_26 - 1;

#endif

#if AO_CAN_FIFOS_4 > 27

    C4FIFOCON27bits.FSIZE = AO_CAN_BUFFERS_4_27 - 1;

#endif

#if AO_CAN_FIFOS_4 > 28

    C4FIFOCON28bits.FSIZE = AO_CAN_BUFFERS_4_28 - 1;

#endif

#if AO_CAN_FIFOS_4 > 29

    C4FIFOCON29bits.FSIZE = AO_CAN_BUFFERS_4_29 - 1;

#endif

#if AO_CAN_FIFOS_4 > 30

    C4FIFOCON30bits.FSIZE = AO_CAN_BUFFERS_4_30 - 1;

#endif

#if AO_CAN_FIFOS_4 > 31

    C4FIFOCON31bits.FSIZE = AO_CAN_BUFFERS_4_31 - 1;

#endif

#endif

}

__attribute__ ((weak))
void ao_can_config_filter_masks_4()
{
    C4RXM0bits.EID  = AO_CAN_FILTER_MASK_EID_4_0;
    C4RXM0bits.MIDE = AO_CAN_FILTER_MASK_IDE_4_0;
    C4RXM0bits.SID  = AO_CAN_FILTER_MASK_SID_4_0;

    C4RXM1bits.EID  = AO_CAN_FILTER_MASK_EID_4_1;
    C4RXM1bits.MIDE = AO_CAN_FILTER_MASK_IDE_4_1;
    C4RXM1bits.SID  = AO_CAN_FILTER_MASK_SID_4_1;

    C4RXM2bits.EID  = AO_CAN_FILTER_MASK_EID_4_2;
    C4RXM2bits.MIDE = AO_CAN_FILTER_MASK_IDE_4_2;
    C4RXM2bits.SID  = AO_CAN_FILTER_MASK_SID_4_2;

    C4RXM3bits.EID  = AO_CAN_FILTER_MASK_EID_4_3;
    C4RXM3bits.MIDE = AO_CAN_FILTER_MASK_IDE_4_3;
    C4RXM3bits.SID  = AO_CAN_FILTER_MASK_SID_4_3;
}

__attribute__ ((weak))
void ao_can_config_filters_4()
{

