tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FILTER_ENABLE_4_0

    C4RXF0bits.EID          = AO_CAN_FILTER_EID_4_0;
    C4RXF0bits.EXID         = AO_CAN_FILTER_IDE_4_0;
    C4RXF0bits.SID          = AO_CAN_FILTER_SID_4_0;
    C4FLTCON0bits.FSEL0     = AO_CAN_FILTER_FIFO_4_0;
    C4FLTCON0bits.MSEL0     = AO_CAN_FILTER_MASK_4_0;
    C4FLTCON0bits.FLTEN0    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_1

    C4RXF1bits.EID          = AO_CAN_FILTER_EID_4_1;
    C4RXF1bits.EXID         = AO_CAN_FILTER_IDE_4_1;
    C4RXF1bits.SID          = AO_CAN_FILTER_SID_4_1;
    C4FLTCON0bits.FSEL1     = AO_CAN_FILTER_FIFO_4_1;
    C4FLTCON0bits.MSEL1     = AO_CAN_FILTER_MASK_4_1;
    C4FLTCON0bits.FLTEN1    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_2

    C4RXF2bits.EID          = AO_CAN_FILTER_EID_4_2;
    C4RXF2bits.EXID         = AO_CAN_FILTER_IDE_4_2;
    C4RXF2bits.SID          = AO_CAN_FILTER_SID_4_2;
    C4FLTCON0bits.FSEL2     = AO_CAN_FILTER_FIFO_4_2;
    C4FLTCON0bits.MSEL2     = AO_CAN_FILTER_MASK_4_2;
    C4FLTCON0bits.FLTEN2    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_3

    C4RXF3bits.EID          = AO_CAN_FILTER_EID_4_3;
    C4RXF3bits.EXID         = AO_CAN_FILTER_IDE_4_3;
    C4RXF3bits.SID          = AO_CAN_FILTER_SID_4_3;
    C4FLTCON0bits.FSEL3     = AO_CAN_FILTER_FIFO_4_3;
    C4FLTCON0bits.MSEL3     = AO_CAN_FILTER_MASK_4_3;
    C4FLTCON0bits.FLTEN3    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_4

    C4RXF4bits.EID          = AO_CAN_FILTER_EID_4_4;
    C4RXF4bits.EXID         = AO_CAN_FILTER_IDE_4_4;
    C4RXF4bits.SID          = AO_CAN_FILTER_SID_4_4;
    C4FLTCON1bits.FSEL4     = AO_CAN_FILTER_FIFO_4_4;
    C4FLTCON1bits.MSEL4     = AO_CAN_FILTER_MASK_4_4;
    C4FLTCON1bits.FLTEN4    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_5

    C4RXF5bits.EID          = AO_CAN_FILTER_EID_4_5;
    C4RXF5bits.EXID         = AO_CAN_FILTER_IDE_4_5;
    C4RXF5bits.SID          = AO_CAN_FILTER_SID_4_5;
    C4FLTCON1bits.FSEL5     = AO_CAN_FILTER_FIFO_4_5;
    C4FLTCON1bits.MSEL5     = AO_CAN_FILTER_MASK_4_5;
    C4FLTCON1bits.FLTEN5    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_6

    C4RXF6bits.EID          = AO_CAN_FILTER_EID_4_6;
    C4RXF6bits.EXID         = AO_CAN_FILTER_IDE_4_6;
    C4RXF6bits.SID          = AO_CAN_FILTER_SID_4_6;
    C4FLTCON1bits.FSEL6     = AO_CAN_FILTER_FIFO_4_6;
    C4FLTCON1bits.MSEL6     = AO_CAN_FILTER_MASK_4_6;
    C4FLTCON1bits.FLTEN6    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_7

    C4RXF7bits.EID          = AO_CAN_FILTER_EID_4_7;
    C4RXF7bits.EXID         = AO_CAN_FILTER_IDE_4_7;
    C4RXF7bits.SID          = AO_CAN_FILTER_SID_4_7;
    C4FLTCON1bits.FSEL7     = AO_CAN_FILTER_FIFO_4_7;
    C4FLTCON1bits.MSEL7     = AO_CAN_FILTER_MASK_4_7;
    C4FLTCON1bits.FLTEN7    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_8

    C4RXF8bits.EID          = AO_CAN_FILTER_EID_4_8;
    C4RXF8bits.EXID         = AO_CAN_FILTER_IDE_4_8;
    C4RXF8bits.SID          = AO_CAN_FILTER_SID_4_8;
    C4FLTCON2bits.FSEL8     = AO_CAN_FILTER_FIFO_4_8;
    C4FLTCON2bits.MSEL8     = AO_CAN_FILTER_MASK_4_8;
    C4FLTCON2bits.FLTEN8    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_9

    C4RXF9bits.EID          = AO_CAN_FILTER_EID_4_9;
    C4RXF9bits.EXID         = AO_CAN_FILTER_IDE_4_9;
    C4RXF9bits.SID          = AO_CAN_FILTER_SID_4_9;
    C4FLTCON2bits.FSEL9     = AO_CAN_FILTER_FIFO_4_9;
    C4FLTCON2bits.MSEL9     = AO_CAN_FILTER_MASK_4_9;
    C4FLTCON2bits.FLTEN9    = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_10

    C4RXF10bits.EID         = AO_CAN_FILTER_EID_4_10;
    C4RXF10bits.EXID        = AO_CAN_FILTER_IDE_4_10;
    C4RXF10bits.SID         = AO_CAN_FILTER_SID_4_10;
    C4FLTCON2bits.FSEL10    = AO_CAN_FILTER_FIFO_4_10;
    C4FLTCON2bits.MSEL10    = AO_CAN_FILTER_MASK_4_10;
    C4FLTCON2bits.FLTEN10   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_11

    C4RXF11bits.EID         = AO_CAN_FILTER_EID_4_11;
    C4RXF11bits.EXID        = AO_CAN_FILTER_IDE_4_11;
    C4RXF11bits.SID         = AO_CAN_FILTER_SID_4_11;
    C4FLTCON2bits.FSEL11    = AO_CAN_FILTER_FIFO_4_11;
    C4FLTCON2bits.MSEL11    = AO_CAN_FILTER_MASK_4_11;
    C4FLTCON2bits.FLTEN11   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_12

    C4RXF12bits.EID         = AO_CAN_FILTER_EID_4_12;
    C4RXF12bits.EXID        = AO_CAN_FILTER_IDE_4_12;
    C4RXF12bits.SID         = AO_CAN_FILTER_SID_4_12;
    C4FLTCON3bits.FSEL12    = AO_CAN_FILTER_FIFO_4_12;
    C4FLTCON3bits.MSEL12    = AO_CAN_FILTER_MASK_4_12;
    C4FLTCON3bits.FLTEN12   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_13

    C4RXF13bits.EID         = AO_CAN_FILTER_EID_4_13;
    C4RXF13bits.EXID        = AO_CAN_FILTER_IDE_4_13;
    C4RXF13bits.SID         = AO_CAN_FILTER_SID_4_13;
    C4FLTCON3bits.FSEL13    = AO_CAN_FILTER_FIFO_4_13;
    C4FLTCON3bits.MSEL13    = AO_CAN_FILTER_MASK_4_13;
    C4FLTCON3bits.FLTEN13   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_14

    C4RXF14bits.EID         = AO_CAN_FILTER_EID_4_14;
    C4RXF14bits.EXID        = AO_CAN_FILTER_IDE_4_14;
    C4RXF14bits.SID         = AO_CAN_FILTER_SID_4_14;
    C4FLTCON3bits.FSEL14    = AO_CAN_FILTER_FIFO_4_14;
    C4FLTCON3bits.MSEL14    = AO_CAN_FILTER_MASK_4_14;
    C4FLTCON3bits.FLTEN14   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_15

    C4RXF15bits.EID         = AO_CAN_FILTER_EID_4_15;
    C4RXF15bits.EXID        = AO_CAN_FILTER_IDE_4_15;
    C4RXF15bits.SID         = AO_CAN_FILTER_SID_4_15;
    C4FLTCON3bits.FSEL15    = AO_CAN_FILTER_FIFO_4_15;
    C4FLTCON3bits.MSEL15    = AO_CAN_FILTER_MASK_4_15;
    C4FLTCON3bits.FLTEN15   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_16

    C4RXF16bits.EID         = AO_CAN_FILTER_EID_4_16;
    C4RXF16bits.EXID        = AO_CAN_FILTER_IDE_4_16;
    C4RXF16bits.SID         = AO_CAN_FILTER_SID_4_16;
    C4FLTCON4bits.FSEL16    = AO_CAN_FILTER_FIFO_4_16;
    C4FLTCON4bits.MSEL16    = AO_CAN_FILTER_MASK_4_16;
    C4FLTCON4bits.FLTEN16   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_17

    C4RXF17bits.EID         = AO_CAN_FILTER_EID_4_17;
    C4RXF17bits.EXID        = AO_CAN_FILTER_IDE_4_17;
    C4RXF17bits.SID         = AO_CAN_FILTER_SID_4_17;
    C4FLTCON4bits.FSEL17    = AO_CAN_FILTER_FIFO_4_17;
    C4FLTCON4bits.MSEL17    = AO_CAN_FILTER_MASK_4_17;
    C4FLTCON4bits.FLTEN17   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_18

