tinko26/ao/sys/ao_sys_xc32_pic32.c
    C4RXF18bits.EID         = AO_CAN_FILTER_EID_4_18;
    C4RXF18bits.EXID        = AO_CAN_FILTER_IDE_4_18;
    C4RXF18bits.SID         = AO_CAN_FILTER_SID_4_18;
    C4FLTCON4bits.FSEL18    = AO_CAN_FILTER_FIFO_4_18;
    C4FLTCON4bits.MSEL18    = AO_CAN_FILTER_MASK_4_18;
    C4FLTCON4bits.FLTEN18   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_19

    C4RXF19bits.EID         = AO_CAN_FILTER_EID_4_19;
    C4RXF19bits.EXID        = AO_CAN_FILTER_IDE_4_19;
    C4RXF19bits.SID         = AO_CAN_FILTER_SID_4_19;
    C4FLTCON4bits.FSEL19    = AO_CAN_FILTER_FIFO_4_19;
    C4FLTCON4bits.MSEL19    = AO_CAN_FILTER_MASK_4_19;
    C4FLTCON4bits.FLTEN19   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_20

    C4RXF20bits.EID         = AO_CAN_FILTER_EID_4_20;
    C4RXF20bits.EXID        = AO_CAN_FILTER_IDE_4_20;
    C4RXF20bits.SID         = AO_CAN_FILTER_SID_4_20;
    C4FLTCON5bits.FSEL20    = AO_CAN_FILTER_FIFO_4_20;
    C4FLTCON5bits.MSEL20    = AO_CAN_FILTER_MASK_4_20;
    C4FLTCON5bits.FLTEN20   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_21

    C4RXF21bits.EID         = AO_CAN_FILTER_EID_4_21;
    C4RXF21bits.EXID        = AO_CAN_FILTER_IDE_4_21;
    C4RXF21bits.SID         = AO_CAN_FILTER_SID_4_21;
    C4FLTCON5bits.FSEL21    = AO_CAN_FILTER_FIFO_4_21;
    C4FLTCON5bits.MSEL21    = AO_CAN_FILTER_MASK_4_21;
    C4FLTCON5bits.FLTEN21   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_22

    C4RXF22bits.EID         = AO_CAN_FILTER_EID_4_22;
    C4RXF22bits.EXID        = AO_CAN_FILTER_IDE_4_22;
    C4RXF22bits.SID         = AO_CAN_FILTER_SID_4_22;
    C4FLTCON5bits.FSEL22    = AO_CAN_FILTER_FIFO_4_22;
    C4FLTCON5bits.MSEL22    = AO_CAN_FILTER_MASK_4_22;
    C4FLTCON5bits.FLTEN22   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_23

    C4RXF23bits.EID         = AO_CAN_FILTER_EID_4_23;
    C4RXF23bits.EXID        = AO_CAN_FILTER_IDE_4_23;
    C4RXF23bits.SID         = AO_CAN_FILTER_SID_4_23;
    C4FLTCON5bits.FSEL23    = AO_CAN_FILTER_FIFO_4_23;
    C4FLTCON5bits.MSEL23    = AO_CAN_FILTER_MASK_4_23;
    C4FLTCON5bits.FLTEN23   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_24

    C4RXF24bits.EID         = AO_CAN_FILTER_EID_4_24;
    C4RXF24bits.EXID        = AO_CAN_FILTER_IDE_4_24;
    C4RXF24bits.SID         = AO_CAN_FILTER_SID_4_24;
    C4FLTCON6bits.FSEL24    = AO_CAN_FILTER_FIFO_4_24;
    C4FLTCON6bits.MSEL24    = AO_CAN_FILTER_MASK_4_24;
    C4FLTCON6bits.FLTEN24   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_25

    C4RXF25bits.EID         = AO_CAN_FILTER_EID_4_25;
    C4RXF25bits.EXID        = AO_CAN_FILTER_IDE_4_25;
    C4RXF25bits.SID         = AO_CAN_FILTER_SID_4_25;
    C4FLTCON6bits.FSEL25    = AO_CAN_FILTER_FIFO_4_25;
    C4FLTCON6bits.MSEL25    = AO_CAN_FILTER_MASK_4_25;
    C4FLTCON6bits.FLTEN25   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_26

    C4RXF26bits.EID         = AO_CAN_FILTER_EID_4_26;
    C4RXF26bits.EXID        = AO_CAN_FILTER_IDE_4_26;
    C4RXF26bits.SID         = AO_CAN_FILTER_SID_4_26;
    C4FLTCON6bits.FSEL26    = AO_CAN_FILTER_FIFO_4_26;
    C4FLTCON6bits.MSEL26    = AO_CAN_FILTER_MASK_4_26;
    C4FLTCON6bits.FLTEN26   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_27

    C4RXF27bits.EID         = AO_CAN_FILTER_EID_4_27;
    C4RXF27bits.EXID        = AO_CAN_FILTER_IDE_4_27;
    C4RXF27bits.SID         = AO_CAN_FILTER_SID_4_27;
    C4FLTCON6bits.FSEL27    = AO_CAN_FILTER_FIFO_4_27;
    C4FLTCON6bits.MSEL27    = AO_CAN_FILTER_MASK_4_27;
    C4FLTCON6bits.FLTEN27   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_28

    C4RXF28bits.EID         = AO_CAN_FILTER_EID_4_28;
    C4RXF28bits.EXID        = AO_CAN_FILTER_IDE_4_28;
    C4RXF28bits.SID         = AO_CAN_FILTER_SID_4_28;
    C4FLTCON7bits.FSEL28    = AO_CAN_FILTER_FIFO_4_28;
    C4FLTCON7bits.MSEL28    = AO_CAN_FILTER_MASK_4_28;
    C4FLTCON7bits.FLTEN28   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_29

    C4RXF29bits.EID         = AO_CAN_FILTER_EID_4_29;
    C4RXF29bits.EXID        = AO_CAN_FILTER_IDE_4_29;
    C4RXF29bits.SID         = AO_CAN_FILTER_SID_4_29;
    C4FLTCON7bits.FSEL29    = AO_CAN_FILTER_FIFO_4_29;
    C4FLTCON7bits.MSEL29    = AO_CAN_FILTER_MASK_4_29;
    C4FLTCON7bits.FLTEN29   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_30

    C4RXF30bits.EID         = AO_CAN_FILTER_EID_4_30;
    C4RXF30bits.EXID        = AO_CAN_FILTER_IDE_4_30;
    C4RXF30bits.SID         = AO_CAN_FILTER_SID_4_30;
    C4FLTCON7bits.FSEL30    = AO_CAN_FILTER_FIFO_4_30;
    C4FLTCON7bits.MSEL30    = AO_CAN_FILTER_MASK_4_30;
    C4FLTCON7bits.FLTEN30   = 1;

#endif

#if AO_CAN_FILTER_ENABLE_4_31

    C4RXF31bits.EID         = AO_CAN_FILTER_EID_4_31;
    C4RXF31bits.EXID        = AO_CAN_FILTER_IDE_4_31;
    C4RXF31bits.SID         = AO_CAN_FILTER_SID_4_31;
    C4FLTCON7bits.FSEL31    = AO_CAN_FILTER_FIFO_4_31;
    C4FLTCON7bits.MSEL31    = AO_CAN_FILTER_MASK_4_31;
    C4FLTCON7bits.FLTEN31   = 1;

#endif

}

// ----------------------------------------------------------------------------

void ao_can_ir_4()
{
    // Variables.

    ao_can_t *          c1;
    ao_can_t *          c2;

    ao_can_fifo_flags_t f;

    uint32_t            i1;
    uint32_t            i2;

    uint32_t            m;

    uint32_t            r;

    ao_can_reg_t *      reg = ao_can_reg_4();

    ao_time_t           t;


    // Ready.

    do
    {
        t = ao_now();

        i1 = reg->vec.bits.icode;

        ao_ir_can4_reply();

        switch (i1)
        {

#if AO_CAN_INVALID_4

            case 0b1001000:

                // Invalid message received.

                ao_can_invalid_4(&ao_can_invalid_info_4);

                reg->intx.bits.ivrif = 0;

                break;

#endif

                // Mode changed.

            case 0b1000111:

#if AO_CAN_MODE_4

                ao_can_mode_4(&ao_can_mode_info_4);

#endif

                ao_cond_set(&ao_can_cond_changed_4);

                reg->intx.bits.modif = 0;

                break;

#if AO_CAN_TIMER_4

            case 0b1000110:

                // Timer.

                ao_can_timer_4(&ao_can_timer_info_4);

                reg->intx.bits.ctmrif = 0;

                break;

#endif

            case 0b1000101:
            case 0b1000100:

                // System error.

