tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_SYSTEM_4

                ao_can_system_info_4.flags = (ao_can_system_flags_t) i1;

                ao_can_system_4(&ao_can_system_info_4);

#endif

                reg->con.bits.on = 0;

                while (reg->con.bits.canbusy) { }

                reg->con.bits.on = 1;

                break;

#if AO_CAN_RBOV_4

            case 0b1000011:

                // Receive buffer overrun.

                r = reg->rxovf.reg;

                m = (AO_CAN_FIFOS_TX_4 == 32) ? UINT32_MAX : (1 << AO_CAN_FIFOS_TX_4) - 1;

#if AO_CAN_RXOF_4

                f = (ao_can_fifo_flags_t) (r & ~m);

                if (f != AO_CAN_FIFO_FLAGS_NONE)
                {
                    ao_can_overflow_info_4.fifos = f;

                    ao_can_overflow_info_4.fifos_rx = (ao_can_fifo_flags_t) ((uint32_t) f >> AO_CAN_FIFOS_TX_4);

                    ao_can_overflow_4(&ao_can_overflow_info_4);
                }

#endif

#if AO_CAN_TXUF_4

                f = (ao_can_fifo_flags_t) (r & m);

                if (f != AO_CAN_FIFO_FLAGS_NONE)
                {
                    ao_can_underflow_info_4.fifos = f;

                    ao_can_underflow_info_4.fifos_tx = f;

                    ao_can_underflow_4(&ao_can_underflow_info_4);
                }

#endif

                // DS61154.

                // Section 34.12.1.17.

                // Clearing all the CxFIFOINTn.RXOVFLIF bits will automatically
                // clear the CxINT.RBOVIF bit.

                while (r)
                {
                    i2 = ao_ffs(r);

                    m = 1 << i2;

                    r = r & ~m;

                    reg->fifo[i2].intx.bits.rxovflif = 0;
                }

                // DS61154.

                // Section 34.12.1.17: The CxINT.RBOVIF bit is not directly clearable.

                // Section 34.3.4    : The CxINT.RBOVIF bit is writable.

                reg->intx.bits.rbovif = 0;

                break;

#endif

#if AO_CAN_WAKE_UP_4

            case 0b1000010:

                // Wake up.

                ao_can_wake_up_4(&ao_can_wake_up_info_4);

                reg->intx.bits.wakif = 0;

                break;

#endif

#if AO_CAN_BUS_4

            case 0b1000001:

                // CAN bus error.

                ao_can_bus_info_4.receive_error_counter = reg->trec.bits.rerrcnt;

                if (reg->trec.bits.rxbp)
                {
                    ao_can_bus_info_4.receive_error_state = AO_CAN_BUS_PASSIVE;
                }

                else if (reg->trec.bits.rxwarn)
                {
                    ao_can_bus_info_4.receive_error_state = AO_CAN_BUS_ACTIVE_WARNING;
                }

                else
                {
                    ao_can_bus_info_4.receive_error_state = AO_CAN_BUS_ACTIVE;
                }

                ao_can_bus_info_4.transmit_error_counter = reg->trec.bits.terrcnt;

                if (reg->trec.bits.txbo)
                {
                    ao_can_bus_info_4.transmit_error_state = AO_CAN_BUS_OFF;
                }

                else if (reg->trec.bits.txbp)
                {
                    ao_can_bus_info_4.transmit_error_state = AO_CAN_BUS_PASSIVE;
                }

                else if (reg->trec.bits.txwarn)
                {
                    ao_can_bus_info_4.transmit_error_state = AO_CAN_BUS_ACTIVE_WARNING;
                }

                else
                {
                    ao_can_bus_info_4.transmit_error_state = AO_CAN_BUS_ACTIVE;
                }

                ao_can_bus_4(&ao_can_bus_info_4);

                reg->intx.bits.cerrif = 0;

                break;

#endif

            case 0b1000000:

                // No interrupt.

                break;

#if AO_CAN_RX_4

#if AO_CAN_FIFOS_4 > 31  &&  AO_CAN_FIFOS_TX_4 <= 31

            case 31:

#endif

#if AO_CAN_FIFOS_4 > 30  &&  AO_CAN_FIFOS_TX_4 <= 30

            case 30:

#endif

#if AO_CAN_FIFOS_4 > 29  &&  AO_CAN_FIFOS_TX_4 <= 29

            case 29:

#endif

#if AO_CAN_FIFOS_4 > 28  &&  AO_CAN_FIFOS_TX_4 <= 28

            case 28:

#endif

#if AO_CAN_FIFOS_4 > 27  &&  AO_CAN_FIFOS_TX_4 <= 27

            case 27:

#endif

#if AO_CAN_FIFOS_4 > 26  &&  AO_CAN_FIFOS_TX_4 <= 26

            case 26:

#endif

#if AO_CAN_FIFOS_4 > 25  &&  AO_CAN_FIFOS_TX_4 <= 25

            case 25:

#endif

#if AO_CAN_FIFOS_4 > 24  &&  AO_CAN_FIFOS_TX_4 <= 24

            case 24:

#endif

#if AO_CAN_FIFOS_4 > 23  &&  AO_CAN_FIFOS_TX_4 <= 23

            case 23:

#endif

#if AO_CAN_FIFOS_4 > 22  &&  AO_CAN_FIFOS_TX_4 <= 22

            case 22:

#endif

#if AO_CAN_FIFOS_4 > 21  &&  AO_CAN_FIFOS_TX_4 <= 21

            case 21:

#endif

#if AO_CAN_FIFOS_4 > 20  &&  AO_CAN_FIFOS_TX_4 <= 20

            case 20:

#endif

#if AO_CAN_FIFOS_4 > 19  &&  AO_CAN_FIFOS_TX_4 <= 19

            case 19:

#endif

#if AO_CAN_FIFOS_4 > 18  &&  AO_CAN_FIFOS_TX_4 <= 18

            case 18:

#endif

#if AO_CAN_FIFOS_4 > 17  &&  AO_CAN_FIFOS_TX_4 <= 17

            case 17:

#endif

#if AO_CAN_FIFOS_4 > 16  &&  AO_CAN_FIFOS_TX_4 <= 16

            case 16:

#endif

#if AO_CAN_FIFOS_4 > 15  &&  AO_CAN_FIFOS_TX_4 <= 15

            case 15:

#endif

#if AO_CAN_FIFOS_4 > 14  &&  AO_CAN_FIFOS_TX_4 <= 14

            case 14:

#endif

#if AO_CAN_FIFOS_4 > 13  &&  AO_CAN_FIFOS_TX_4 <= 13

            case 13:

#endif

#if AO_CAN_FIFOS_4 > 12  &&  AO_CAN_FIFOS_TX_4 <= 12

            case 12:

#endif

#if AO_CAN_FIFOS_4 > 11  &&  AO_CAN_FIFOS_TX_4 <= 11

            case 11:

#endif

#if AO_CAN_FIFOS_4 > 10  &&  AO_CAN_FIFOS_TX_4 <= 10

            case 10:

#endif

#if AO_CAN_FIFOS_4 >  9  &&  AO_CAN_FIFOS_TX_4 <=  9

            case  9:

#endif

#if AO_CAN_FIFOS_4 >  8  &&  AO_CAN_FIFOS_TX_4 <=  8

            case  8:

#endif

#if AO_CAN_FIFOS_4 >  7  &&  AO_CAN_FIFOS_TX_4 <=  7

            case  7:

#endif

#if AO_CAN_FIFOS_4 >  6  &&  AO_CAN_FIFOS_TX_4 <=  6

            case  6:

#endif

#if AO_CAN_FIFOS_4 >  5  &&  AO_CAN_FIFOS_TX_4 <=  5

            case  5:

#endif

#if AO_CAN_FIFOS_4 >  4  &&  AO_CAN_FIFOS_TX_4 <=  4

            case  4:

#endif

#if AO_CAN_FIFOS_4 >  3  &&  AO_CAN_FIFOS_TX_4 <=  3

            case  3:

#endif

