tinko26/ao/sys/ao_sys_xc32_pic32.c
#if AO_CAN_FIFOS_4 >  2  &&  AO_CAN_FIFOS_TX_4 <=  2

            case  2:

#endif

#if AO_CAN_FIFOS_4 >  1  &&  AO_CAN_FIFOS_TX_4 <=  1

            case  1:

#endif

#if AO_CAN_FIFOS_4 >  0  &&  AO_CAN_FIFOS_TX_4 <=  0

            case  0:

#endif

                c1 = PA_TO_KVA1(reg->fifo[i1].ua.reg);

                c2 = ao_can_in_can_4 + i1 - AO_CAN_FIFOS_TX_4;

                if (reg->fifo[i1].con.bits.donly)
                {
                    c2->cmsgsid = 0;

                    c2->cmsgeid = 0;

                    c2->data = *((uint64_t *) c1);
                }

                else
                {
                    *c2 = *c1;
                }

                if (!c2->ide && c2->srr)
                {
                    c2->rtr = 1;
                }

                ao_send_obj_try(ao_can_in_4 + i1 - AO_CAN_FIFOS_TX_4);

                // DS80000480.

                // The CxFIFOCONn.FRESET bit and the CxFIFOCONn.UINC
                // bit are not settable through a normal Special
                // Function Register (SFR) write.

                // Use the SET register operations to change the state
                // of these bits.

                reg->fifo[i1].con.set = _C4FIFOCON0_UINC_MASK;

                break;

#endif

#if AO_CAN_TX_4

#if AO_CAN_FIFOS_4 > 31  &&  AO_CAN_FIFOS_TX_4 > 31

            case 31:

#endif

#if AO_CAN_FIFOS_4 > 30  &&  AO_CAN_FIFOS_TX_4 > 30

            case 30:

#endif

#if AO_CAN_FIFOS_4 > 29  &&  AO_CAN_FIFOS_TX_4 > 29

            case 29:

#endif

#if AO_CAN_FIFOS_4 > 28  &&  AO_CAN_FIFOS_TX_4 > 28

            case 28:

#endif

#if AO_CAN_FIFOS_4 > 27  &&  AO_CAN_FIFOS_TX_4 > 27

            case 27:

#endif

#if AO_CAN_FIFOS_4 > 26  &&  AO_CAN_FIFOS_TX_4 > 26

            case 26:

#endif

#if AO_CAN_FIFOS_4 > 25  &&  AO_CAN_FIFOS_TX_4 > 25

            case 25:

#endif

#if AO_CAN_FIFOS_4 > 24  &&  AO_CAN_FIFOS_TX_4 > 24

            case 24:

#endif

#if AO_CAN_FIFOS_4 > 23  &&  AO_CAN_FIFOS_TX_4 > 23

            case 23:

#endif

#if AO_CAN_FIFOS_4 > 22  &&  AO_CAN_FIFOS_TX_4 > 22

            case 22:

#endif

#if AO_CAN_FIFOS_4 > 21  &&  AO_CAN_FIFOS_TX_4 > 21

            case 21:

#endif

#if AO_CAN_FIFOS_4 > 20  &&  AO_CAN_FIFOS_TX_4 > 20

            case 20:

#endif

#if AO_CAN_FIFOS_4 > 19  &&  AO_CAN_FIFOS_TX_4 > 19

            case 19:

#endif

#if AO_CAN_FIFOS_4 > 18  &&  AO_CAN_FIFOS_TX_4 > 18

            case 18:

#endif

#if AO_CAN_FIFOS_4 > 17  &&  AO_CAN_FIFOS_TX_4 > 17

            case 17:

#endif

#if AO_CAN_FIFOS_4 > 16  &&  AO_CAN_FIFOS_TX_4 > 16

            case 16:

#endif

#if AO_CAN_FIFOS_4 > 15  &&  AO_CAN_FIFOS_TX_4 > 15

            case 15:

#endif

#if AO_CAN_FIFOS_4 > 14  &&  AO_CAN_FIFOS_TX_4 > 14

            case 14:

#endif

#if AO_CAN_FIFOS_4 > 13  &&  AO_CAN_FIFOS_TX_4 > 13

            case 13:

#endif

#if AO_CAN_FIFOS_4 > 12  &&  AO_CAN_FIFOS_TX_4 > 12

            case 12:

#endif

#if AO_CAN_FIFOS_4 > 11  &&  AO_CAN_FIFOS_TX_4 > 11

            case 11:

#endif

#if AO_CAN_FIFOS_4 > 10  &&  AO_CAN_FIFOS_TX_4 > 10

            case 10:

#endif

#if AO_CAN_FIFOS_4 >  9  &&  AO_CAN_FIFOS_TX_4 >  9

            case  9:

#endif

#if AO_CAN_FIFOS_4 >  8  &&  AO_CAN_FIFOS_TX_4 >  8

            case  8:

#endif

#if AO_CAN_FIFOS_4 >  7  &&  AO_CAN_FIFOS_TX_4 >  7

            case  7:

#endif

#if AO_CAN_FIFOS_4 >  6  &&  AO_CAN_FIFOS_TX_4 >  6

            case  6:

#endif

#if AO_CAN_FIFOS_4 >  5  &&  AO_CAN_FIFOS_TX_4 >  5

            case  5:

#endif

#if AO_CAN_FIFOS_4 >  4  &&  AO_CAN_FIFOS_TX_4 >  4

            case  4:

#endif

#if AO_CAN_FIFOS_4 >  3  &&  AO_CAN_FIFOS_TX_4 >  3

            case  3:

#endif

#if AO_CAN_FIFOS_4 >  2  &&  AO_CAN_FIFOS_TX_4 >  2

            case  2:

#endif

#if AO_CAN_FIFOS_4 >  1  &&  AO_CAN_FIFOS_TX_4 >  1

            case  1:

#endif

#if AO_CAN_FIFOS_4 >  0  &&  AO_CAN_FIFOS_TX_4 >  0

            case  0:

#endif

                // Fifo.

#if AO_CAN_TXST_4

                if
                (
                    reg->fifo[i1].intx.bits.txemptyie &&
                    reg->fifo[i1].intx.bits.txemptyif
                )
                {
                    ao_can_sent_info_4.fifo = i1;

                    ao_can_sent_info_4.fifo_tx = i1;

                    ao_can_sent_4(&ao_can_sent_info_4);

                    reg->fifo[i1].intx.bits.txemptyie = 0;
                }

                if
                (
                    reg->fifo[i1].intx.bits.txnfullie &&
                    reg->fifo[i1].intx.bits.txnfullif
                )
                {

#endif

                    ao_cond_set(ao_can_cond_not_full_4 + i1);

                    reg->fifo[i1].intx.bits.txnfullie = 0;

#if AO_CAN_TXST_4

                }

#endif

                break;

#endif

            default:

                // This really should not have happend.

                ao_assert(false);

                break;
        }
    }
    while (i1 != 0b1000000);
}

// ----------------------------------------------------------------------------

void ao_can_listen_all_4()
{
    ao_can_var_mode_4 = 7;

    ao_cond_set(&ao_can_cond_change_4);
}

void ao_can_listen_only_4()
{
    ao_can_var_mode_4 = 3;

    ao_cond_set(&ao_can_cond_change_4);
}

void ao_can_loopback_4()
{
    ao_can_var_mode_4 = 2;

    ao_cond_set(&ao_can_cond_change_4);
}

void ao_can_normal_4()
{
    ao_can_var_mode_4 = 0;

    ao_cond_set(&ao_can_cond_change_4);
}

// ----------------------------------------------------------------------------

void ao_can_start_4()
{
    ao_task_start(&ao_can_task_4);
}

void ao_can_started_4()
{
    // Variables.

#if AO_CAN_TX_4

    ao_can_t *      c1;
    ao_can_t *      c2;

    size_t          i;

    ao_can_reg_t *  reg = ao_can_reg_4();

#endif


    // Ready.

    while (ao_can_var_started_4)
    {
        // Await begin.

        ao_cond_wait_begin(     &ao_can_cond_change_wait_4);

        ao_sem_take_begin(      &ao_can_sem_take_4);

#if AO_CAN_TX_4

        for (i = 0; i < AO_CAN_FIFOS_TX_4; i++)
        {
            ao_cond_wait_begin( &ao_can_cond_not_full_wait_4[i]);

            ao_recv_obj_begin(  &ao_can_out_4               [i]);

            ao_async_all_begin( &ao_can_async_send_4        [i]);
        }

#endif


