tinko26/ao/sys/ao_sys_xc32_pic32.c
        // Await.

        ao_await_any_forever(   &ao_can_async_started_4);


        // Await end.

#if AO_CAN_TX_4

        for (i = 0; i < AO_CAN_FIFOS_TX_4; i++)
        {
            ao_async_all_end(   &ao_can_async_send_4        [i]);

            ao_recv_obj_end(    &ao_can_out_4               [i]);

            ao_cond_wait_end(   &ao_can_cond_not_full_wait_4[i]);
        }

#endif

        ao_sem_take_end(        &ao_can_sem_take_4);

        ao_cond_wait_end(       &ao_can_cond_change_wait_4);


        // Stop.

        if (ao_can_sem_take_4.result)
        {
            ao_can_var_started_4 = false;
        }


        // Change.

        else if (ao_can_cond_change_wait_4.result)
        {
            ao_cond_clear(&ao_can_cond_change_4);

            ao_can_change_4(ao_can_var_mode_4);
        }


        // Out.

#if AO_CAN_TX_4

        else
        {
            for (i = 0; i < AO_CAN_FIFOS_TX_4; i++)
            {
                if
                (
                    ao_can_cond_not_full_wait_4 [i].result &&
                    ao_can_out_4                [i].result
                )
                {
                    c2 = ao_can_out_can_4 + i;

                    c1 = (ao_can_t *) PA_TO_KVA1(reg->fifo[i].ua.reg);

                    *c1 = *c2;


                    // DS61154.

                    // Section 34.7.1.

                    // Format of Transmit Message Buffer.

                    // Unused bits should be clear.

                    // RB0 and RB1 bits must be clear.

                    c1->cmsgeid &= 0x3FFFFE0F;
                    c1->cmsgsid &= 0x000007FF;


                    // In case of an extended message format,
                    // the SRR bit should be set.

                    if (c1->ide)
                    {
                        c1->srr = 1;
                    }


                    // DS80000480.

                    // The CxFIFOCONn.FRESET bit and the CxFIFOCONn.UINC bit
                    // are not settable through a normal Special Function
                    // Register (SFR) write.

                    // Use the SET register operations to change the state of
                    // these bits.

                    reg->fifo[i].con.set = _C4FIFOCON0_UINC_MASK;


#if AO_CAN_TXST_4

                    reg->fifo[i].intx.bits.txemptyie = 1;

#endif

                    if (reg->fifo[i].con.bits.rtren == 0)
                    {
                        if (reg->fifo[i].intx.bits.txnfullif == 0)
                        {
                            ao_cond_clear(ao_can_cond_not_full_4 + i);

                            reg->fifo[i].intx.bits.txnfullie = 1;
                        }

                        reg->fifo[i].con.set = _C4FIFOCON0_TXREQ_MASK;
                    }
                }
            }
        }

#endif

    }
}

void ao_can_starting_4()
{
    // Variables.

    uint32_t mode;


    // Ready.

    ao_can_var_started_4 = true;

    ao_cond_clear(&ao_can_cond_change_4);

    mode = ao_can_var_mode_4;

    ao_assert
    (
        mode == 0 ||
        mode == 2 ||
        mode == 3 ||
        mode == 7
    );

    ao_can_change_4(mode);
}

void ao_can_stop_4()
{
    ao_sem_give(&ao_can_sem_4, 1);
}

void ao_can_stopping_4()
{
    ao_can_change_4(4);
}

// ----------------------------------------------------------------------------

void ao_can_task_proc_4(void * x)
{
    // Variables.

    size_t          i;

    ao_can_reg_t *  reg = ao_can_reg_4();

    (void)          x;


    // Ready.

    while (1)
    {
        // On.

        reg->con.bits.on = 1;

        ao_assert(reg->con.bits.opmod == 4);


        // Configuration.

        ao_can_config_4();


        // Interrupts layer 3.

#if AO_CAN_RX_4

        for (i = AO_CAN_FIFOS_TX_4; i < AO_CAN_FIFOS_TX_4 + AO_CAN_FIFOS_RX_4; i++)
        {
            reg->fifo[i].con.bits.txen = 0;

            reg->fifo[i].intx.bits.rxnemptyie = 1;

#if AO_CAN_RXOF_4

            reg->fifo[i].intx.bits.rxovflie = 1;

#endif

        }

#endif

#if AO_CAN_TX_4

        for (i = 0; i < AO_CAN_FIFOS_TX_4; i++)
        {
            reg->fifo[i].con.bits.txen = 1;

            if (reg->fifo[i].con.bits.rtren)
            {

#if AO_CAN_TXUF_4

                reg->fifo[i].intx.bits.rxovflie = 1;

#endif

                ao_cond_set(&ao_can_cond_not_full_4[i]);
            }

            else
            {
                if (reg->fifo[i].intx.bits.txnfullif == 0)
                {
                    reg->fifo[i].intx.bits.txnfullie = 1;
                }

                else
                {
                    ao_cond_set(&ao_can_cond_not_full_4[i]);
                }
            }

#if AO_CAN_TXST_4

            if (reg->fifo[i].intx.bits.txemptyif) { }

            else
            {
                reg->fifo[i].intx.bits.txemptyie = 1;
            }

#endif

        }

#endif


        // Interrupts layer 2.

        reg->intx.bits.modie = 1;
        reg->intx.bits.serrie = 1;

#if AO_CAN_BUS_4

        reg->intx.bits.cerrie = 1;

#endif

#if AO_CAN_INVALID_4

        reg->intx.bits.ivrie = 1;

#endif

#if AO_CAN_RBOV_4

        reg->intx.bits.rbovie = 1;

#endif

#if AO_CAN_RX_4

        reg->intx.bits.rbie = 1;

#endif

#if AO_CAN_TIMER_4

        reg->intx.bits.ctmrie = 1;

#endif

#if AO_CAN_TX_4

        reg->intx.bits.tbie = 1;

#endif

#if AO_CAN_WAKE_UP_4

        reg->intx.bits.wakie = 1;

#endif


        // Interrupts layer 1.

        ao_ir_can4_enable();


        // Start.

        ao_can_starting_4();

        ao_can_started_4();


        // Stop.

        ao_can_stopping_4();


        // Interrupts layer 1.

        ao_ir_can4_disable();


        // Interrupts layer 2.

        reg->intx.bits.modie = 0;
        reg->intx.bits.serrie = 0;

#if AO_CAN_BUS_4

        reg->intx.bits.cerrie = 0;

#endif

#if AO_CAN_INVALID_4

        reg->intx.bits.ivrie = 0;

#endif

#if AO_CAN_RBOV_4

        reg->intx.bits.rbovie = 0;

#endif

#if AO_CAN_RX_4

