tinko26/ao/sys/ao_sys_xc32_pic32.c
        reg->intx.bits.rbie = 0;

#endif

#if AO_CAN_TIMER_4

        reg->intx.bits.ctmrie = 0;

#endif

#if AO_CAN_TX_4

        reg->intx.bits.tbie = 0;

#endif

#if AO_CAN_WAKE_UP_4

        reg->intx.bits.wakie = 0;

#endif


        // Interrupts layer 3.

#if AO_CAN_TX_4

        for (i = 0; i < AO_CAN_FIFOS_TX_4; i++)
        {

            reg->fifo[i].intx.bits.txnfullie = 0;

#if AO_CAN_TXUF_4

            reg->fifo[i].intx.bits.rxovflie = 0;

#endif

#if AO_CAN_TXST_4

            reg->fifo[i].intx.bits.txemptyie = 0;

#endif

        }

#endif

#if AO_CAN_RX_4

        for (i = AO_CAN_FIFOS_TX_4; i < AO_CAN_FIFOS_TX_4 + AO_CAN_FIFOS_RX_4; i++)
        {
            reg->fifo[i].intx.bits.rxnemptyie = 0;

#if AO_CAN_RXOF_4

            reg->fifo[i].intx.bits.rxovflie = 0;

#endif

        }

#endif


        // Off.

        reg->con.bits.on = 0;

        while (reg->con.bits.canbusy) { }


        // Task.

        ao_stop();
    }
}

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

#if defined AO_SYS_XC32_PIC32MK

#if defined AO_CAN_1 && AO_CAN_1

// ----------------------------------------------------------------------------

AO_IR_CAN1_ATTRIBUTE
void ao_ir_can1()
{
    ao_ir_stack_func0((ao_func0_t) ao_can_ir_1);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_CAN_2 && AO_CAN_2

// ----------------------------------------------------------------------------

AO_IR_CAN2_ATTRIBUTE
void ao_ir_can2()
{
    ao_ir_stack_func0((ao_func0_t) ao_can_ir_2);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_CAN_3 && AO_CAN_3

// ----------------------------------------------------------------------------

AO_IR_CAN3_ATTRIBUTE
void ao_ir_can3()
{
    ao_ir_stack_func0((ao_func0_t) ao_can_ir_3);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_CAN_4 && AO_CAN_4

// ----------------------------------------------------------------------------

AO_IR_CAN4_ATTRIBUTE
void ao_ir_can4()
{
    ao_ir_stack_func0((ao_func0_t) ao_can_ir_4);
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MX

#if defined AO_CAN_1 && AO_CAN_1

// ----------------------------------------------------------------------------

AO_IR_CAN1_ATTRIBUTE
void ao_ir_can1()
{
    ao_ir_stack_func0((ao_func0_t) ao_can_ir_1);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_CAN_2 && AO_CAN_2

// ----------------------------------------------------------------------------

AO_IR_CAN2_ATTRIBUTE
void ao_ir_can2()
{
    ao_ir_stack_func0((ao_func0_t) ao_can_ir_2);
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MZ

#if defined AO_CAN_1 && AO_CAN_1

// ----------------------------------------------------------------------------

AO_IR_CAN1_ATTRIBUTE
void ao_ir_can1()
{
    ao_ir_stack_func0((ao_func0_t) ao_can_ir_1);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_CAN_2 && AO_CAN_2

// ----------------------------------------------------------------------------

AO_IR_CAN2_ATTRIBUTE
void ao_ir_can2()
{
    ao_ir_stack_func0((ao_func0_t) ao_can_ir_2);
}

// ----------------------------------------------------------------------------

#endif

#endif

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32_I2C

#if defined AO_I2C

// ----------------------------------------------------------------------------

static  bool    ao_i2c_recving( ao_i2c_reg_t * r);

// ----------------------------------------------------------------------------

static  bool    ao_i2c_sending( ao_i2c_reg_t * r);

// ----------------------------------------------------------------------------

bool ao_i2c_ack(ao_i2c_reg_t * r, ao_time_t t)
{
    return ao_i2c_ack_from(r, t, ao_now());
}

bool ao_i2c_ack_from(ao_i2c_reg_t * r, ao_time_t t, ao_time_t b)
{
    // Assert.

    ao_assert(r);


    // Variables.

    ao_time_t   e;

    ao_time_t   x;

    bool        R1;
    bool        R2;
    bool        R3;


    // Ready.

    if (t == AO_INFINITY)
    {
        R3 = ao_i2c_ack_forever(r);
    }

    else
    {
        do
        {
            e = ao_now();

            x = e - b;

            t = t > x ? t - x : 0;

            b = e;

            R1 = (r->con.reg & 0x1F) ? true : false;
        }
        while (R1 && t > 0);

        if (R1) { }

        else
        {
            r->stat.bits.bcl = 0;

            r->con.bits.ackdt = 0;

            r->con.bits.acken = 1;

            do
            {
                e = ao_now();

                x = e - b;

                t = t > x ? t - x : 0;

                b = e;

                R1 = r->con.bits.acken ? true : false;

                R2 = r->stat.bits.bcl ? false : true;
            }
            while (R1 && R2 && t > 0);

            if (R2) { }

            else
            {
                R1 = true;
            }
        }

        R3 = !R1;
    }

    return R3;
}

bool ao_i2c_ack_forever(ao_i2c_reg_t * r)
{
    // Assert.

    ao_assert(r);


    // Variables.

    bool R1;
    bool R2;


    // Ready.

    while (r->con.reg & 0x1F) { }

    r->stat.bits.bcl = 0;

    r->con.bits.ackdt = 0;

    r->con.bits.acken = 1;

    do
    {
        R1 = r->con.bits.acken ? true : false;

        R2 = r->stat.bits.bcl ? false : true;
    }
    while (R1 && R2);

    return R2;
}

// ----------------------------------------------------------------------------

bool ao_i2c_acked(ao_i2c_reg_t const * r)
{
    ao_assert(r);

    return (r->stat.bits.ackstat == 0) ? true : false;
}

// ----------------------------------------------------------------------------

void ao_i2c_baud(ao_i2c_reg_t * r, uint32_t f_pbclk, uint32_t f)
{
    // Assert.

