tinko26/ao/sys/ao_sys_xc32_pic32.c
    ao_assert(r);

    ao_assert(f_pbclk);

    ao_assert(f);


    // Variables.

    uint64_t b;

    uint64_t t1;
    uint64_t t2;


    // Ready.

    // DS60001116.

    // TPGOB is nominally 130 ns.

    t1 = (uint64_t) f_pbclk;

    t2 = (uint64_t) f;

    b = t1;

    b = b * (1000000000ULL / f - 130ULL);

    b = b / 2000000000ULL;

    b = b - 1ULL;

    // DS60001116.

    // BRG values of 0 through 3 are expressly prohibited.

    // Do not program the register to any of these values, as indeterminate
    // results may occur.

    ao_assert(b >= 4);

    ao_assert(b <= AO_I2C_BRG_MAX);

    r->brg.reg = (uint32_t) b;
}

// ----------------------------------------------------------------------------

bool ao_i2c_nack(ao_i2c_reg_t * r, ao_time_t t)
{
    return ao_i2c_nack_from(r, t, ao_now());
}

bool ao_i2c_nack_from(ao_i2c_reg_t * r, ao_time_t t, ao_time_t b)
{
    // Assert.

    ao_assert(r);


    // Variables.

    ao_time_t   e;

    ao_time_t   x;

    bool        R1;
    bool        R2;
    bool        R3;


    // Ready.

    if (t == AO_INFINITY)
    {
        R3 = ao_i2c_nack_forever(r);
    }

    else
    {
        do
        {
            e = ao_now();

            x = e - b;

            t = t > x ? t - x : 0;

            b = e;

            R1 = (r->con.reg & 0x1F) ? true : false;
        }
        while (R1 && t > 0);

        if (R1) { }

        else
        {
            r->stat.bits.bcl = 0;

            r->con.bits.ackdt = 1;

            r->con.bits.acken = 1;

            do
            {
                e = ao_now();

                x = e - b;

                t = t > x ? t - x : 0;

                b = e;

                R1 = r->con.bits.acken ? true : false;

                R2 = r->stat.bits.bcl ? false : true;
            }
            while (R1 && R2 && t > 0);

            if (R2) { }

            else
            {
                R1 = true;
            }
        }

        R3 = !R1;
    }

    return R3;
}

bool ao_i2c_nack_forever(ao_i2c_reg_t * r)
{
    // Assert.

    ao_assert(r);


    // Variables.

    bool R1;
    bool R2;


    // Ready.

    while (r->con.reg & 0x1F) { }

    r->stat.bits.bcl = 0;

    r->con.bits.ackdt = 1;

    r->con.bits.acken = 1;

    do
    {
        R1 = r->con.bits.acken ? true : false;

        R2 = r->stat.bits.bcl ? false : true;
    }
    while (R1 && R2);

    return R2;
}

// ----------------------------------------------------------------------------

bool ao_i2c_nacked(ao_i2c_reg_t const * r)
{
    ao_assert(r);

    return (r->stat.bits.ackstat == 1) ? true : false;
}

// ----------------------------------------------------------------------------

bool ao_i2c_recv(ao_i2c_reg_t * r, uint8_t * v, ao_time_t t)
{
    return ao_i2c_recv_from(r, v, t, ao_now());
}

bool ao_i2c_recv_from(ao_i2c_reg_t * r, uint8_t * v, ao_time_t t, ao_time_t b)
{
    // Assert.

    ao_assert(r);

    ao_assert(v);


    // Variables.

    ao_time_t   e;

    ao_time_t   x;

    bool        R1;
    bool        R2;
    bool        R3;


    // Ready.

    if (t == AO_INFINITY)
    {
        R3 = ao_i2c_recv_forever(r, v);
    }

    else
    {
        R1 = r->stat.bits.rbf ? true : false;

        if (R1)
        {
            do
            {
                e = ao_now();

                x = e - b;

                t = t > x ? t - x : 0;

                b = e;

                *v = r->rcv.reg;

                R1 = r->stat.bits.rbf;
            }
            while (R1 && t > 0);
        }

        if (R1) { }

        else
        {
            r->stat.bits.i2cov = 0;

            do
            {
                e = ao_now();

                x = e - b;

                t = t > x ? t - x : 0;

                b = e;

                R1 = (r->con.reg & 0x1F) ? true : false;
            }
            while (R1 && t > 0);

            if (R1) { }

            else
            {
                r->stat.bits.bcl = 0;

                r->con.bits.rcen = 1;

                do
                {
                    e = ao_now();

                    x = e - b;

                    t = t > x ? t - x : 0;

                    b = e;

                    R1 = ao_i2c_recving(r);

                    R2 = r->stat.bits.bcl ? false : true;
                }
                while (R1 && R2 && t > 0);

                if (R1) { }

                else
                {
                    if (R2)
                    {
                        *v = r->rcv.reg;
                    }

                    else
                    {
                        R1 = true;
                    }
                }
            }
        }

        R3 = !R1;
    }

    return R3;
}

bool ao_i2c_recv_forever(ao_i2c_reg_t * r, uint8_t * v)
{
    // Assert.

    ao_assert(r);

    ao_assert(v);


    // Variables.

    bool R1;
    bool R2;


    // Ready.

    while (r->stat.bits.rbf)
    {
        *v = r->rcv.reg;
    }

    while (r->con.reg & 0x1F) { }

    r->stat.bits.bcl = 0;

    r->stat.bits.i2cov = 0;

    r->con.bits.rcen = 1;

    do
    {
        R1 = ao_i2c_recving(r);

        R2 = r->stat.bits.bcl ? false : true;
    }
    while (R1 && R2);

    if (R2)
    {
        *v = r->rcv.reg;
    }

    return R2;
}

// ----------------------------------------------------------------------------

bool ao_i2c_recving(ao_i2c_reg_t * r)
{
    if
    (
        r->con.bits.rcen    ||  // Reception in progress.

        !r->stat.bits.rbf       // Receive buffer not full.
    )
    {
        return true;
    }

    else
    {
        return false;
    }
}

// ----------------------------------------------------------------------------

bool ao_i2c_restart(ao_i2c_reg_t * r, ao_time_t t)
{
    return ao_i2c_restart_from(r, t, ao_now());
}

bool ao_i2c_restart_from(ao_i2c_reg_t * r, ao_time_t t, ao_time_t b)
{
    // Assert.

    ao_assert(r);


    // Variables.

    ao_time_t   e;

    ao_time_t   x;

    bool        R1;
    bool        R2;
    bool        R3;


    // Ready.

    if (t == AO_INFINITY)
    {
        R3 = ao_i2c_restart_forever(r);
    }

    else
    {
        do
        {
            e = ao_now();

            x = e - b;

