tinko26/ao/sys/ao_sys_xc32_pic32.c
            t = t > x ? t - x : 0;

            b = e;

            R1 = (r->con.reg & 0x1F) ? true : false;
        }
        while (R1 && t > 0);

        if (R1) { }

        else
        {
            r->stat.bits.bcl = 0;

            r->con.bits.rsen = 1;

            do
            {
                e = ao_now();

                x = e - b;

                t = t > x ? t - x : 0;

                b = e;

                R1 = r->con.bits.rsen ? true : false;

                R2 = r->stat.bits.bcl ? false : true;
            }
            while (R1 && R2 && t > 0);

            if (R2) { }

            else
            {
                R1 = true;
            }
        }

        R3 = !R1;
    }

    return R3;
}

bool ao_i2c_restart_forever(ao_i2c_reg_t * r)
{
    // Assert.

    ao_assert(r);


    // Variables.

    bool R1;
    bool R2;


    // Ready.

    while (r->con.reg & 0x1F) { }

    r->stat.bits.bcl = 0;

    r->con.bits.rsen = 1;

    do
    {
        R1 = r->con.bits.rsen ? true : false;

        R2 = r->stat.bits.bcl ? false : true;
    }
    while (R1 && R2);

    return R2;
}

// ----------------------------------------------------------------------------

bool ao_i2c_send(ao_i2c_reg_t * r, uint8_t v, ao_time_t t)
{
    return ao_i2c_send_from(r, v, t, ao_now());
}

bool ao_i2c_send_from(ao_i2c_reg_t * r, uint8_t v, ao_time_t t, ao_time_t b)
{
    // Assert.

    ao_assert(r);


    // Variables.

    ao_time_t   e;

    ao_time_t   x;

    bool        R1;
    bool        R2;
    bool        R3;
    bool        R4;


    // Ready.

    if (t == AO_INFINITY)
    {
        R4 = ao_i2c_send_forever(r, v);
    }

    else
    {
        do
        {
            e = ao_now();

            x = e - b;

            t = t > x ? t - x : 0;

            b = e;

            R1 = (r->con.reg & 0x1F) ? true : false;
        }
        while (R1 && t > 0);

        if (R1) { }

        else
        {
            r->stat.bits.bcl = 0;

            r->stat.bits.iwcol = 0;

            r->trn.reg = v;

            do
            {
                e = ao_now();

                x = e - b;

                t = t > x ? t - x : 0;

                b = e;

                R1 = ao_i2c_sending(r);

                R2 = r->stat.bits.iwcol ? false : true;

                R3 = r->stat.bits.bcl ? false : true;
            }
            while (R1 && R2 && R3 && t > 0);

            if (R2 && R3) { }

            else
            {
                R1 = true;
            }
        }

        R4 = !R1;
    }

    return R4;
}

bool ao_i2c_send_forever(ao_i2c_reg_t * r, uint8_t v)
{
    // Assert.

    ao_assert(r);


    // Variables.

    bool R1;
    bool R2;
    bool R3;


    // Ready.

    while (r->con.reg & 0x1F) { }

    r->stat.bits.bcl = 0;

    r->stat.bits.iwcol = 0;

    r->trn.reg = v;

    do
    {
        R1 = ao_i2c_sending(r);

        R2 = r->stat.bits.iwcol ? false : true;

        R3 = r->stat.bits.bcl ? false : true;
    }
    while (R1 && R2 && R3);

    return R2 && R3;
}

// ----------------------------------------------------------------------------

bool ao_i2c_sending(ao_i2c_reg_t * r)
{
    if
    (
        r->stat.bits.tbf    ||  // Transmit buffer full.

        r->stat.bits.trstat     // Transmission in progress.
    )
    {
        return true;
    }

    else
    {
        return false;
    }
}

// ----------------------------------------------------------------------------

bool ao_i2c_start(ao_i2c_reg_t * r, ao_time_t t)
{
    return ao_i2c_start_from(r, t, ao_now());
}

bool ao_i2c_start_from(ao_i2c_reg_t * r, ao_time_t t, ao_time_t b)
{
    // Assert.

    ao_assert(r);


    // Variables.

    ao_time_t   e;

    ao_time_t   x;

    bool        R1;
    bool        R2;
    bool        R3;


    // Ready.

    if (t == AO_INFINITY)
    {
        R3 = ao_i2c_start_forever(r);
    }

    else
    {
        do
        {
            e = ao_now();

            x = e - b;

            t = t > x ? t - x : 0;

            b = e;

            R1 = (r->con.reg & 0x1F) ? true : false;
        }
        while (R1 && t > 0);

        if (R1) { }

        else
        {
            r->stat.bits.bcl = 0;

            r->con.bits.sen = 1;

            do
            {
                e = ao_now();

                x = e - b;

                t = t > x ? t - x : 0;

                b = e;

                R1 = r->con.bits.sen ? true : false;

                R2 = r->stat.bits.bcl ? false : true;
            }
            while (R1 && R2 && t > 0);

            if (R2) { }

            else
            {
                R1 = true;
            }
        }

        R3 = !R1;
    }

    return R3;
}

bool ao_i2c_start_forever(ao_i2c_reg_t * r)
{
    // Assert.

    ao_assert(r);


    // Variables.

    bool R1;
    bool R2;


    // Ready.

    while (r->con.reg & 0x1F) { }

    r->stat.bits.bcl = 0;

    r->con.bits.sen = 1;

    do
    {
        R1 = r->con.bits.sen ? true : false;

        R2 = r->stat.bits.bcl ? false : true;
    }
    while (R1 && R2);

    return R2;
}

// ----------------------------------------------------------------------------

bool ao_i2c_stop(ao_i2c_reg_t * r, ao_time_t t)
{
    return ao_i2c_stop_from(r, t, ao_now());
}

bool ao_i2c_stop_from(ao_i2c_reg_t * r, ao_time_t t, ao_time_t b)
{
    // Assert.

    ao_assert(r);


    // Variables.

    ao_time_t   e;

    ao_time_t   x;

    bool        R1;
    bool        R2;
    bool        R3;


    // Ready.

    if (t == AO_INFINITY)
    {
        R3 = ao_i2c_stop_forever(r);
    }

    else
    {
        do
        {
            e = ao_now();

            x = e - b;

            t = t > x ? t - x : 0;

            b = e;

            R1 = (r->con.reg & 0x1F) ? true : false;
        }
        while (R1 && t > 0);

        if (R1) { }

        else
        {
            r->stat.bits.bcl = 0;

            r->con.bits.pen = 1;

            do
            {
                e = ao_now();

                x = e - b;

