tinko26/ao/sys/ao_sys_xc32_pic32.c
                t = t > x ? t - x : 0;

                b = e;

                R1 = r->con.bits.pen ? true : false;

                R2 = r->stat.bits.bcl ? false : true;
            }
            while (R1 && R2 && t > 0);

            if (R2) { }

            else
            {
                R1 = true;
            }
        }

        R3 = !R1;
    }

    return R3;
}

bool ao_i2c_stop_forever(ao_i2c_reg_t * r)
{
    // Assert.

    ao_assert(r);


    // Variables.

    bool R1;
    bool R2;


    // Ready.

    while (r->con.reg & 0x1F) { }

    r->stat.bits.bcl = 0;

    r->con.bits.pen = 1;

    do
    {
        R1 = r->con.bits.pen ? true : false;

        R2 = r->stat.bits.bcl ? false : true;
    }
    while (R1 && R2);

    return R2;
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32_SPI

#if defined AO_SPI

// ----------------------------------------------------------------------------

void ao_spi_baud(ao_spi_reg_t * r, uint32_t f_pbclk, uint32_t f)
{
    // Assert.

    ao_assert(r);

    ao_assert(f_pbclk > 0);

    ao_assert(f >= ao_spi_baud_min(f_pbclk));

    ao_assert(f <= ao_spi_baud_max(f_pbclk));


    // Ready.

    // If the peripheral bus clock is not an integer multiple of the desired baud rate, we cannot set up the latter exactly.

    // Then, we must ensure, that the actual baud rate does not exceed the desired baud rate.

    r->brg.reg = (f_pbclk - 1) / (2 * f);
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32_UART

#if defined AO_UART

// ----------------------------------------------------------------------------

static  void    ao_uart_ir_rx_1();

static  void    ao_uart_ir_rx_2();

static  void    ao_uart_ir_rx_3();

static  void    ao_uart_ir_rx_4();

static  void    ao_uart_ir_rx_5();

static  void    ao_uart_ir_rx_6();

// ----------------------------------------------------------------------------

static  void    ao_uart_ir_tx_1();

static  void    ao_uart_ir_tx_2();

static  void    ao_uart_ir_tx_3();

static  void    ao_uart_ir_tx_4();

static  void    ao_uart_ir_tx_5();

static  void    ao_uart_ir_tx_6();

// ----------------------------------------------------------------------------

#if defined AO_SYS_XC32_PIC32

// ----------------------------------------------------------------------------

#if defined AO_UART

// ----------------------------------------------------------------------------

void ao_uart_baud(ao_uart_reg_t * r, uint32_t f_pbclk, uint32_t f)
{

#if defined AO_SYS_XC32_PIC32MK_GP                                      ||  \
    defined AO_SYS_XC32_PIC32MX_1XX_XLP                                 ||  \
    defined AO_SYS_XC32_PIC32MZ_DA                                      ||  \
    defined AO_SYS_XC32_PIC32MZ_DAK                                     ||  \
    defined AO_SYS_XC32_PIC32MZ_EF

    // DS80000663.

    // DS80000736.

    // DS80000737.

    // DS80000739.

    // DS80000823.

    // The UART TX Stop bit duration is shorter than expected in High-Speed
    // mode (UxMODE.BRGH = 1) for baud rates less than 7.5 Mbps.

    // Workaround.

    // For baud rates less than 7.5 Mbps, operate the UART in Standard-Speed
    // mode, that is, UxMODE.BRGH = 0.

    // For baud rates greater than 7.5 Mbps, operate the UART in High-Speed
    // mode, that is, UxMODE.BRGH = 1.

    if (f < 7500000UL)
    {
        ao_uart_baud_low(r, f_pbclk, f);
    }

    else

#endif

    if (f <= ao_uart_baud_low_max(f_pbclk))
    {
        ao_uart_baud_low(r, f_pbclk, f);
    }

    else
    {
        ao_uart_baud_high(r, f_pbclk, f);
    }
}

void ao_uart_baud_high(ao_uart_reg_t * r, uint32_t f_pbclk, uint32_t f)
{
    // Assert.

    ao_assert(r);

    ao_assert(f_pbclk > 0);

    ao_assert(f >= ao_uart_baud_high_min(f_pbclk));
    ao_assert(f <= ao_uart_baud_high_max(f_pbclk));


    // Assert.

#if defined AO_SYS_XC32_PIC32MK_GP                                      ||  \
    defined AO_SYS_XC32_PIC32MX_1XX_XLP                                 ||  \
    defined AO_SYS_XC32_PIC32MZ_DA                                      ||  \
    defined AO_SYS_XC32_PIC32MZ_DAK                                     ||  \
    defined AO_SYS_XC32_PIC32MZ_EF

    // DS80000737.

    // DS80000739.

    // DS80000736.

    // DS80000823.

    // DS80000663.

    // The UART TX Stop bit duration is shorter than expected in High-Speed
    // mode (UxMODE.BRGH = 1) for baud rates less than 7.5 Mbps.

    // Workaround.

    // For baud rates less than 7.5 Mbps, operate the UART in Standard-Speed
    // mode, that is, UxMODE.BRGH = 0.

    // For baud rates greater than 7.5 Mbps, operate the UART in High-Speed
    // mode, that is, UxMODE.BRGH = 1.

    ao_assert(f >= 7500000UL);

#endif

#if defined AO_SYS_XC32_PIC32MX_3XX

    // DS80000440.

    // In BRGH = 1 mode, the received data is not sampled in the middle of the
    // bit.

    // This reduces the UART's baud rate mismatch tolerance.

    // Workaround.

    // Use BRGH = 0 mode.

    ao_assert(false);

#endif


    // Variables.

    uint32_t b;


    // Ready.

    // If the peripheral bus clock is not an integer multiple of the desired
    // baud rate, we cannot set up the latter exactly.

    // Then, we must ensure, that the actual baud rate does not exceed the
    // desired baud rate.

    b = (f_pbclk - 1) / (4 * f);

#if defined AO_SYS_XC32_PIC32MX_3XX

    // DS80000440.

    // Using BRG values of 0, 1, or 2 causes the Start bit to be shortened.

    // This results in errors when receiving data.

    // This issue exists for BRGH values of 0 and 1.

    // Workaround.

    // Do not use BRG values of 0, 1, or 2.

    ao_assert(b > 2);

#endif

    r->mode.bits.brgh = 1;

    r->brg.reg = b;
}

void ao_uart_baud_low(ao_uart_reg_t * r, uint32_t f_pbclk, uint32_t f)
{
    // Assert.

    ao_assert(r);

    ao_assert(f_pbclk > 0);

    ao_assert(f >= ao_uart_baud_low_min(f_pbclk));
    ao_assert(f <= ao_uart_baud_low_max(f_pbclk));


    // Variables.

    uint32_t b;


    // Ready.

    // If the peripheral bus clock is not an integer multiple of the desired
    // baud rate, we cannot set up the latter exactly.

    // Then, we must ensure, that the actual baud rate does not exceed the
    // desired baud rate.

    b = (f_pbclk - 1) / (16 * f);

#if defined AO_SYS_XC32_PIC32MX_3XX

    // DS80000440.

    // Using BRG values of 0, 1, or 2 causes the Start bit to be shortened.

