tinko26/ao/sys/ao_sys_xc32_pic32.c
    // This results in errors when receiving data.

    // This issue exists for BRGH values of 0 and 1.

    // Workaround.

    // Do not use BRG values of 0, 1, or 2.

    ao_assert(b > 2);

#endif

    r->mode.bits.brgh = 0;

    r->brg.reg = b;
}

// ----------------------------------------------------------------------------

void ao_uart_loopback_disable(ao_uart_reg_t * r)
{
    ao_assert(r);

    r->mode.bits.lpback = 0;
}

void ao_uart_loopback_enable(ao_uart_reg_t * r)
{
    ao_assert(r);

    r->mode.bits.lpback = 1;
}

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

#if defined AO_UART_1 && AO_UART_1

// ----------------------------------------------------------------------------

#if AO_UART_ERROR_1

static  ao_uart_error_info_t    ao_uart_error_info_1;

#endif

#if AO_UART_TX_1

static  ao_sem_t                ao_uart_sem_1;

#endif

// ----------------------------------------------------------------------------

__attribute__ ((weak))
void ao_uart_config_1()
{
    ao_uart_config_baud_1();

    ao_uart_config_frame_1();

    ao_uart_config_loopback_1();
}

__attribute__ ((weak))
void ao_uart_config_baud_1()
{
    ao_uart_baud_1(AO_UART_BAUD_1);
}

__attribute__ ((weak))
void ao_uart_config_frame_1()
{
    ao_uart_reg_t * r = ao_uart_reg_1();

    r->mode.bits.pdsel = AO_UART_DATA_BITS_PARITY_1;

    r->mode.bits.stsel = AO_UART_STOP_BITS_1;
}

__attribute__ ((weak))
void ao_uart_config_loopback_1()
{

#if AO_UART_LOOPBACK_1

    ao_uart_loopback_enable_1();

#else

    ao_uart_loopback_disable_1();

#endif

}

// ----------------------------------------------------------------------------

void ao_uart_start_1()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_1();


    // Ready.

    ao_uart_config_1();

#if AO_UART_RX_1

    // DS80000480.

    // The UxSTA.OERR bit does not get cleared on a module reset.

    // If the OERR bit is set and the module is disabled, the OERR bit retains
    // its status even after the UART module is reinitialized.

    // Workaround.

    // The user software must check this bit in the UART module initialization
    // routine and clear it if it is set.

    r->sta.bits.oerr    = 0;

    r->sta.bits.urxisel = 0;
    r->sta.bits.urxen   = 1;

    ao_ir_u1rx_enable();

#endif

#if AO_UART_TX_1

    ao_task_start(&ao_uart_task_1);

#endif

    r->mode.bits.on = 1;
}

void ao_uart_stop_1()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_1();


    // Ready.

    r->mode.bits.on = 0;

#if AO_UART_TX_1

    ao_sem_give(&ao_uart_sem_1, 1);

#endif

#if AO_UART_RX_1

    ao_ir_u1rx_disable();

    r->sta.bits.urxen = 0;

#endif

}

// ----------------------------------------------------------------------------

#if AO_UART_RX_1

// ----------------------------------------------------------------------------

static  uint8_t     ao_uart_in_store_1[AO_UART_FIFO_CAPACITY];

        ao_send_t   ao_uart_in_1 =
{
        .ptr        = ao_uart_in_store_1
};

// ----------------------------------------------------------------------------

void ao_uart_ir_rx_1()
{
    // Variables.

    uint8_t                 c;

    size_t                  n;

    ao_uart_reg_t * const   r = ao_uart_reg_1();

    ao_send_t *     const   s = &ao_uart_in_1;

    uint32_t                t;


    // Ready.

#if AO_UART_ERROR_1

    t = r->sta.reg & AO_UART_ERROR_OVERRUN;

    if (t)
    {
        ao_uart_error_info_1.flags = (ao_uart_error_flags_t) t;

        ao_uart_error_1(&ao_uart_error_info_1);
    }

#endif


    n = 0;

    while (n < AO_UART_FIFO_CAPACITY && r->sta.bits.urxda)
    {
        t = r->sta.reg & (AO_UART_ERROR_FRAMING | AO_UART_ERROR_PARITY);

        c = r->rx.reg;

        if (t)
        {

#if AO_UART_ERROR_1

            ao_uart_error_info_1.flags = (ao_uart_error_flags_t) t;

            ao_uart_error_1(&ao_uart_error_info_1);

#endif

        }

        else
        {
            ao_uart_in_store_1[n] = c;

            n++;
        }
    }

    r->sta.bits.oerr = 0;

    ao_ir_u1rx_reply();

    s->count_max = n;
    s->count_min = n;

    ao_send_try(s);
}

// ----------------------------------------------------------------------------

#endif

#if AO_UART_TX_1

// ----------------------------------------------------------------------------

static  void            ao_uart_task_proc_1(    void * x);

// ----------------------------------------------------------------------------

static  ao_cond_t       ao_uart_cond_1;

static  ao_cond_wait_t  ao_uart_cond_wait_1 =
{
        .cond           = &ao_uart_cond_1
};

// ----------------------------------------------------------------------------

static  uint8_t         ao_uart_out_store_1     [AO_UART_FIFO_CAPACITY];

        ao_recv_t       ao_uart_out_1 =
{
        .count_max      = AO_UART_FIFO_CAPACITY,

        .count_min      = 1,

        .ptr            = ao_uart_out_store_1
};

// ----------------------------------------------------------------------------

static  ao_sem_take_t   ao_uart_sem_take_1 =
{
        .count          = 1,

        .sem            = &ao_uart_sem_1
};

// ----------------------------------------------------------------------------

        ao_task_t       ao_uart_task_1 =
{
        .proc           = ao_uart_task_proc_1
};

// ----------------------------------------------------------------------------

static  ao_async_t *    ao_uart_async_b_store_1 [2] =
{
                        &ao_uart_cond_wait_1.async,

                        &ao_uart_out_1.async
};

static  ao_async_all_t  ao_uart_async_b_1 =
{
        .store          = ao_uart_async_b_store_1,

        .count          = 2
};

static  ao_async_t *    ao_uart_async_a_store_1 [2] =
{
                        &ao_uart_sem_take_1.async,

                        &ao_uart_async_b_1.async
};

static  ao_async_any_t  ao_uart_async_a_1 =
{
        .store          = ao_uart_async_a_store_1,

        .count          = 2
};

// ----------------------------------------------------------------------------

void ao_uart_ir_tx_1()
{
    ao_cond_set(&ao_uart_cond_1);

