tinko26/ao/sys/ao_sys_xc32_pic32.c
    ao_ir_u1tx_disable();
}

// ----------------------------------------------------------------------------

void ao_uart_task_proc_1(void * x)
{
    // Variables.

    (void) x;


    // Variables.

    ao_async_any_t *    const   async_a     = &ao_uart_async_a_1;

    ao_async_all_t *    const   async_b     = &ao_uart_async_b_1;

    uint8_t *           const   b           = &ao_uart_out_store_1[0];

    ao_cond_t *         const   cond        = &ao_uart_cond_1;

    ao_cond_wait_t *    const   cond_wait   = &ao_uart_cond_wait_1;

    size_t                      i;

    size_t                      n;

    ao_recv_t *         const   out         = &ao_uart_out_1;

    ao_uart_reg_t *     const   r           = ao_uart_reg_1();

    ao_sem_take_t *     const   sem_take    = &ao_uart_sem_take_1;

    bool                        started;


    // Ready.

    while (1)
    {
        // Start.

        r->sta.bits.utxisel = 1;
        r->sta.bits.utxen   = 1;

        ao_ir_u1tx_enable();


        // Start.

        started = true;

        do
        {
            // Await.

            ao_cond_wait_begin(     cond_wait);

            ao_recv_begin(          out);

            ao_async_all_begin(     async_b);

            ao_sem_take_begin(      sem_take);

            ao_await_any_forever(   async_a);

            ao_sem_take_end(        sem_take);

            ao_async_all_end(       async_b);

            ao_recv_end(            out);

            ao_cond_wait_end(       cond_wait);


            // Stop.

            if (sem_take->result)
            {
                started = false;
            }


            // Transmit.

            else if
            (
                cond_wait->result &&
                out      ->result
            )
            {
                // DS60001107.

                // Section 21.5.2.

                // While the UxTXIF flag bit indicates the status of the
                // UxTXREG register, the UxSTA.TRMT bit indicates the status of
                // the UxTSR register.

                // The UxSTA.TRMT bit is a read-only bit and it is set when the
                // UxTSR register is empty.

                // No interrupt logic is tied to this bit, so the user has to
                // poll this bit to determine if the UxTSR register is empty.

                while (!r->sta.bits.trmt) { }

#if defined AO_SYS_XC32_PIC32MX_3XX                                     ||  \
    defined AO_SYS_XC32_PIC32MX_5XX

                // DS80000440.

                // DS80000480.

                // The TRMT bits is asserted during the stop bit generation,
                // not after the stop bit has been sent.

                // Workaround.

                // Add a half bit time delay after the TRMT bit is asserted.

                ao_spin(ao_nanoseconds(1000000000ULL / (AO_UART_BAUD_1)));

#endif

                ao_cond_clear(cond);

                // DS80000737.

                // In order to avoid a race condition, the interrupt flag
                // should be cleared before writing new data to the transmit
                // register.

                ao_ir_u1tx_reply();

                n = out->count;

                for (i = 0; i < n; i++)
                {
                    r->tx.reg = b[i];
                }

                ao_ir_u1tx_enable();
            }
        }
        while (started);


        // Stop.

        ao_ir_u1tx_disable();

        r->sta.bits.utxen = 0;


        // Stop.

        ao_stop();
    }
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_UART_2 && AO_UART_2

// ----------------------------------------------------------------------------

#if AO_UART_ERROR_2

static  ao_uart_error_info_t    ao_uart_error_info_2;

#endif

#if AO_UART_TX_2

static  ao_sem_t                ao_uart_sem_2;

#endif

// ----------------------------------------------------------------------------

__attribute__ ((weak))
void ao_uart_config_2()
{
    ao_uart_config_baud_2();

    ao_uart_config_frame_2();

    ao_uart_config_loopback_2();
}

__attribute__ ((weak))
void ao_uart_config_baud_2()
{
    ao_uart_baud_2(AO_UART_BAUD_2);
}

__attribute__ ((weak))
void ao_uart_config_frame_2()
{
    ao_uart_reg_t * r = ao_uart_reg_2();

    r->mode.bits.pdsel = AO_UART_DATA_BITS_PARITY_2;

    r->mode.bits.stsel = AO_UART_STOP_BITS_2;
}

__attribute__ ((weak))
void ao_uart_config_loopback_2()
{

#if AO_UART_LOOPBACK_2

    ao_uart_loopback_enable_2();

#else

    ao_uart_loopback_disable_2();

#endif

}

// ----------------------------------------------------------------------------

void ao_uart_start_2()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_2();


    // Ready.

    ao_uart_config_2();

#if AO_UART_RX_2

    // DS80000480.

    // The UxSTA.OERR bit does not get cleared on a module reset.

    // If the OERR bit is set and the module is disabled, the OERR bit retains
    // its status even after the UART module is reinitialized.

    // Workaround.

    // The user software must check this bit in the UART module initialization
    // routine and clear it if it is set.

    r->sta.bits.oerr    = 0;

    r->sta.bits.urxisel = 0;
    r->sta.bits.urxen   = 1;

    ao_ir_u2rx_enable();

#endif

#if AO_UART_TX_2

    ao_task_start(&ao_uart_task_2);

#endif

    r->mode.bits.on = 1;
}

void ao_uart_stop_2()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_2();


    // Ready.

    r->mode.bits.on = 0;

#if AO_UART_TX_2

    ao_sem_give(&ao_uart_sem_2, 1);

#endif

#if AO_UART_RX_2

    ao_ir_u2rx_disable();

    r->sta.bits.urxen = 0;

#endif

}

// ----------------------------------------------------------------------------

#if AO_UART_RX_2

// ----------------------------------------------------------------------------

static  uint8_t     ao_uart_in_store_2[AO_UART_FIFO_CAPACITY];

        ao_send_t   ao_uart_in_2 =
{
        .ptr        = ao_uart_in_store_2
};

// ----------------------------------------------------------------------------

void ao_uart_ir_rx_2()
{
    // Variables.

    uint8_t                 c;

