tinko26/ao/sys/ao_sys_xc32_pic32.c
    size_t                  n;

    ao_uart_reg_t * const   r = ao_uart_reg_2();

    ao_send_t *     const   s = &ao_uart_in_2;

    uint32_t                t;


    // Ready.

#if AO_UART_ERROR_2

    t = r->sta.reg & AO_UART_ERROR_OVERRUN;

    if (t)
    {
        ao_uart_error_info_2.flags = (ao_uart_error_flags_t) t;

        ao_uart_error_2(&ao_uart_error_info_2);
    }

#endif


    n = 0;

    while (n < AO_UART_FIFO_CAPACITY && r->sta.bits.urxda)
    {
        t = r->sta.reg & (AO_UART_ERROR_FRAMING | AO_UART_ERROR_PARITY);

        c = r->rx.reg;

        if (t)
        {

#if AO_UART_ERROR_2

            ao_uart_error_info_2.flags = (ao_uart_error_flags_t) t;

            ao_uart_error_2(&ao_uart_error_info_2);

#endif

        }

        else
        {
            ao_uart_in_store_2[n] = c;

            n++;
        }
    }

    r->sta.bits.oerr = 0;

    ao_ir_u2rx_reply();

    s->count_max = n;
    s->count_min = n;

    ao_send_try(s);
}

// ----------------------------------------------------------------------------

#endif

#if AO_UART_TX_2

// ----------------------------------------------------------------------------

static  void            ao_uart_task_proc_2(    void * x);

// ----------------------------------------------------------------------------

static  ao_cond_t       ao_uart_cond_2;

static  ao_cond_wait_t  ao_uart_cond_wait_2 =
{
        .cond           = &ao_uart_cond_2
};

// ----------------------------------------------------------------------------

static  uint8_t         ao_uart_out_store_2     [AO_UART_FIFO_CAPACITY];

        ao_recv_t       ao_uart_out_2 =
{
        .count_max      = AO_UART_FIFO_CAPACITY,

        .count_min      = 1,

        .ptr            = ao_uart_out_store_2
};

// ----------------------------------------------------------------------------

static  ao_sem_take_t   ao_uart_sem_take_2 =
{
        .count          = 1,

        .sem            = &ao_uart_sem_2
};

// ----------------------------------------------------------------------------

        ao_task_t       ao_uart_task_2 =
{
        .proc           = ao_uart_task_proc_2
};

// ----------------------------------------------------------------------------

static  ao_async_t *    ao_uart_async_b_store_2 [2] =
{
                        &ao_uart_cond_wait_2.async,

                        &ao_uart_out_2.async
};

static  ao_async_all_t  ao_uart_async_b_2 =
{
        .store          = ao_uart_async_b_store_2,

        .count          = 2
};

static  ao_async_t *    ao_uart_async_a_store_2 [2] =
{
                        &ao_uart_sem_take_2.async,

                        &ao_uart_async_b_2.async
};

static  ao_async_any_t  ao_uart_async_a_2 =
{
        .store          = ao_uart_async_a_store_2,

        .count          = 2
};

// ----------------------------------------------------------------------------

void ao_uart_ir_tx_2()
{
    ao_cond_set(&ao_uart_cond_2);

    ao_ir_u2tx_disable();
}

// ----------------------------------------------------------------------------

void ao_uart_task_proc_2(void * x)
{
    // Variables.

    (void) x;


    // Variables.

    ao_async_any_t *    const   async_a     = &ao_uart_async_a_2;

    ao_async_all_t *    const   async_b     = &ao_uart_async_b_2;

    uint8_t *           const   b           = &ao_uart_out_store_2[0];

    ao_cond_t *         const   cond        = &ao_uart_cond_2;

    ao_cond_wait_t *    const   cond_wait   = &ao_uart_cond_wait_2;

    size_t                      i;

    size_t                      n;

    ao_recv_t *         const   out         = &ao_uart_out_2;

    ao_uart_reg_t *     const   r           = ao_uart_reg_2();

    ao_sem_take_t *     const   sem_take    = &ao_uart_sem_take_2;

    bool                        started;


    // Ready.

    while (1)
    {
        // Start.

        r->sta.bits.utxisel = 1;
        r->sta.bits.utxen   = 1;

        ao_ir_u2tx_enable();


        // Start.

        started = true;

        do
        {
            // Await.

            ao_cond_wait_begin(     cond_wait);

            ao_recv_begin(          out);

            ao_async_all_begin(     async_b);

            ao_sem_take_begin(      sem_take);

            ao_await_any_forever(   async_a);

            ao_sem_take_end(        sem_take);

            ao_async_all_end(       async_b);

            ao_recv_end(            out);

            ao_cond_wait_end(       cond_wait);


            // Stop.

            if (sem_take->result)
            {
                started = false;
            }


            // Transmit.

            else if
            (
                cond_wait->result &&
                out      ->result
            )
            {
                // DS60001107.

                // Section 21.5.2.

                // While the UxTXIF flag bit indicates the status of the
                // UxTXREG register, the UxSTA.TRMT bit indicates the status of
                // the UxTSR register.

                // The UxSTA.TRMT bit is a read-only bit and it is set when the
                // UxTSR register is empty.

                // No interrupt logic is tied to this bit, so the user has to
                // poll this bit to determine if the UxTSR register is empty.

                while (!r->sta.bits.trmt) { }

#if defined AO_SYS_XC32_PIC32MX_3XX                                     ||  \
    defined AO_SYS_XC32_PIC32MX_5XX

                // DS80000440.

                // DS80000480.

                // The TRMT bits is asserted during the stop bit generation,
                // not after the stop bit has been sent.

                // Workaround.

                // Add a half bit time delay after the TRMT bit is asserted.

                ao_spin(ao_nanoseconds(1000000000ULL / (AO_UART_BAUD_2)));

#endif

                ao_cond_clear(cond);

                // DS80000737.

				// In order to avoid a race condition, the interrupt flag
				// should be cleared before writing new data to the transmit
				// register.

                ao_ir_u2tx_reply();

                n = out->count;

                for (i = 0; i < n; i++)
                {
                    r->tx.reg = b[i];
                }

                ao_ir_u2tx_enable();
            }
        }
        while (started);


