tinko26/ao/sys/ao_sys_xc32_pic32.c
        // Stop.

        ao_ir_u2tx_disable();

        r->sta.bits.utxen = 0;


        // Stop.

        ao_stop();
    }
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_UART_3 && AO_UART_3

// ----------------------------------------------------------------------------

#if AO_UART_ERROR_3

static  ao_uart_error_info_t    ao_uart_error_info_3;

#endif

#if AO_UART_TX_3

static  ao_sem_t                ao_uart_sem_3;

#endif

// ----------------------------------------------------------------------------

__attribute__ ((weak))
void ao_uart_config_3()
{
    ao_uart_config_baud_3();

    ao_uart_config_frame_3();

    ao_uart_config_loopback_3();
}

__attribute__ ((weak))
void ao_uart_config_baud_3()
{
    ao_uart_baud_3(AO_UART_BAUD_3);
}

__attribute__ ((weak))
void ao_uart_config_frame_3()
{
    ao_uart_reg_t * r = ao_uart_reg_3();

    r->mode.bits.pdsel = AO_UART_DATA_BITS_PARITY_3;

    r->mode.bits.stsel = AO_UART_STOP_BITS_3;
}

__attribute__ ((weak))
void ao_uart_config_loopback_3()
{

#if AO_UART_LOOPBACK_3

    ao_uart_loopback_enable_3();

#else

    ao_uart_loopback_disable_3();

#endif

}

// ----------------------------------------------------------------------------

void ao_uart_start_3()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_3();


    // Ready.

    ao_uart_config_3();

#if AO_UART_RX_3

    // DS80000480.

    // The UxSTA.OERR bit does not get cleared on a module reset.

    // If the OERR bit is set and the module is disabled, the OERR bit retains
    // its status even after the UART module is reinitialized.

    // Workaround.

    // The user software must check this bit in the UART module initialization
    // routine and clear it if it is set.

    r->sta.bits.oerr    = 0;

    r->sta.bits.urxisel = 0;
    r->sta.bits.urxen   = 1;

    ao_ir_u3rx_enable();

#endif

#if AO_UART_TX_3

    ao_task_start(&ao_uart_task_3);

#endif

    r->mode.bits.on = 1;
}

void ao_uart_stop_3()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_3();


    // Ready.

    r->mode.bits.on = 0;

#if AO_UART_TX_3

    ao_sem_give(&ao_uart_sem_3, 1);

#endif

#if AO_UART_RX_3

    ao_ir_u3rx_disable();

    r->sta.bits.urxen = 0;

#endif

}

// ----------------------------------------------------------------------------

#if AO_UART_RX_3

// ----------------------------------------------------------------------------

static  uint8_t     ao_uart_in_store_3[AO_UART_FIFO_CAPACITY];

        ao_send_t   ao_uart_in_3 =
{
        .ptr        = ao_uart_in_store_3
};

// ----------------------------------------------------------------------------

void ao_uart_ir_rx_3()
{
    // Variables.

    uint8_t                 c;

    size_t                  n;

    ao_uart_reg_t * const   r = ao_uart_reg_3();

    ao_send_t *     const   s = &ao_uart_in_3;

    uint32_t                t;


    // Ready.

#if AO_UART_ERROR_3

    t = r->sta.reg & AO_UART_ERROR_OVERRUN;

    if (t)
    {
        ao_uart_error_info_3.flags = (ao_uart_error_flags_t) t;

        ao_uart_error_3(&ao_uart_error_info_3);
    }

#endif


    n = 0;

    while (n < AO_UART_FIFO_CAPACITY && r->sta.bits.urxda)
    {
        t = r->sta.reg & (AO_UART_ERROR_FRAMING | AO_UART_ERROR_PARITY);

        c = r->rx.reg;

        if (t)
        {

#if AO_UART_ERROR_3

            ao_uart_error_info_3.flags = (ao_uart_error_flags_t) t;

            ao_uart_error_3(&ao_uart_error_info_3);

#endif

        }

        else
        {
            ao_uart_in_store_3[n] = c;

            n++;
        }
    }

    r->sta.bits.oerr = 0;

    ao_ir_u3rx_reply();

    s->count_max = n;
    s->count_min = n;

    ao_send_try(s);
}

// ----------------------------------------------------------------------------

#endif

#if AO_UART_TX_3

// ----------------------------------------------------------------------------

static  void            ao_uart_task_proc_3(    void * x);

// ----------------------------------------------------------------------------

static  ao_cond_t       ao_uart_cond_3;

static  ao_cond_wait_t  ao_uart_cond_wait_3 =
{
        .cond           = &ao_uart_cond_3
};

// ----------------------------------------------------------------------------

static  uint8_t         ao_uart_out_store_3     [AO_UART_FIFO_CAPACITY];

        ao_recv_t       ao_uart_out_3 =
{
        .count_max      = AO_UART_FIFO_CAPACITY,

        .count_min      = 1,

        .ptr            = ao_uart_out_store_3
};

// ----------------------------------------------------------------------------

static  ao_sem_take_t   ao_uart_sem_take_3 =
{
        .count          = 1,

        .sem            = &ao_uart_sem_3
};

// ----------------------------------------------------------------------------

        ao_task_t       ao_uart_task_3 =
{
        .proc           = ao_uart_task_proc_3
};

// ----------------------------------------------------------------------------

static  ao_async_t *    ao_uart_async_b_store_3 [2] =
{
                        &ao_uart_cond_wait_3.async,

                        &ao_uart_out_3.async
};

static  ao_async_all_t  ao_uart_async_b_3 =
{
        .store          = ao_uart_async_b_store_3,

        .count          = 2
};

static  ao_async_t *    ao_uart_async_a_store_3 [2] =
{
                        &ao_uart_sem_take_3.async,

                        &ao_uart_async_b_3.async
};

static  ao_async_any_t  ao_uart_async_a_3 =
{
        .store          = ao_uart_async_a_store_3,

        .count          = 2
};

// ----------------------------------------------------------------------------

void ao_uart_ir_tx_3()
{
    ao_cond_set(&ao_uart_cond_3);

    ao_ir_u3tx_disable();
}

// ----------------------------------------------------------------------------

void ao_uart_task_proc_3(void * x)
{
    // Variables.

    (void) x;


    // Variables.

    ao_async_any_t *    const   async_a     = &ao_uart_async_a_3;

    ao_async_all_t *    const   async_b     = &ao_uart_async_b_3;

    uint8_t *           const   b           = &ao_uart_out_store_3[0];

    ao_cond_t *         const   cond        = &ao_uart_cond_3;

    ao_cond_wait_t *    const   cond_wait   = &ao_uart_cond_wait_3;

    size_t                      i;

    size_t                      n;

    ao_recv_t *         const   out         = &ao_uart_out_3;

    ao_uart_reg_t *     const   r           = ao_uart_reg_3();

    ao_sem_take_t *     const   sem_take    = &ao_uart_sem_take_3;

    bool                        started;


    // Ready.

    while (1)
    {
        // Start.

