tinko26/ao/sys/ao_sys_xc32_pic32.c
        r->sta.bits.utxisel = 1;
        r->sta.bits.utxen   = 1;

        ao_ir_u3tx_enable();


        // Start.

        started = true;

        do
        {
            // Await.

            ao_cond_wait_begin(     cond_wait);

            ao_recv_begin(          out);

            ao_async_all_begin(     async_b);

            ao_sem_take_begin(      sem_take);

            ao_await_any_forever(   async_a);

            ao_sem_take_end(        sem_take);

            ao_async_all_end(       async_b);

            ao_recv_end(            out);

            ao_cond_wait_end(       cond_wait);


            // Stop.

            if (sem_take->result)
            {
                started = false;
            }


            // Transmit.

            else if
            (
                cond_wait->result &&
                out      ->result
            )
            {
                // DS60001107.

                // Section 21.5.2.

                // While the UxTXIF flag bit indicates the status of the
                // UxTXREG register, the UxSTA.TRMT bit indicates the status of
                // the UxTSR register.

                // The UxSTA.TRMT bit is a read-only bit and it is set when the
                // UxTSR register is empty.

                // No interrupt logic is tied to this bit, so the user has to
                // poll this bit to determine if the UxTSR register is empty.

                while (!r->sta.bits.trmt) { }

#if defined AO_SYS_XC32_PIC32MX_3XX                                     ||  \
    defined AO_SYS_XC32_PIC32MX_5XX

                // DS80000440.

                // DS80000480.

                // The TRMT bits is asserted during the stop bit generation,
                // not after the stop bit has been sent.

                // Workaround.

                // Add a half bit time delay after the TRMT bit is asserted.

                ao_spin(ao_nanoseconds(1000000000ULL / (AO_UART_BAUD_3)));

#endif

                ao_cond_clear(cond);

                // DS80000737.

				// In order to avoid a race condition, the interrupt flag
				// should be cleared before writing new data to the transmit
				// register.

                ao_ir_u3tx_reply();

                n = out->count;

                for (i = 0; i < n; i++)
                {
                    r->tx.reg = b[i];
                }

                ao_ir_u3tx_enable();
            }
        }
        while (started);


        // Stop.

        ao_ir_u3tx_disable();

        r->sta.bits.utxen = 0;


        // Stop.

        ao_stop();
    }
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_UART_4 && AO_UART_4

// ----------------------------------------------------------------------------

#if AO_UART_ERROR_4

static  ao_uart_error_info_t    ao_uart_error_info_4;

#endif

#if AO_UART_TX_4

static  ao_sem_t                ao_uart_sem_4;

#endif

// ----------------------------------------------------------------------------

__attribute__ ((weak))
void ao_uart_config_4()
{
    ao_uart_config_baud_4();

    ao_uart_config_frame_4();

    ao_uart_config_loopback_4();
}

__attribute__ ((weak))
void ao_uart_config_baud_4()
{
    ao_uart_baud_4(AO_UART_BAUD_4);
}

__attribute__ ((weak))
void ao_uart_config_frame_4()
{
    ao_uart_reg_t * r = ao_uart_reg_4();

    r->mode.bits.pdsel = AO_UART_DATA_BITS_PARITY_4;

    r->mode.bits.stsel = AO_UART_STOP_BITS_4;
}

__attribute__ ((weak))
void ao_uart_config_loopback_4()
{

#if AO_UART_LOOPBACK_4

    ao_uart_loopback_enable_4();

#else

    ao_uart_loopback_disable_4();

#endif

}

// ----------------------------------------------------------------------------

void ao_uart_start_4()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_4();


    // Ready.

    ao_uart_config_4();

#if AO_UART_RX_4

    // DS80000480.

    // The UxSTA.OERR bit does not get cleared on a module reset.

    // If the OERR bit is set and the module is disabled, the OERR bit retains
    // its status even after the UART module is reinitialized.

    // Workaround.

    // The user software must check this bit in the UART module initialization
    // routine and clear it if it is set.

    r->sta.bits.oerr    = 0;

    r->sta.bits.urxisel = 0;
    r->sta.bits.urxen   = 1;

    ao_ir_u4rx_enable();

#endif

#if AO_UART_TX_4

    ao_task_start(&ao_uart_task_4);

#endif

    r->mode.bits.on = 1;
}

void ao_uart_stop_4()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_4();


    // Ready.

    r->mode.bits.on = 0;

#if AO_UART_TX_4

    ao_sem_give(&ao_uart_sem_4, 1);

#endif

#if AO_UART_RX_4

    ao_ir_u4rx_disable();

    r->sta.bits.urxen = 0;

#endif

}

// ----------------------------------------------------------------------------

#if AO_UART_RX_4

// ----------------------------------------------------------------------------

static  uint8_t     ao_uart_in_store_4[AO_UART_FIFO_CAPACITY];

        ao_send_t   ao_uart_in_4 =
{
        .ptr        = ao_uart_in_store_4
};

// ----------------------------------------------------------------------------

void ao_uart_ir_rx_4()
{
    // Variables.

    uint8_t                 c;

    size_t                  n;

    ao_uart_reg_t * const   r = ao_uart_reg_4();

    ao_send_t *     const   s = &ao_uart_in_4;

    uint32_t                t;


    // Ready.

#if AO_UART_ERROR_4

    t = r->sta.reg & AO_UART_ERROR_OVERRUN;

    if (t)
    {
        ao_uart_error_info_4.flags = (ao_uart_error_flags_t) t;

        ao_uart_error_4(&ao_uart_error_info_4);
    }

#endif


    n = 0;

    while (n < AO_UART_FIFO_CAPACITY && r->sta.bits.urxda)
    {
        t = r->sta.reg & (AO_UART_ERROR_FRAMING | AO_UART_ERROR_PARITY);

        c = r->rx.reg;

        if (t)
        {

#if AO_UART_ERROR_4

            ao_uart_error_info_4.flags = (ao_uart_error_flags_t) t;

            ao_uart_error_4(&ao_uart_error_info_4);

#endif

        }

        else
        {
            ao_uart_in_store_4[n] = c;

