tinko26/ao/sys/ao_sys_xc32_pic32.c
            n++;
        }
    }

    r->sta.bits.oerr = 0;

    ao_ir_u4rx_reply();

    s->count_max = n;
    s->count_min = n;

    ao_send_try(s);
}

// ----------------------------------------------------------------------------

#endif

#if AO_UART_TX_4

// ----------------------------------------------------------------------------

static  void            ao_uart_task_proc_4(    void * x);

// ----------------------------------------------------------------------------

static  ao_cond_t       ao_uart_cond_4;

static  ao_cond_wait_t  ao_uart_cond_wait_4 =
{
        .cond           = &ao_uart_cond_4
};

// ----------------------------------------------------------------------------

static  uint8_t         ao_uart_out_store_4     [AO_UART_FIFO_CAPACITY];

        ao_recv_t       ao_uart_out_4 =
{
        .count_max      = AO_UART_FIFO_CAPACITY,

        .count_min      = 1,

        .ptr            = ao_uart_out_store_4
};

// ----------------------------------------------------------------------------

static  ao_sem_take_t   ao_uart_sem_take_4 =
{
        .count          = 1,

        .sem            = &ao_uart_sem_4
};

// ----------------------------------------------------------------------------

        ao_task_t       ao_uart_task_4 =
{
        .proc           = ao_uart_task_proc_4
};

// ----------------------------------------------------------------------------

static  ao_async_t *    ao_uart_async_b_store_4 [2] =
{
                        &ao_uart_cond_wait_4.async,

                        &ao_uart_out_4.async
};

static  ao_async_all_t  ao_uart_async_b_4 =
{
        .store          = ao_uart_async_b_store_4,

        .count          = 2
};

static  ao_async_t *    ao_uart_async_a_store_4 [2] =
{
                        &ao_uart_sem_take_4.async,

                        &ao_uart_async_b_4.async
};

static  ao_async_any_t  ao_uart_async_a_4 =
{
        .store          = ao_uart_async_a_store_4,

        .count          = 2
};

// ----------------------------------------------------------------------------

void ao_uart_ir_tx_4()
{
    ao_cond_set(&ao_uart_cond_4);

    ao_ir_u4tx_disable();
}

// ----------------------------------------------------------------------------

void ao_uart_task_proc_4(void * x)
{
    // Variables.

    (void) x;


    // Variables.

    ao_async_any_t *    const   async_a     = &ao_uart_async_a_4;

    ao_async_all_t *    const   async_b     = &ao_uart_async_b_4;

    uint8_t *           const   b           = &ao_uart_out_store_4[0];

    ao_cond_t *         const   cond        = &ao_uart_cond_4;

    ao_cond_wait_t *    const   cond_wait   = &ao_uart_cond_wait_4;

    size_t                      i;

    size_t                      n;

    ao_recv_t *         const   out         = &ao_uart_out_4;

    ao_uart_reg_t *     const   r           = ao_uart_reg_4();

    ao_sem_take_t *     const   sem_take    = &ao_uart_sem_take_4;

    bool                        started;


    // Ready.

    while (1)
    {
        // Start.

        r->sta.bits.utxisel = 1;
        r->sta.bits.utxen   = 1;

        ao_ir_u4tx_enable();


        // Start.

        started = true;

        do
        {
            // Await.

            ao_cond_wait_begin(     cond_wait);

            ao_recv_begin(          out);

            ao_async_all_begin(     async_b);

            ao_sem_take_begin(      sem_take);

            ao_await_any_forever(   async_a);

            ao_sem_take_end(        sem_take);

            ao_async_all_end(       async_b);

            ao_recv_end(            out);

            ao_cond_wait_end(       cond_wait);


            // Stop.

            if (sem_take->result)
            {
                started = false;
            }


            // Transmit.

            else if
            (
                cond_wait->result &&
                out      ->result
            )
            {
                // DS60001107.

                // Section 21.5.2.

                // While the UxTXIF flag bit indicates the status of the
                // UxTXREG register, the UxSTA.TRMT bit indicates the status of
                // the UxTSR register.

                // The UxSTA.TRMT bit is a read-only bit and it is set when the
                // UxTSR register is empty.

                // No interrupt logic is tied to this bit, so the user has to
                // poll this bit to determine if the UxTSR register is empty.

                while (!r->sta.bits.trmt) { }

#if defined AO_SYS_XC32_PIC32MX_3XX                                     ||  \
    defined AO_SYS_XC32_PIC32MX_5XX

                // DS80000440.

                // DS80000480.

                // The TRMT bits is asserted during the stop bit generation,
                // not after the stop bit has been sent.

                // Workaround.

                // Add a half bit time delay after the TRMT bit is asserted.

                ao_spin(ao_nanoseconds(1000000000ULL / (AO_UART_BAUD_4)));

#endif

                ao_cond_clear(cond);

                // DS80000737.

				// In order to avoid a race condition, the interrupt flag
				// should be cleared before writing new data to the transmit
				// register.

                ao_ir_u4tx_reply();

                n = out->count;

                for (i = 0; i < n; i++)
                {
                    r->tx.reg = b[i];
                }

                ao_ir_u4tx_enable();
            }
        }
        while (started);


        // Stop.

        ao_ir_u4tx_disable();

        r->sta.bits.utxen = 0;


        // Stop.

        ao_stop();
    }
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_UART_5 && AO_UART_5

// ----------------------------------------------------------------------------

#if AO_UART_ERROR_5

static  ao_uart_error_info_t    ao_uart_error_info_5;

#endif

#if AO_UART_TX_5

static  ao_sem_t                ao_uart_sem_5;

#endif

// ----------------------------------------------------------------------------

__attribute__ ((weak))
void ao_uart_config_5()
{
    ao_uart_config_baud_5();

    ao_uart_config_frame_5();

