tinko26/ao/sys/ao_sys_xc32_pic32.c
    ao_uart_config_loopback_5();
}

__attribute__ ((weak))
void ao_uart_config_baud_5()
{
    ao_uart_baud_5(AO_UART_BAUD_5);
}

__attribute__ ((weak))
void ao_uart_config_frame_5()
{
    ao_uart_reg_t * r = ao_uart_reg_5();

    r->mode.bits.pdsel = AO_UART_DATA_BITS_PARITY_5;

    r->mode.bits.stsel = AO_UART_STOP_BITS_5;
}

__attribute__ ((weak))
void ao_uart_config_loopback_5()
{

#if AO_UART_LOOPBACK_5

    ao_uart_loopback_enable_5();

#else

    ao_uart_loopback_disable_5();

#endif

}

// ----------------------------------------------------------------------------

void ao_uart_start_5()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_5();


    // Ready.

    ao_uart_config_5();

#if AO_UART_RX_5

    // DS80000480.

    // The UxSTA.OERR bit does not get cleared on a module reset.

    // If the OERR bit is set and the module is disabled, the OERR bit retains
    // its status even after the UART module is reinitialized.

    // Workaround.

    // The user software must check this bit in the UART module initialization
    // routine and clear it if it is set.

    r->sta.bits.oerr    = 0;

    r->sta.bits.urxisel = 0;
    r->sta.bits.urxen   = 1;

    ao_ir_u5rx_enable();

#endif

#if AO_UART_TX_5

    ao_task_start(&ao_uart_task_5);

#endif

    r->mode.bits.on = 1;
}

void ao_uart_stop_5()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_5();


    // Ready.

    r->mode.bits.on = 0;

#if AO_UART_TX_5

    ao_sem_give(&ao_uart_sem_5, 1);

#endif

#if AO_UART_RX_5

    ao_ir_u5rx_disable();

    r->sta.bits.urxen = 0;

#endif

}

// ----------------------------------------------------------------------------

#if AO_UART_RX_5

// ----------------------------------------------------------------------------

static  uint8_t     ao_uart_in_store_5[AO_UART_FIFO_CAPACITY];

        ao_send_t   ao_uart_in_5 =
{
        .ptr        = ao_uart_in_store_5
};

// ----------------------------------------------------------------------------

void ao_uart_ir_rx_5()
{
    // Variables.

    uint8_t                 c;

    size_t                  n;

    ao_uart_reg_t * const   r = ao_uart_reg_5();

    ao_send_t *     const   s = &ao_uart_in_5;

    uint32_t                t;


    // Ready.

#if AO_UART_ERROR_5

    t = r->sta.reg & AO_UART_ERROR_OVERRUN;

    if (t)
    {
        ao_uart_error_info_5.flags = (ao_uart_error_flags_t) t;

        ao_uart_error_5(&ao_uart_error_info_5);
    }

#endif


    n = 0;

    while (n < AO_UART_FIFO_CAPACITY && r->sta.bits.urxda)
    {
        t = r->sta.reg & (AO_UART_ERROR_FRAMING | AO_UART_ERROR_PARITY);

        c = r->rx.reg;

        if (t)
        {

#if AO_UART_ERROR_5

            ao_uart_error_info_5.flags = (ao_uart_error_flags_t) t;

            ao_uart_error_5(&ao_uart_error_info_5);

#endif

        }

        else
        {
            ao_uart_in_store_5[n] = c;

            n++;
        }
    }

    r->sta.bits.oerr = 0;

    ao_ir_u5rx_reply();

    s->count_max = n;
    s->count_min = n;

    ao_send_try(s);
}

// ----------------------------------------------------------------------------

#endif

#if AO_UART_TX_5

// ----------------------------------------------------------------------------

static  void            ao_uart_task_proc_5(    void * x);

// ----------------------------------------------------------------------------

static  ao_cond_t       ao_uart_cond_5;

static  ao_cond_wait_t  ao_uart_cond_wait_5 =
{
        .cond           = &ao_uart_cond_5
};

// ----------------------------------------------------------------------------

static  uint8_t         ao_uart_out_store_5     [AO_UART_FIFO_CAPACITY];

        ao_recv_t       ao_uart_out_5 =
{
        .count_max      = AO_UART_FIFO_CAPACITY,

        .count_min      = 1,

        .ptr            = ao_uart_out_store_5
};

// ----------------------------------------------------------------------------

static  ao_sem_take_t   ao_uart_sem_take_5 =
{
        .count          = 1,

        .sem            = &ao_uart_sem_5
};

// ----------------------------------------------------------------------------

        ao_task_t       ao_uart_task_5 =
{
        .proc           = ao_uart_task_proc_5
};

// ----------------------------------------------------------------------------

static  ao_async_t *    ao_uart_async_b_store_5 [2] =
{
                        &ao_uart_cond_wait_5.async,

                        &ao_uart_out_5.async
};

static  ao_async_all_t  ao_uart_async_b_5 =
{
        .store          = ao_uart_async_b_store_5,

        .count          = 2
};

static  ao_async_t *    ao_uart_async_a_store_5 [2] =
{
                        &ao_uart_sem_take_5.async,

                        &ao_uart_async_b_5.async
};

static  ao_async_any_t  ao_uart_async_a_5 =
{
        .store          = ao_uart_async_a_store_5,

        .count          = 2
};

// ----------------------------------------------------------------------------

void ao_uart_ir_tx_5()
{
    ao_cond_set(&ao_uart_cond_5);

    ao_ir_u5tx_disable();
}

// ----------------------------------------------------------------------------

void ao_uart_task_proc_5(void * x)
{
    // Variables.

    (void) x;


    // Variables.

    ao_async_any_t *    const   async_a     = &ao_uart_async_a_5;

    ao_async_all_t *    const   async_b     = &ao_uart_async_b_5;

    uint8_t *           const   b           = &ao_uart_out_store_5[0];

    ao_cond_t *         const   cond        = &ao_uart_cond_5;

    ao_cond_wait_t *    const   cond_wait   = &ao_uart_cond_wait_5;

    size_t                      i;

    size_t                      n;

    ao_recv_t *         const   out         = &ao_uart_out_5;

    ao_uart_reg_t *     const   r           = ao_uart_reg_5();

    ao_sem_take_t *     const   sem_take    = &ao_uart_sem_take_5;

    bool                        started;


    // Ready.

    while (1)
    {
        // Start.

        r->sta.bits.utxisel = 1;
        r->sta.bits.utxen   = 1;

        ao_ir_u5tx_enable();


        // Start.

        started = true;

        do
        {
            // Await.

            ao_cond_wait_begin(     cond_wait);

            ao_recv_begin(          out);

            ao_async_all_begin(     async_b);

            ao_sem_take_begin(      sem_take);

            ao_await_any_forever(   async_a);

            ao_sem_take_end(        sem_take);

            ao_async_all_end(       async_b);

            ao_recv_end(            out);

            ao_cond_wait_end(       cond_wait);


