tinko26/ao/sys/ao_sys_xc32_pic32.c
            // Stop.

            if (sem_take->result)
            {
                started = false;
            }


            // Transmit.

            else if
            (
                cond_wait->result &&
                out      ->result
            )
            {
                // DS60001107.

                // Section 21.5.2.

                // While the UxTXIF flag bit indicates the status of the
                // UxTXREG register, the UxSTA.TRMT bit indicates the status of
                // the UxTSR register.

                // The UxSTA.TRMT bit is a read-only bit and it is set when the
                // UxTSR register is empty.

                // No interrupt logic is tied to this bit, so the user has to
                // poll this bit to determine if the UxTSR register is empty.

                while (!r->sta.bits.trmt) { }

#if defined AO_SYS_XC32_PIC32MX_3XX                                     ||  \
    defined AO_SYS_XC32_PIC32MX_5XX

                // DS80000440.

                // DS80000480.

                // The TRMT bits is asserted during the stop bit generation,
                // not after the stop bit has been sent.

                // Workaround.

                // Add a half bit time delay after the TRMT bit is asserted.

                ao_spin(ao_nanoseconds(1000000000ULL / (AO_UART_BAUD_5)));

#endif

                ao_cond_clear(cond);

                // DS80000737.

				// In order to avoid a race condition, the interrupt flag
				// should be cleared before writing new data to the transmit
				// register.

                ao_ir_u5tx_reply();

                n = out->count;

                for (i = 0; i < n; i++)
                {
                    r->tx.reg = b[i];
                }

                ao_ir_u5tx_enable();
            }
        }
        while (started);


        // Stop.

        ao_ir_u5tx_disable();

        r->sta.bits.utxen = 0;


        // Stop.

        ao_stop();
    }
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_UART_6 && AO_UART_6

// ----------------------------------------------------------------------------

#if AO_UART_ERROR_6

static  ao_uart_error_info_t    ao_uart_error_info_6;

#endif

#if AO_UART_TX_6

static  ao_sem_t                ao_uart_sem_6;

#endif

// ----------------------------------------------------------------------------

__attribute__ ((weak))
void ao_uart_config_6()
{
    ao_uart_config_baud_6();

    ao_uart_config_frame_6();

    ao_uart_config_loopback_6();
}

__attribute__ ((weak))
void ao_uart_config_baud_6()
{
    ao_uart_baud_6(AO_UART_BAUD_6);
}

__attribute__ ((weak))
void ao_uart_config_frame_6()
{
    ao_uart_reg_t * r = ao_uart_reg_6();

    r->mode.bits.pdsel = AO_UART_DATA_BITS_PARITY_6;

    r->mode.bits.stsel = AO_UART_STOP_BITS_6;
}

__attribute__ ((weak))
void ao_uart_config_loopback_6()
{

#if AO_UART_LOOPBACK_6

    ao_uart_loopback_enable_6();

#else

    ao_uart_loopback_disable_6();

#endif

}

// ----------------------------------------------------------------------------

void ao_uart_start_6()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_6();


    // Ready.

    ao_uart_config_6();

#if AO_UART_RX_6

    // DS80000480.

    // The UxSTA.OERR bit does not get cleared on a module reset.

    // If the OERR bit is set and the module is disabled, the OERR bit retains
    // its status even after the UART module is reinitialized.

    // Workaround.

    // The user software must check this bit in the UART module initialization
    // routine and clear it if it is set.

    r->sta.bits.oerr    = 0;

    r->sta.bits.urxisel = 0;
    r->sta.bits.urxen   = 1;

    ao_ir_u6rx_enable();

#endif

#if AO_UART_TX_6

    ao_task_start(&ao_uart_task_6);

#endif

    r->mode.bits.on = 1;
}

void ao_uart_stop_6()
{
    // Variables.

    ao_uart_reg_t * r = ao_uart_reg_6();


    // Ready.

    r->mode.bits.on = 0;

#if AO_UART_TX_6

    ao_sem_give(&ao_uart_sem_6, 1);

#endif

#if AO_UART_RX_6

    ao_ir_u6rx_disable();

    r->sta.bits.urxen = 0;

#endif

}

// ----------------------------------------------------------------------------

#if AO_UART_RX_6

// ----------------------------------------------------------------------------

static  uint8_t     ao_uart_in_store_6[AO_UART_FIFO_CAPACITY];

        ao_send_t   ao_uart_in_6 =
{
        .ptr        = ao_uart_in_store_6
};

// ----------------------------------------------------------------------------

void ao_uart_ir_rx_6()
{
    // Variables.

    uint8_t                 c;

    size_t                  n;

    ao_uart_reg_t * const   r = ao_uart_reg_6();

    ao_send_t *     const   s = &ao_uart_in_6;

    uint32_t                t;


    // Ready.

#if AO_UART_ERROR_6

    t = r->sta.reg & AO_UART_ERROR_OVERRUN;

    if (t)
    {
        ao_uart_error_info_6.flags = (ao_uart_error_flags_t) t;

        ao_uart_error_6(&ao_uart_error_info_6);
    }

#endif


    n = 0;

    while (n < AO_UART_FIFO_CAPACITY && r->sta.bits.urxda)
    {
        t = r->sta.reg & (AO_UART_ERROR_FRAMING | AO_UART_ERROR_PARITY);

        c = r->rx.reg;

        if (t)
        {

#if AO_UART_ERROR_6

            ao_uart_error_info_6.flags = (ao_uart_error_flags_t) t;

            ao_uart_error_6(&ao_uart_error_info_6);

#endif

        }

        else
        {
            ao_uart_in_store_6[n] = c;

            n++;
        }
    }

    r->sta.bits.oerr = 0;

    ao_ir_u6rx_reply();

    s->count_max = n;
    s->count_min = n;

    ao_send_try(s);
}

// ----------------------------------------------------------------------------

#endif

#if AO_UART_TX_6

// ----------------------------------------------------------------------------

static  void            ao_uart_task_proc_6(    void * x);

// ----------------------------------------------------------------------------

static  ao_cond_t       ao_uart_cond_6;

static  ao_cond_wait_t  ao_uart_cond_wait_6 =
{
        .cond           = &ao_uart_cond_6
};

// ----------------------------------------------------------------------------

static  uint8_t         ao_uart_out_store_6     [AO_UART_FIFO_CAPACITY];

        ao_recv_t       ao_uart_out_6 =
{
        .count_max      = AO_UART_FIFO_CAPACITY,

        .count_min      = 1,

        .ptr            = ao_uart_out_store_6
};

// ----------------------------------------------------------------------------

static  ao_sem_take_t   ao_uart_sem_take_6 =
{
        .count          = 1,

