tinko26/ao/sys/ao_sys_xc32_pic32.c
        .sem            = &ao_uart_sem_6
};

// ----------------------------------------------------------------------------

        ao_task_t       ao_uart_task_6 =
{
        .proc           = ao_uart_task_proc_6
};

// ----------------------------------------------------------------------------

static  ao_async_t *    ao_uart_async_b_store_6 [2] =
{
                        &ao_uart_cond_wait_6.async,

                        &ao_uart_out_6.async
};

static  ao_async_all_t  ao_uart_async_b_6 =
{
        .store          = ao_uart_async_b_store_6,

        .count          = 2
};

static  ao_async_t *    ao_uart_async_a_store_6 [2] =
{
                        &ao_uart_sem_take_6.async,

                        &ao_uart_async_b_6.async
};

static  ao_async_any_t  ao_uart_async_a_6 =
{
        .store          = ao_uart_async_a_store_6,

        .count          = 2
};

// ----------------------------------------------------------------------------

void ao_uart_ir_tx_6()
{
    ao_cond_set(&ao_uart_cond_6);

    ao_ir_u6tx_disable();
}

// ----------------------------------------------------------------------------

void ao_uart_task_proc_6(void * x)
{
    // Variables.

    (void) x;


    // Variables.

    ao_async_any_t *    const   async_a     = &ao_uart_async_a_6;

    ao_async_all_t *    const   async_b     = &ao_uart_async_b_6;

    uint8_t *           const   b           = &ao_uart_out_store_6[0];

    ao_cond_t *         const   cond        = &ao_uart_cond_6;

    ao_cond_wait_t *    const   cond_wait   = &ao_uart_cond_wait_6;

    size_t                      i;

    size_t                      n;

    ao_recv_t *         const   out         = &ao_uart_out_6;

    ao_uart_reg_t *     const   r           = ao_uart_reg_6();

    ao_sem_take_t *     const   sem_take    = &ao_uart_sem_take_6;

    bool                        started;


    // Ready.

    while (1)
    {
        // Start.

        r->sta.bits.utxisel = 1;
        r->sta.bits.utxen   = 1;

        ao_ir_u6tx_enable();


        // Start.

        started = true;

        do
        {
            // Await.

            ao_cond_wait_begin(     cond_wait);

            ao_recv_begin(          out);

            ao_async_all_begin(     async_b);

            ao_sem_take_begin(      sem_take);

            ao_await_any_forever(   async_a);

            ao_sem_take_end(        sem_take);

            ao_async_all_end(       async_b);

            ao_recv_end(            out);

            ao_cond_wait_end(       cond_wait);


            // Stop.

            if (sem_take->result)
            {
                started = false;
            }


            // Transmit.

            else if
            (
                cond_wait->result &&
                out      ->result
            )
            {
                // DS60001107.

                // Section 21.5.2.

                // While the UxTXIF flag bit indicates the status of the
                // UxTXREG register, the UxSTA.TRMT bit indicates the status of
                // the UxTSR register.

                // The UxSTA.TRMT bit is a read-only bit and it is set when the
                // UxTSR register is empty.

                // No interrupt logic is tied to this bit, so the user has to
                // poll this bit to determine if the UxTSR register is empty.

                while (!r->sta.bits.trmt) { }

#if defined AO_SYS_XC32_PIC32MX_3XX                                     ||  \
    defined AO_SYS_XC32_PIC32MX_5XX

                // DS80000440.

                // DS80000480.

                // The TRMT bits is asserted during the stop bit generation,
                // not after the stop bit has been sent.

                // Workaround.

                // Add a half bit time delay after the TRMT bit is asserted.

                ao_spin(ao_nanoseconds(1000000000ULL / (AO_UART_BAUD_6)));

#endif

                ao_cond_clear(cond);

                // DS80000737.

				// In order to avoid a race condition, the interrupt flag
				// should be cleared before writing new data to the transmit
				// register.

                ao_ir_u6tx_reply();

                n = out->count;

                for (i = 0; i < n; i++)
                {
                    r->tx.reg = b[i];
                }

                ao_ir_u6tx_enable();
            }
        }
        while (started);


        // Stop.

        ao_ir_u6tx_disable();

        r->sta.bits.utxen = 0;


        // Stop.

        ao_stop();
    }
}

// ----------------------------------------------------------------------------

#endif

#endif

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

#if defined AO_SYS_XC32_PIC32MK

#if defined AO_UART_1 && AO_UART_1 && AO_UART_RX_1

// ----------------------------------------------------------------------------

AO_IR_U1RX_ATTRIBUTE
void ao_ir_u1rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_1);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_1 && AO_UART_1 && AO_UART_TX_1

// ----------------------------------------------------------------------------

AO_IR_U1TX_ATTRIBUTE
void ao_ir_u1tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_1);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_2 && AO_UART_2 && AO_UART_RX_2

// ----------------------------------------------------------------------------

AO_IR_U2RX_ATTRIBUTE
void ao_ir_u2rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_2);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_2 && AO_UART_2 && AO_UART_TX_2

// ----------------------------------------------------------------------------

AO_IR_U2TX_ATTRIBUTE
void ao_ir_u2tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_2);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_3 && AO_UART_3 && AO_UART_RX_3

// ----------------------------------------------------------------------------

AO_IR_U3RX_ATTRIBUTE
void ao_ir_u3rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_3);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_3 && AO_UART_3 && AO_UART_TX_3

// ----------------------------------------------------------------------------

AO_IR_U3TX_ATTRIBUTE
void ao_ir_u3tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_3);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_4 && AO_UART_4 && AO_UART_RX_4

// ----------------------------------------------------------------------------

AO_IR_U4RX_ATTRIBUTE
void ao_ir_u4rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_4);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_4 && AO_UART_4 && AO_UART_TX_4

// ----------------------------------------------------------------------------

AO_IR_U4TX_ATTRIBUTE
void ao_ir_u4tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_4);
}

// ----------------------------------------------------------------------------

#endif

