tinko26/ao/sys/ao_sys_xc32_pic32.c
#if defined AO_UART_5 && AO_UART_5 && AO_UART_RX_5

// ----------------------------------------------------------------------------

AO_IR_U5RX_ATTRIBUTE
void ao_ir_u5rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_5);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_5 && AO_UART_5 && AO_UART_TX_5

// ----------------------------------------------------------------------------

AO_IR_U5TX_ATTRIBUTE
void ao_ir_u5tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_5);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_6 && AO_UART_6 && AO_UART_RX_6

// ----------------------------------------------------------------------------

AO_IR_U6RX_ATTRIBUTE
void ao_ir_u6rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_6);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_6 && AO_UART_6 && AO_UART_TX_6

// ----------------------------------------------------------------------------

AO_IR_U6TX_ATTRIBUTE
void ao_ir_u6tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_6);
}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MX

#if defined AO_UART_1 && AO_UART_1

// ----------------------------------------------------------------------------

AO_IR_U1_ATTRIBUTE
void ao_ir_u1()
{

#if AO_UART_RX_1

    if (ao_ir_u1rx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_1);
    }

#endif

#if AO_UART_TX_1

    if (ao_ir_u1tx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_1);
    }

#endif

}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_2 && AO_UART_2

// ----------------------------------------------------------------------------

AO_IR_U2_ATTRIBUTE
void ao_ir_u2()
{

#if AO_UART_RX_2

    if (ao_ir_u2rx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_2);
    }

#endif

#if AO_UART_TX_2

    if (ao_ir_u2tx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_2);
    }

#endif

}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_3 && AO_UART_3

// ----------------------------------------------------------------------------

AO_IR_U3_ATTRIBUTE
void ao_ir_u3()
{

#if AO_UART_RX_3

    if (ao_ir_u3rx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_3);
    }

#endif

#if AO_UART_TX_3

    if (ao_ir_u3tx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_3);
    }

#endif

}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_4 && AO_UART_4

// ----------------------------------------------------------------------------

AO_IR_U4_ATTRIBUTE
void ao_ir_u4()
{

#if AO_UART_RX_4

    if (ao_ir_u4rx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_4);
    }

#endif

#if AO_UART_TX_4

    if (ao_ir_u4tx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_4);
    }

#endif

}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_5 && AO_UART_5

// ----------------------------------------------------------------------------

AO_IR_U5_ATTRIBUTE
void ao_ir_u5()
{

#if AO_UART_RX_5

    if (ao_ir_u5rx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_5);
    }

#endif

#if AO_UART_TX_5

    if (ao_ir_u5tx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_5);
    }

#endif

}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_6 && AO_UART_6

// ----------------------------------------------------------------------------

AO_IR_U6_ATTRIBUTE
void ao_ir_u6()
{

#if AO_UART_RX_6

    if (ao_ir_u6rx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_6);
    }

#endif

#if AO_UART_TX_6

    if (ao_ir_u6tx_is_pending())
    {
        ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_6);
    }

#endif

}

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32MZ

#if defined AO_UART_1 && AO_UART_1 && AO_UART_RX_1

// ----------------------------------------------------------------------------

AO_IR_U1RX_ATTRIBUTE
void ao_ir_u1rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_1);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_1 && AO_UART_1 && AO_UART_TX_1

// ----------------------------------------------------------------------------

AO_IR_U1TX_ATTRIBUTE
void ao_ir_u1tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_1);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_2 && AO_UART_2 && AO_UART_RX_2

// ----------------------------------------------------------------------------

AO_IR_U2RX_ATTRIBUTE
void ao_ir_u2rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_2);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_2 && AO_UART_2 && AO_UART_TX_2

// ----------------------------------------------------------------------------

AO_IR_U2TX_ATTRIBUTE
void ao_ir_u2tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_2);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_3 && AO_UART_3 && AO_UART_RX_3

// ----------------------------------------------------------------------------

AO_IR_U3RX_ATTRIBUTE
void ao_ir_u3rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_3);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_3 && AO_UART_3 && AO_UART_TX_3

// ----------------------------------------------------------------------------

AO_IR_U3TX_ATTRIBUTE
void ao_ir_u3tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_3);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_4 && AO_UART_4 && AO_UART_RX_4

// ----------------------------------------------------------------------------

AO_IR_U4RX_ATTRIBUTE
void ao_ir_u4rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_4);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_4 && AO_UART_4 && AO_UART_TX_4

// ----------------------------------------------------------------------------

AO_IR_U4TX_ATTRIBUTE
void ao_ir_u4tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_4);
}

// ----------------------------------------------------------------------------

#endif

