tinko26/ao/sys/ao_sys_xc32_pic32.c
#if defined AO_UART_5 && AO_UART_5 && AO_UART_RX_5

// ----------------------------------------------------------------------------

AO_IR_U5RX_ATTRIBUTE
void ao_ir_u5rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_5);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_5 && AO_UART_5 && AO_UART_TX_5

// ----------------------------------------------------------------------------

AO_IR_U5TX_ATTRIBUTE
void ao_ir_u5tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_5);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_6 && AO_UART_6 && AO_UART_RX_6

// ----------------------------------------------------------------------------

AO_IR_U6RX_ATTRIBUTE
void ao_ir_u6rx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_rx_6);
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_UART_6 && AO_UART_6 && AO_UART_TX_6

// ----------------------------------------------------------------------------

AO_IR_U6TX_ATTRIBUTE
void ao_ir_u6tx()
{
    ao_ir_stack_func0((ao_func0_t) ao_uart_ir_tx_6);
}

// ----------------------------------------------------------------------------

#endif

#endif

// ----------------------------------------------------------------------------

#endif

#endif

#if defined AO_SYS_XC32_PIC32_WDT

#if defined AO_WDT

// ----------------------------------------------------------------------------

#if defined AO_SYS_XC32_PIC32MX

// ----------------------------------------------------------------------------

void ao_wdt_reset()
{
    WDTCONSET = _WDTCON_WDTCLR_MASK;
}

// ----------------------------------------------------------------------------

#endif

#if defined AO_SYS_XC32_PIC32MK || defined AO_SYS_XC32_PIC32MZ

// ----------------------------------------------------------------------------

void ao_wdt_reset()
{
    volatile uint16_t * key;

    key = (volatile uint16_t *) &WDTCON;

    key = key + (_WDTCON_WDTCLRKEY_POSITION >> 4);

    *key = 0x5743;
}

// ----------------------------------------------------------------------------

#endif

// ----------------------------------------------------------------------------

#endif

#endif

// ----------------------------------------------------------------------------
